{
  "items": [
    {
      "title": "Amazon GuardDuty EC2 Runtime Monitoring is now generally available",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/03/amazon-guardduty-ec2-runtime-monitoring-available/",
      "pubDate": "Fri, 29 Mar 2024 20:29:59 +0000",
      "category": "Security",
      "content": "  Amazon GuardDuty EC2 Runtime Monitoring is now generally available \n Posted On:  Mar 29, 2024 \nToday, AWS announces the general availability of Amazon GuardDuty EC2 Runtime Monitoring. This feature deepens threat detection coverage for Amazon Elastic Compute Cloud (Amazon EC2). It gives you visibility into on-host, operating system–level activities and provides container-level context of detected threats. It complements runtime coverage already available for Amazon Elastic Kubernetes Service (Amazon EKS) and Amazon Elastic Container Service (Amazon ECS) on AWS Fargate, giving you comprehensive runtime visibility and detection across popular AWS compute services. \nGuardDuty Runtime Monitoring helps you identify and respond to potential threats, including instances or self-managed containers in your AWS environment that are querying IP addresses associated with cryptocurrency-related activity or making connections to a Tor network as a Tor relay. Threats to compute workloads often involve remote code execution that leads to the download and execution of malware. GuardDuty Runtime Monitoring provides visibility into suspicious commands that involve malicious file downloads and execution across each step, providing earlier discovery of threats during initial compromise—before they become business-impacting events. \nTens of thousands of customers across many industries and geographies use GuardDuty. You can enable GuardDuty EC2 Runtime Monitoring in a few steps in the GuardDuty console. GuardDuty will immediately begin collecting and analyzing runtime event activity for potential threats. Using AWS Organizations, you can centrally enable runtime threat detection—including automated agent management—for accounts and workloads across the organization to simplify your security coverage. \nThis feature is generally available in all AWS Regions where GuardDuty is available, excluding AWS GovCloud (US) Regions and AWS China Regions.\nTo learn more and get started, try GuardDuty EC2 Runtime Monitoring for 30 days at no cost on the AWS Free Tier. You can also subscribe to feature updates with the Amazon GuardDuty SNS topic.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 88.46153846153845
    },
    {
      "title": "ElastiCache Serverless is now available in the AWS Canada West (Calgary) region",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/elasticache-serverless-aws-canada-west-calgary-region/",
      "pubDate": "Thu, 04 Apr 2024 17:27:32 +0000",
      "category": "Databases",
      "content": "  ElastiCache Serverless is now available in the AWS Canada West (Calgary) region \n Posted On:  Apr 4, 2024 \nToday, AWS announces the availability of Amazon ElastiCache Serverless in the AWS Canada West (Calgary) region. ElastiCache Serverless simplifies cache management and scales to support the most demanding applications. With ElastiCache Serverless, you can create a highly available and scalable cache in less than a minute, eliminating the need to plan for, provision, and manage cache cluster capacity. ElastiCache Serverless automatically stores data redundantly across multiple Availability Zones (AZs) and provides a 99.99% availability Service Level Agreement (SLA). With ElastiCache Serverless, you pay for data stored and compute consumed by your workload, with no upfront commitments or additional costs.\nHundreds of thousands of customers use ElastiCache to build highly responsive applications. With ElastiCache Serverless, you can now accelerate application performance without needing to manage infrastructure and capacity. ElastiCache Serverless continually monitors the memory, compute, and network utilization of the cache and scales to accommodate application traffic. ElastiCache Serverless offers a single endpoint experience that simplifies the overall client configuration since clients do not need to handle changes to cluster topology during maintenance or scaling events.\nElastiCache Serverless supports Redis version 7.1 and Memcached version 1.6.22 and above and is now available in the AWS Canada West (Calgary) region, in addition to all AWS commercial regions and the AWS GovCloud (US) regions. To get started, create an ElastiCache Serverless cache using the AWS Management Console, ElastiCache Software Development Kit (SDK), or AWS Command Line Interface (AWS CLI). To learn more, visit Amazon ElastiCache, AWS News blog and the ElastiCache user guides.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 38.46153846153847
    },
    {
      "title": "Amazon RDS now supports M6gd database instances in six additional AWS regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-rds-m6gd-database-instances-additional-aws-regions/",
      "pubDate": "Thu, 04 Apr 2024 17:01:30 +0000",
      "category": "Databases",
      "content": "  Amazon RDS now supports M6gd database instances in six additional AWS regions \n Posted On:  Apr 4, 2024 \nAmazon Relational Database Service (Amazon RDS) for PostgreSQL, MySQL, and MariaDB now supports AWS Graviton2-based M6gd database instances in Asia Pacific (Hong Kong, Melbourne, Seoul), Canada (Central), Europe (Milan), and Middle East (Bahrain) regions.\nWith this regional expansion, M6gd instances are now available for Amazon RDS for PostgreSQL, MySQL, and MariaDB in 21 regions: US East (Ohio, N. Virginia), US West (Oregon), Asia Pacific (Hong Kong, Jakarta, Melbourne, Mumbai, Osaka, Seoul, Singapore, Sydney, Tokyo), Canada (Calgary, Central), Europe (Frankfurt, Ireland, London, Milan, Paris, Stockholm), and Middle East (Bahrain) regions. For complete information on pricing and regional availability, please refer to the Amazon RDS pricing page.\nM6gd database instances are available on Amazon RDS for PostgreSQL version 16.1 and higher, 15.2 and higher, 14.5 and higher, and 13.4 and higher. M6gd and R6gd database instances are available on Amazon RDS for MySQL version 8.0.28 and higher, and Amazon RDS for MariaDB version 10.11.4 and higher, 10.6.7 and higher, 10.5.16 and higher, and 10.4.25 and higher. Get started by creating a fully managed M6gd database instance using the Amazon RDS Management Console. For more details, refer to the Amazon RDS User Guide.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 38.46153846153847
    },
    {
      "title": "Amazon DocumentDB is now available in the Middle East (UAE) region",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-documentdb-middle-east-uae-region/",
      "pubDate": "Wed, 03 Apr 2024 21:47:03 +0000",
      "category": "Databases",
      "content": "  Amazon DocumentDB is now available in the Middle East (UAE) region \n Posted On:  Apr 3, 2024 \nAmazon DocumentDB (with MongoDB compatibility) is now available in the Middle East (UAE) region adding to the list of available regions where you can use Amazon DocumentDB.\nAmazon DocumentDB is a database service that is purpose-built for JSON data management at scale, fully managed and integrated with AWS, and enterprise-ready with high durability. Amazon DocumentDB is designed to give you the scalability and durability you need when operating mission-critical MongoDB workloads. Storage scales automatically up to 128TiB without any impact to your application. It supports millions of requests per second with up to 15 low latency read replicas in minutes, without any application downtime.\nTo learn more about Amazon DocumentDB, please see our product page and documentation. Have questions or feature requests? Email us at: documentdb-feature-request@amazon.com.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 38.46153846153847
    },
    {
      "title": "ElastiCache Serverless is now available in the AWS GovCloud (US) Regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/elasticache-serverless-aws-govcloud-us-regions/",
      "pubDate": "Tue, 02 Apr 2024 17:05:08 +0000",
      "category": "Databases",
      "content": "  ElastiCache Serverless is now available in the AWS GovCloud (US) Regions \n Posted On:  Apr 2, 2024 \nToday, AWS announces the availability of Amazon ElastiCache Serverless in the AWS GovCloud (US) Regions. ElastiCache Serverless simplifies cache management and scales to support the most demanding applications. With ElastiCache Serverless, you can create a highly available and scalable cache in less than a minute, eliminating the need to plan for, provision, and manage cache cluster capacity. ElastiCache Serverless automatically stores data redundantly across multiple Availability Zones (AZs) and provides a 99.99% availability Service Level Agreement (SLA). With ElastiCache Serverless, you pay for data stored and compute consumed by your workload, with no upfront commitments or additional costs.\nHundreds of thousands of customers use ElastiCache to build highly responsive applications. With ElastiCache Serverless, you can now accelerate application performance without needing to manage infrastructure and capacity. ElastiCache Serverless continually monitors the memory, compute, and network utilization of the cache and scales to accommodate application traffic. ElastiCache Serverless offers a single endpoint experience that simplifies the overall client configuration since clients do not need to handle changes to cluster topology during maintenance or scaling events.\nElastiCache Serverless supports Redis version 7.1 and Memcached version 1.6.22 and above and is now available in the AWS GovCloud (US) Regions, in addition to all AWS commercial regions. To get started, create an ElastiCache Serverless cache using the AWS Management Console, ElastiCache Software Development Kit (SDK), or AWS Command Line Interface (AWS CLI). To learn more, visit Amazon ElastiCache, AWS News blog and the ElastiCache user guides.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 38.46153846153847
    },
    {
      "title": "Amazon Aurora zero-ETL integration with Amazon Redshift now in additional regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-aurora-zero-etl-integration-redshift-regions/",
      "pubDate": "Tue, 02 Apr 2024 17:04:41 +0000",
      "category": "Databases",
      "content": "  Amazon Aurora zero-ETL integration with Amazon Redshift now in additional regions \n Posted On:  Apr 2, 2024 \nAmazon Aurora MySQL zero-ETL integration with Amazon Redshift is now supported in 11 additional regions, enabling near real-time analytics and machine learning (ML) using Amazon Redshift. Based on your analytics needs, you can include or exclude specific databases and tables from an existing or a new zero-ETL integration and selectively bring data into Amazon Redshift.\nZero-ETL integration helps you derive holistic insights across many applications and break data silos in your organization, making it simpler to analyze data from Aurora database clusters. Additionally, you can use data filtering to select the databases and tables to be replicated from Aurora to Amazon Redshift. Multiple filters can be applied to the zero-ETL integration, allowing you to tailor the replication to your specific needs and leverage Amazon Redshift's powerful analytical functionalities. \nAmazon Aurora MySQL zero-ETL integration with Amazon Redshift is available for Aurora MySQL version 3.05+ (compatible with MySQL 8.0.32) and higher in the US West (N. California), US West (Oregon), US East (Ohio), US East (N. Virginia), Asia Pacific (Mumbai), Asia Pacific (Seoul), Asia Pacific (Hong Kong), Asia Pacific (Osaka), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (London), Europe (Paris), Europe (Milan), Europe (Frankfurt), Europe (Ireland), Europe (Stockholm), Middle East (Bahrain), Africa (Cape Town), and South America (Sao Paulo) Regions.\nTo learn more and get started with zero-ETL integration, visit Amazon Aurora zero-ETL integration with Amazon Redshift and the getting started guides for Aurora and Amazon Redshift. To learn more and get started with data filtering, visit this post. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 38.46153846153847
    },
    {
      "title": "Amazon RDS for SQL Server supports Single-AZ Read Replica",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-rds-sql-server-single-az-read-replica/",
      "pubDate": "Mon, 01 Apr 2024 19:04:56 +0000",
      "category": "Databases",
      "content": "  Amazon RDS for SQL Server supports Single-AZ Read Replica \n Posted On:  Apr 1, 2024 \nAmazon RDS for SQL Server now supports Single-AZ Read-Replicas using Always On Availability Groups (AOAG) for Enterprise Edition. This provides customer the option to create up to 15 number of read replicas from a Single-AZ Enterprise Edition source instance in the same region, or cross regions. \nCustomers can now use read replicas with a Single-AZ database instance, whereas previously database instances were required to be in the Multi-AZ configuration. Read replicas asynchronously replicate the database between the source database instance and the replica. This enhances availability and durability without compromising performance when Multi-AZ is not needed.\nSingle-AZ Read-Replicas on Enterprise Edition is now generally available in all AWS regions where Amazon RDS for SQL Server is currently available. To learn more about Cross-Region support for Single-AZ read replicas with RDS for SQL Server, visit the documentation page. \nAmazon RDS makes it simple to set up, operate, and scale SQL Server deployments in the cloud. See Amazon RDS for SQL Server Pricing for up-to-date pricing of instances, storage, data transfer and regional availability.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 38.46153846153847
    },
    {
      "title": "Amazon SageMaker Studio Code Editor now supports custom images",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-sagemaker-studio-code-editor-custom-images/",
      "pubDate": "Thu, 04 Apr 2024 17:29:37 +0000",
      "category": "Machine Learning",
      "content": "  Amazon SageMaker Studio Code Editor now supports custom images \n Posted On:  Apr 4, 2024 \nToday, we are enabling Machine Learning (ML) teams’ using Code Editor, our SageMaker Studio integrated development environment (IDE) based on Code-OSS (VS Code open source), to use custom built IDE images. With this new feature, you can boost your ML development team’s productivity by providing them with customized development environments that provide the frameworks, libraries and IDE extensions they need, thus reducing their time-to-code.\nYou can start by cloning the Amazon SageMaker Distribution image and extending it to include additional Machine Learning frameworks, libraries and IDE extensions based on the needs to your particular use case. You can then build your custom images and make them available to all users sharing a SageMaker Studio domain.\nCode Editor’s support for custom images is now available in all SageMaker Studio domains that have opted in to the new SageMaker Studio. For more information about the AWS Regions where Code Editor is available, see the AWS Regions table.\nTo learn more, visit the Code Editor’s custom image page in the Amazon SageMaker Developer Guide.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 34.61538461538461
    },
    {
      "title": "Amazon SageMaker notebooks now support P5, C6i, C7i, M6i, M7i, R6i, and R7i instance types",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-sagemaker-notebooks-p5-c6i-c7i-m6i-m7i-r6i-r7i-instance-types/",
      "pubDate": "Thu, 04 Apr 2024 21:29:07 +0000",
      "category": "Machine Learning",
      "content": "  Amazon SageMaker notebooks now support P5, C6i, C7i, M6i, M7i, R6i, and R7i instance types \n Posted On:  Apr 4, 2024 \nWe are pleased to announce general availability of Amazon EC2 P5, C6i, C7i, M6i, M7i, R6i, and R7i instances on SageMaker notebooks.\nAmazon EC2 M7i, R7i, and C7i instances are powered by custom 4th generation Intel Xeon Scalable processors and deliver up to 15% better price performance compared to their previous generation (M6i, R6i, and C6i) instances. M6i, R6i, and C6i instances are powered by 3rd generation Intel Xeon Scalable processors. You can use M, R and C instance types for CPU-based, compute-intensive Machine Learning (ML) workloads.\nP5 instances feature up to 8 of the latest NVIDIA H100 Tensor Core GPUs. P5 instances complement NVIDIA H100 Tensor Core GPUs with 2x higher CPU performance, 2x higher system memory, and 4x higher local storage as compared to previous-generation GPU-based instances. You can use P5 instances for interactive model training for increasingly complex large language models (LLMs) and diffusion models powering the most demanding generative artificial intelligence (AI) applications. These applications include question answering, code generation, video and image generation, and speech recognition.\nVisit developer guides for instructions on setting up and using JupyterLab and CodeEditor applications on SageMaker Studio and SageMaker notebook instances. For pricing and regional availability information on these instances, please visit our pricing page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 34.61538461538461
    },
    {
      "title": "Amazon OpenSearch Ingestion now supports enrichment of streaming data with geographical location",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-opensearch-ingestion-streaming-data-geographical-location/",
      "pubDate": "Thu, 04 Apr 2024 19:24:45 +0000",
      "category": "Data Analytics",
      "content": "  Amazon OpenSearch Ingestion now supports enrichment of streaming data with geographical location \n Posted On:  Apr 4, 2024 \nAmazon OpenSearch Ingestion now enables you to enrich events with geographical location data from an IP address, allowing you to add additional context to your observability and security data in realtime. Additionally, you can configure mapping templates in Amazon OpenSearch clusters to automatically display these enriched events on a geographical map using OpenSearch Dashboards.\nAmazon OpenSearch Ingestion automatically keeps the mapping of IP addresses to geographical locations up-to- date, allowing you to confidently draw valuable insights for use cases like customer analytics and network access patterns across geographies. Also as part of this launch, Amazon OpenSearch Ingestion now supports Data Prepper 2.7.0 which introduces new features like XML and Amazon Ion data format processors, decompress gzip-compressed fields, truncate processor, codec support for the file source, split_event processor for splitting events and select_entries processor for filtering fields from an event. You can check out the complete list of features in this blog post.\nThese features are available in all the AWS commercial regions where Amazon OpenSearch Ingestion is currently available. \nTo learn more, see the Amazon OpenSearch Ingestion webpage and the Amazon OpenSearch Service Developer Guide.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 34.61538461538461
    }
  ]
}