{
  "items": [
    {
      "title": "Cross-account observability enabled for CloudWatch Internet Monitor",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/cross-account-observability-cloudwatch-internet-monitor/",
      "pubDate": "Thu, 04 Apr 2024 21:56:48 +0000",
      "content": "  Cross-account observability enabled for CloudWatch Internet Monitor \n Posted On:  Apr 4, 2024 \nYou can now set up cross-account observability for Amazon CloudWatch Internet Monitor, so that you can get read-only access to monitors from multiple accounts within an AWS Region. Deploying applications by using resources in separate accounts is a good practice, to establish security and billing boundaries between teams and reduce the impact of operational events. For example, when you set up cross-account observability for Internet Monitor, you can access and view performance and availability measurements generated by monitors in different AWS accounts. \nTo get started with cross-account monitoring in Internet Monitor, you use Amazon CloudWatch Observability Access Manager (OAM) to set up one or more of your AWS accounts as a monitoring account. The monitoring account then has the ability to view data in source accounts that you configure.  \nTo learn more, visit the Internet Monitor user guide documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "CloudWatch Internet Monitor now supports cross-account observability, allowing access to performance and availability data from monitors in different AWS accounts within a region.",
      "relevance": 0.9143773515479247
    },
    {
      "title": "AWS Lambda supports Kafka event sources in four new regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-lambda-kafka-event-sources-four-new-regions/",
      "pubDate": "Mon, 08 Apr 2024 17:00:53 +0000",
      "content": "  AWS Lambda supports Kafka event sources in four new regions \n Posted On:  Apr 8, 2024 \nAWS Lambda now supports Amazon Managed Streaming for Apache Kafka (MSK) and self-managed Apache Kafka as event sources in the Asia Pacific (Hyderabad), Asia Pacific (Melbourne), Europe (Spain), Europe (Zurich) Regions, enabling customers to build serverless applications that process streaming data from Kafka event sources.\nLambda launched support for Amazon MSK and self-managed Apache Kafka in 2020. This feature lets you build serverless applications triggered by Apache Kafka topics using Amazon MSK or using Apache Kafka clusters that you manage. Messages are processed in batches of up to 10,000 records, which may contain messages from one or more partitions. Messages within a partition are always processed in order. Lambda is invoked when the batch size or batch window is reached, or the payload size reaches 6MB. \nThis feature incurs no additional charge. You pay for the Lambda function invocations triggered by the event source mapping connected to Kafka. To learn more, see the Lambda developer Guide for Amazon MSK and self-managed Apache Kafka.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS Lambda now supports Kafka event sources in four new regions, enabling serverless applications to process streaming data from Kafka topics.",
      "relevance": 0.9130854649511503
    },
    {
      "title": "Amazon Location Service releases Tracking SDK for iOS and Android",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-location-service-tracking-sdk-ios-android/",
      "pubDate": "Tue, 09 Apr 2024 17:53:54 +0000",
      "content": "  Amazon Location Service releases Tracking SDK for iOS and Android \n Posted On:  Apr 9, 2024 \nAmazon Location Service has released the Tracking SDK for iOS and Android platforms. Developers can now easily add location tracking capabilities into their mobile applications to support customer engagement, geo-targeting, and delivery use cases.\nAmazon Location Trackers enable customers to store and retrieve the current and historical location of tracked devices. Now with iOS and Android tracking SDK, developers can easily authenticate, capture device positions, and send position updates to Amazon Location Trackers. The SDK supports local filtering of location updates with configurable update intervals. This helps reduce data cost and optimize for intermittent connectivity. With the Amazon Location Tracking SDK, developers can speed up their integration of Amazon Location Service and support use cases such as sending targeted promotion when a customer approaches the store, or notifying receiving department when truck gets close to the facility.\nAmazon Location Service is a fully managed service that helps developers easily and securely add maps, points of interest, geocoding, routing, tracking, and geofencing to their applications without compromising on data quality, user privacy, or cost.\nAmazon Location Service is available in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Mumbai), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Stockholm), South America (São Paulo), and AWS GovCloud (US-West).\nTo learn more, please visit Amazon Location Service Developer Guide - Amazon Location SDK and libraries.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon Location Service releases Tracking SDK for iOS and Android, enabling developers to easily add location tracking capabilities to mobile apps for customer engagement, geo-targeting, and delivery use cases.",
      "relevance": 0.9067527798056833
    },
    {
      "title": "Amazon CloudWatch now supports cross-account anomaly detection",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cloudwatch-cross-account-anomaly-detection/",
      "pubDate": "Wed, 03 Apr 2024 17:35:18 +0000",
      "content": "  Amazon CloudWatch now supports cross-account anomaly detection \n Posted On:  Apr 3, 2024 \nAmazon CloudWatch now supports Anomaly Detection on metrics shared across your accounts. CloudWatch Anomaly Detection now lets you track unexpected changes in metric behavior across multiple accounts from a single monitoring account through CloudWatch cross-account observability.\nCloudWatch Anomaly Detection continuously tracks system or application metrics, determines a normal baseline, and automatically surfaces anomalies based off historical behavior. CloudWatch cross-account enables customers to share their metrics across multiple source accounts with a central monitoring account. With cross-account anomaly detection, service owners who deploy applications across multiple accounts can now track resource performance and alarm on anomalous behavior all from a single location within their unified monitoring account.\nAnomaly Detection on cross-account metrics is available in all commercial AWS Regions.\nTo get started, log in to a monitoring account with CloudWatch Cross-Account observability configured, and navigate to your metric or alarm list. You can now choose to apply anomaly detection on a cross-account metric when you graph it or create an alarm on it. Standard anomaly detection alarming pricing applies to Anomaly Detection on cross-account metrics. Please refer to the CloudWatch Anomaly Detection documentation and pricing page for more details. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CloudWatch now supports Anomaly Detection on metrics shared across multiple AWS accounts, enabling cross-account observability and centralized monitoring of application performance.",
      "relevance": 0.9018823084432688
    },
    {
      "title": "Amazon OpenSearch Service doubles storage for OR1 and expands to four more regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-opensearch-service-doubles-storage-or1-four-regions/",
      "pubDate": "Thu, 04 Apr 2024 17:21:36 +0000",
      "content": "  Amazon OpenSearch Service doubles storage for OR1 and expands to four more regions \n Posted On:  Apr 4, 2024 \nOR1, the OpenSearch Optimized Instance family, now doubles the max allowed storage per instance. OR1 also expands availability to four additional regions- Canada Central, EU (London), and Asia Pacific (Hyderabad, Seoul). OR1 delivers up to 30% price-performance improvement over existing instances (based on internal benchmarks), and uses Amazon S3 to provide 11 9s of durability. The new OR1 instances are best suited for indexing-heavy workloads, and offers better indexing performance compared to the existing memory optimized instances available on OpenSearch Service. \nOR1 enables customers to economically and reliably scale their OpenSearch deployments without compromising the interactive analytics experience they expect. Each OR1 instance is provisioned with compute, local instance storage for caching, and remote Amazon S3-based managed storage. OR1 offers pay-as-you-go pricing and reserved instances, with a simple hourly rate for the instance, local instance storage, as well as managed storage provisioned. OR1 instances come in sizes ‘medium’ through ‘16xlarge’, and offer compute, memory, and storage flexibility. OR1 instances support OpenSearch versions 2.11 and above. Please refer to the Amazon OpenSearch Service pricing page for pricing details. Information on new max allowed storage limits can be found in documentation.\nOR1 instance family is now available on Amazon OpenSearch Service across 4 more regions: Canada Central, Europe (London), and Asia Pacific (Hyderabad, Seoul). Please refer to the AWS Region Table for more information about Amazon OpenSearch Service availability. To get started with OR1 instances, visit our documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon OpenSearch Service expands OR1 instance family with doubled storage and availability in 4 new regions, offering improved indexing performance and scalability for customers.",
      "relevance": 0.8946390631813919
    },
    {
      "title": "Amazon OpenSearch Ingestion now supports enrichment of streaming data with geographical location",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-opensearch-ingestion-streaming-data-geographical-location/",
      "pubDate": "Thu, 04 Apr 2024 19:24:45 +0000",
      "content": "  Amazon OpenSearch Ingestion now supports enrichment of streaming data with geographical location \n Posted On:  Apr 4, 2024 \nAmazon OpenSearch Ingestion now enables you to enrich events with geographical location data from an IP address, allowing you to add additional context to your observability and security data in realtime. Additionally, you can configure mapping templates in Amazon OpenSearch clusters to automatically display these enriched events on a geographical map using OpenSearch Dashboards.\nAmazon OpenSearch Ingestion automatically keeps the mapping of IP addresses to geographical locations up-to- date, allowing you to confidently draw valuable insights for use cases like customer analytics and network access patterns across geographies. Also as part of this launch, Amazon OpenSearch Ingestion now supports Data Prepper 2.7.0 which introduces new features like XML and Amazon Ion data format processors, decompress gzip-compressed fields, truncate processor, codec support for the file source, split_event processor for splitting events and select_entries processor for filtering fields from an event. You can check out the complete list of features in this blog post.\nThese features are available in all the AWS commercial regions where Amazon OpenSearch Ingestion is currently available. \nTo learn more, see the Amazon OpenSearch Ingestion webpage and the Amazon OpenSearch Service Developer Guide.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon OpenSearch Ingestion now supports enriching streaming data with geographical location from IP addresses, enabling real-time insights on observability and security data across geographies.",
      "relevance": 0.882051605023734
    },
    {
      "title": "Amazon RDS now supports M6gd database instances in six additional AWS regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-rds-m6gd-database-instances-additional-aws-regions/",
      "pubDate": "Thu, 04 Apr 2024 17:01:30 +0000",
      "content": "  Amazon RDS now supports M6gd database instances in six additional AWS regions \n Posted On:  Apr 4, 2024 \nAmazon Relational Database Service (Amazon RDS) for PostgreSQL, MySQL, and MariaDB now supports AWS Graviton2-based M6gd database instances in Asia Pacific (Hong Kong, Melbourne, Seoul), Canada (Central), Europe (Milan), and Middle East (Bahrain) regions.\nWith this regional expansion, M6gd instances are now available for Amazon RDS for PostgreSQL, MySQL, and MariaDB in 21 regions: US East (Ohio, N. Virginia), US West (Oregon), Asia Pacific (Hong Kong, Jakarta, Melbourne, Mumbai, Osaka, Seoul, Singapore, Sydney, Tokyo), Canada (Calgary, Central), Europe (Frankfurt, Ireland, London, Milan, Paris, Stockholm), and Middle East (Bahrain) regions. For complete information on pricing and regional availability, please refer to the Amazon RDS pricing page.\nM6gd database instances are available on Amazon RDS for PostgreSQL version 16.1 and higher, 15.2 and higher, 14.5 and higher, and 13.4 and higher. M6gd and R6gd database instances are available on Amazon RDS for MySQL version 8.0.28 and higher, and Amazon RDS for MariaDB version 10.11.4 and higher, 10.6.7 and higher, 10.5.16 and higher, and 10.4.25 and higher. Get started by creating a fully managed M6gd database instance using the Amazon RDS Management Console. For more details, refer to the Amazon RDS User Guide.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon RDS now supports M6gd database instances in 6 additional AWS regions, expanding availability to 21 regions for PostgreSQL, MySQL, and MariaDB.",
      "relevance": 0.8804154726285985
    },
    {
      "title": "Knowledge Bases for Amazon Bedrock offers support for CloudFormation and Service Quotas",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/knowledge-bases-amazon-bedrock-formation-quotas/",
      "pubDate": "Mon, 08 Apr 2024 17:07:40 +0000",
      "content": "  Knowledge Bases for Amazon Bedrock offers support for CloudFormation and Service Quotas \n Posted On:  Apr 8, 2024 \nKnowledge Bases for Amazon Bedrock is a fully managed Retrieval-Augmented Generation (RAG) capability that allows you to connect foundation models (FMs) to internal company data sources to deliver relevant and accurate responses. We are excited to add new capabilities for building enterprise-ready RAG. Knowledge Bases now supports AWS CloudFormation and Service Quotas.\nUsing CloudFormation, you can model and provision resources such as the knowledge base itself and the underlying data source. Easily create, update, and delete resources for Knowledge Bases and reduce your dependency on manual IT orchestration, and standardize operational processes. With this launch, Knowledge Bases also extends support for Service Quotas (SQ). This feature provides a single pane of glass to view applied AWS quota values and usage. For example, you now have quick access to information such as the allowed number of RetrieveAndGenerate API requests per second, which you can modify to moderate traffic.\nThese capabilities are currently available in the US East (N. Virginia) and US West (Oregon) AWS Regions. To learn more about these features and how to get started, refer to the Knowledge Bases for Amazon Bedrock documentation and visit the Amazon Bedrock console.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Knowledge Bases for Amazon Bedrock now supports AWS CloudFormation and Service Quotas, enabling easier resource management and visibility into usage limits for enterprise-ready Retrieval-Augmented Generation capabilities.",
      "relevance": 0.8803367112422842
    },
    {
      "title": "Amazon CloudWatch now supports tagging alarms with AWS CloudFormation",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cloudwatch-tagging-alarms-cloudformation/",
      "pubDate": "Fri, 05 Apr 2024 18:21:35 +0000",
      "content": "  Amazon CloudWatch now supports tagging alarms with AWS CloudFormation \n Posted On:  Apr 5, 2024 \nAmazon CloudWatch now supports using AWS CloudFormation to manage tags when you create, update, or delete alarms.\nCustomers tag their CloudWatch alarms to categorize their resources and convey additional contextual information, such as purpose, priority, or contact team. CloudWatch alarm tags can be viewed on the alarm details page or retrieved programmatically for use in automated remediation processes and ticketing systems. Customers can already tag their alarms using the API and command line interface, and with this new feature, they can now leverage CloudFormation as well for that purpose.\nAmazon CloudWatch support for tagging alarms with CloudFormation is now available in all AWS Regions including the AWS GovCloud (US) Regions.\nFor more information, visit the AWS CloudFormation documentation page for the Alarm resource type.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CloudWatch now supports tagging alarms using AWS CloudFormation, allowing customers to manage alarm tags through infrastructure as code.",
      "relevance": 0.8724113611493434
    },
    {
      "title": "Announcing availability of AWS Outposts in the Kingdom of Saudi Arabia",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/availability-aws-outposts-kingdom-saudi-arabia/",
      "pubDate": "Mon, 08 Apr 2024 20:34:36 +0000",
      "content": "  Announcing availability of AWS Outposts in the Kingdom of Saudi Arabia \n Posted On:  Apr 8, 2024 \nAWS Outposts can be shipped and installed at customer datacenters and on-premises locations in the Kingdom of Saudi Arabia.\nAWS Outposts is a family of fully managed solutions that extends AWS infrastructure, AWS services, APIs, and tools to virtually any on-premises or edge location for a truly consistent hybrid experience. Outposts is ideal for workloads that require low latency access to on-premises systems, local data processing, and migration of applications with local system interdependencies. Outposts can also help meet data residency requirements. Outposts is available in a variety of form factors, from 1U and 2U Outposts servers to 42U Outposts racks, and multiple rack deployments. \nWith the availability of Outposts in the Kingdom of Saudi Arabia, you can use AWS services to run your workloads and data in country in your on-premises facilities and connect to your nearest AWS Region for management and operations. \nAs of this date, customers deploying in the Kingdom of Saudi Arabia may require additional authorization. Contact your AWS Sales Representative to learn more. To get started or learn more about Outposts, read the product overview and user guide. For the most updated list of countries and territories where Outposts is supported, check out the Outposts rack FAQs page and the Outposts servers FAQs page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS Outposts now available in Kingdom of Saudi Arabia, allowing customers to run AWS services on-premises and connect to nearest AWS Region.",
      "relevance": 0.8719482138420768
    },
    {
      "title": "Launch Amazon CloudWatch Internet Monitor from Amazon CloudFront console",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cloudwatch-internet-monitor-cloudfront-console/",
      "pubDate": "Mon, 08 Apr 2024 19:43:38 +0000",
      "content": "  Launch Amazon CloudWatch Internet Monitor from Amazon CloudFront console \n Posted On:  Apr 8, 2024 \nYou can now create or associate a monitor for a distribution directly from the Amazon CloudFront console. By adding your distribution to a monitor, you can gain improved visibility into your application's internet performance and availability using Amazon CloudWatch Internet Monitor. You can create a monitor for the distribution, or add the distribution to an existing monitor, directly from the distribution metrics dashboard on the CloudFront console. \nWith a monitor, you can get detailed metrics about your application's internet traffic that goes through the distribution, with the ability to drill down into specific locations and internet service providers (ISPs). You also get health event alerts for internet issues that affect your application customers, and can review specific recommendations for improving the internet performance and availability for your application. After you create a monitor, you can customize it at any time by visiting the Internet Monitor console in Amazon CloudWatch.\nTo learn more about how you can use and customize a monitor, see the Internet Monitor user guide documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CloudFront now allows creating or associating an Amazon CloudWatch Internet Monitor directly from the CloudFront console, providing improved visibility into internet performance and availability for CloudFront distributions.",
      "relevance": 0.8713272796809268
    },
    {
      "title": "Amazon Cognito customers can secure access to APIs using Amazon Verified Permissions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cognito-customers-access-apis-verified-permissions/",
      "pubDate": "Fri, 05 Apr 2024 17:02:54 +0000",
      "content": "  Amazon Cognito customers can secure access to APIs using Amazon Verified Permissions \n Posted On:  Apr 5, 2024 \nAWS has launched a feature for Amazon Cognito customers to reduce the time spent securing Amazon API Gateway APIs with fine-grained access control, from weeks to days. The feature leverages Amazon Verified Permissions to manage and evaluate granular security policies that reference user attributes and groups. With a few clicks, you can enforce that only users in authorized Amazon Cognito groups have access to the application’s APIs. For example, say you are building a loan processing application, you can secure your application by restricting access to the “approve_loan” API to users in the “loan_officers” group. You can implement more fine-grained authorization, without making any code changes, by updating the underlying Cedar policy, so that only “loan_officers” above “Director” level can approve loans.\nAmazon Verified Permissions is a scalable permissions management and fine-grained authorization service for the applications that you build. Today, we launched a feature that streamlines implementing fine-grained authorization by combining Amazon Cognito, Amazon Verified Permissions, and Amazon API Gateway. It automatically generates an authorization model based on your APIs and policies that allows only authorized Amazon Cognito groups access to your APIs. Additionally, it deploys an AWS Lambda authorizer which you attach to the APIs you want to secure. Once the authorizer is attached, all API requests are authorized by Verified Permissions. \nTo get started, visit the Verified Permissions console, and create a policy store by selecting “Setup with API Gateway and Cognito”. Learn more by watching a quick overview and demo video. For more information visit Verified Permissions product page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon Cognito customers can now secure access to APIs using Amazon Verified Permissions, reducing the time spent on fine-grained access control from weeks to days.",
      "relevance": 0.8673605415751118
    },
    {
      "title": "Research and Engineering Studio on AWS Version 2024.04 now available",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/research-engineering-studio-aws-version-2024-04-available/",
      "pubDate": "Fri, 05 Apr 2024 17:38:35 +0000",
      "content": "  Research and Engineering Studio on AWS Version 2024.04 now available \n Posted On:  Apr 5, 2024 \nToday we’re excited to announce the release of Research and Engineering Studio (RES) on AWS Version 2024.04. This latest release brings new customization options for RES virtual desktops along with new options for shared storage and virtual desktop infrastructure (VDI) streaming. \nRES on AWS Version 2024.04 gives users the ability to launch VDIs with custom Amazon Machine Images (AMIs). Pre-baking dependencies into a custom AMI not only reduces VDI instance boot times, but also allows customers to now launch RES VDIs in isolated private subnets without needing access to the public internet. Customers can further customize their VDIs by specifying custom launch parameters such as instance profiles, security groups, and launch scripts. \nThe launch also includes improvements such as added support for Amazon FSx for Lustre to provide RES users another option for shared storage, Quick UDP Internet Connections (QUIC) protocol for improved streaming in higher latency environments, and the ability to add custom Permissions Boundaries to all AWS IAM roles created by RES. 2024.04 also extends RES support to the Israel (Tel Aviv) region. \nRES 2024.04 is available in US East (Ohio), US East (N. Virginia), US West (N. California), US West (Oregon), Canada (Central), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Asia Pacific (Seoul), Asia Pacific (Mumbai), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Paris), Europe (Milan), Israel (Tel Aviv) and the AWS GovCloud (US-West) Regions.  \nCheck out the release notes on Github to get started and deploy RES 2024.04 today.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS released Research and Engineering Studio (RES) Version 2024.04 with new customization options for virtual desktops, shared storage, and VDI streaming, as well as expanded regional support.",
      "relevance": 0.8668360885522388
    },
    {
      "title": "Amazon OpenSearch Service now lets you update node count without blue/green",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-opensearch-service-update-node-count-without-blue-green/",
      "pubDate": "Mon, 08 Apr 2024 17:20:00 +0000",
      "content": "  Amazon OpenSearch Service now lets you update node count without blue/green \n Posted On:  Apr 8, 2024 \nAmazon OpenSearch Service is now extending the ability to update the number of data nodes without requiring a blue/green deployment for clusters without dedicated cluster manager (master) nodes. This change will allow you to make node count changes faster. Clusters with dedicated cluster manager nodes already supported updating the data node count without a blue/green deployment.\nPreviously, when you updated the data nodes instance count on your domain without dedicated cluster manager, OpenSearch Service used a blue/green deployment mechanism to make the change. While blue/green deployments are meant to avoid any disruption to your clusters, as the deployment utilizes additional resources on the domain, it is recommended that you perform them during low traffic periods. Now, you can update number of data nodes without requiring a blue/green deployment, ensuring that these updates can complete faster, while avoiding any potential disruption to your cluster operations. In cases wherein you modify both data node instance type and count, OpenSearch Service will still use a blue/green deployment. You can use the dry-run option to check whether your change requires a blue/green deployment.\nThe improved experience is available for domains running any OpenSearch version, and Elasticsearch versions 7.1 and above supported on the service. The new feature is available in all AWS Regions where Amazon OpenSearch Service is available. Please refer to the AWS Region Table for more information about Amazon OpenSearch Service availability.\nFor more information regarding making configuration changes in Amazon OpenSearch Service, please see the documentation. To learn more about Amazon OpenSearch Service, please visit the product page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon OpenSearch Service now allows updating data node count without blue/green deployment for clusters without dedicated cluster manager nodes, enabling faster node count changes.",
      "relevance": 0.8625459434688303
    },
    {
      "title": "Amazon CloudWatch RUM is generally available in 11 additional AWS Regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cloudwatch-rum-additional-aws-regions/",
      "pubDate": "Mon, 08 Apr 2024 17:18:52 +0000",
      "content": "  Amazon CloudWatch RUM is generally available in 11 additional AWS Regions \n Posted On:  Apr 8, 2024 \nAmazon CloudWatch RUM, which enables customers to monitor their web applications by collecting client side performance and error data in real time, is generally available in the following 11 AWS Regions starting today: Africa (Cape Town), Asia Pacific (Jakarta), Asia Pacific (Mumbai), Asia Pacific (Osaka), Asia Pacific (Seoul), Canada (Central), Europe (Milan), Europe (Paris), Middle East (Bahrain), South America (Sao Paulo), and US West (N. California).\nCloudWatch RUM provides curated dashboards for application performance experienced by real end users of your application including anomalies in page load steps, core web vitals, and JavaScript and Http errors across different geolocations, browsers, and devices. Custom events and metrics to CloudWatch RUM can be easily configured to monitor specific parts of the application for real user interactions, troubleshoot issues, and get alerted for anomalies. CloudWatch RUM comes integrated with the new application performance monitoring (APM) capability, CloudWatch Application Signals (in Preview). As a result, client-side data from your application can easily be correlated with performance metrics such as errors, faults, and latency observed in your APIs (service operations) and dependencies to corroborate root cause.\nTo get started, see the RUM User Guide. CloudWatch RUM usage is charged on the number of RUM events collected, where each data item collected using the RUM web client is considered an event, as detailed here. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CloudWatch RUM is now generally available in 11 additional AWS Regions, enabling real-time monitoring of web application performance and errors experienced by end users.",
      "relevance": 0.861128681462846
    },
    {
      "title": "Amazon DataZone launches integration with AWS Glue Data Quality",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-datazone-integration-glue-data-quality/",
      "pubDate": "Wed, 03 Apr 2024 20:48:45 +0000",
      "content": "  Amazon DataZone launches integration with AWS Glue Data Quality \n Posted On:  Apr 3, 2024 \nAmazon DataZone is used by customers to catalog, discover, analyze, share, and govern data at scale across organizational boundaries with governance and access controls. Today, Amazon DataZone launches integration with AWS Glue Data Quality and offers APIs to integrate data quality metrics from third party data quality solutions. This integration helps Amazon DataZone customers gain trust in their data and make confident business decisions.\nThe new integration enables customers to auto-publish AWS Glue Data Quality scores into the Amazon DataZone business data catalog with just a few clicks. Amazon DataZone APIs can be used to ingest quality metrics from third party sources. Once published, data consumers can easily search for data assets, view granular quality metrics, and identify failed checks and rules - empowering business decisions. Now, disparate quality scores can be unified into intuitive dashboards for data analysts.\nAmazon DataZone is available in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Asia Pacific (Seoul), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (Stockholm), Europe (London), and South America (São Paulo).\nYou can learn more on how to get started in our blog, user documentation and about AWS Glue data Quality in the product page. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon DataZone integrates with AWS Glue Data Quality to provide data quality metrics, enabling customers to gain trust in their data and make confident business decisions.",
      "relevance": 0.8610634937993045
    },
    {
      "title": "AWS Elemental MediaTailor now available in the Hyderabad and UAE regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-elemental-mediatailor-hyderabad-uae-regions/",
      "pubDate": "Tue, 09 Apr 2024 17:00:30 +0000",
      "content": "  AWS Elemental MediaTailor now available in the Hyderabad and UAE regions \n Posted On:  Apr 9, 2024 \nYou can now configure and operate AWS Elemental MediaTailor through the AWS Management Console or API endpoints in the Asia Pacific (Hyderabad) and Middle East (UAE) AWS Regions. \nAWS Elemental MediaTailor is a channel assembly and personalized ad-insertion service for creating linear over-the-top (OTT) channels using existing video content. You can monetize your channels or other live streams with personalized advertising across a broad range of devices creating a seamless viewer experience. MediaTailor functions independently or as part of AWS Media Services, a family of services that form the foundation of cloud-based media workflows.\nVisit the AWS region table for a full list of AWS Regions where AWS Elemental MediaTailor is available.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS Elemental MediaTailor, a channel assembly and personalized ad-insertion service, is now available in the Asia Pacific (Hyderabad) and Middle East (UAE) AWS Regions.",
      "relevance": 0.8610042172273993
    },
    {
      "title": "AWS Transfer Family introduces a new workshop for SFTP",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-transfer-family-workshop-sftp/",
      "pubDate": "Mon, 08 Apr 2024 20:39:07 +0000",
      "content": "  AWS Transfer Family introduces a new workshop for SFTP \n Posted On:  Apr 8, 2024 \nYou can now learn how to use AWS Transfer Family to set up your SFTP endpoint, manage your line-of-business users, and enable secure access to your data with a new workshop called Basic principles for securing access using AWS Transfer Family. This workshop will help you gain hands on experience so you can build a scalable and secure file transfer architecture on AWS without needing to modify existing applications or manage server infrastructure. \nAWS Transfer Family offers fully managed file transfers to AWS storage over SFTP, FTPS, FTP, and AS2 protocols. The Basic principles for securing access using AWS Transfer Family workshop in AWS Workshop Studio will guide you through how to host your SFTP endpoint inside a virtual private cloud (VPC) so you can control your network settings, including how to use an allow list to control who can access your Transfer Family server. Additionally, you will learn how to create and administer users and map these users to user-friendly virtual directory structures that they will navigate when they connect to your Amazon S3 buckets or EFS file systems. The interactive workshop modules will help you understand how to set up a secure SFTP server endpoint, support thousands of concurrent users with fine grained access controls, and quickly scale your business-to-business file transfers for each user. \nTo get started, take the Basic principles for securing access using AWS Transfer Family workshop or visit our documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS introduces a new workshop to help users set up secure SFTP endpoints, manage users, and enable access to data using AWS Transfer Family, a fully managed file transfer service.",
      "relevance": 0.8559385373531055
    },
    {
      "title": "Amazon RDS for MySQL supports rds_superuser_role for easier implementation of role based privileges",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-rds-mysql-rds-superuser-role/",
      "pubDate": "Tue, 09 Apr 2024 17:02:07 +0000",
      "content": "  Amazon RDS for MySQL supports rds_superuser_role for easier implementation of role based privileges \n Posted On:  Apr 9, 2024 \nAmazon Relational Database Service (Amazon RDS) for MySQL now supports rds_superuser_role to simplify implementation of role-based privileges on MySQL 8.0. The rds_superuser_role is granted by default to the primary administrative user, and has privileges including, CREATE ROLE, CREATE USER, and DROP ROLE, for all database objects. For a complete list of rds_superuser_role privileges, refer to the Amazon RDS User Guide.\nThe rds_superuser_role is supported on RDS for MySQL versions 8.0.36 and higher. If you are running a minor version lower than MySQL 8.0.36, you can leverage automatic minor version upgrades to automatically upgrade your databases to more recent minor versions during scheduled maintenance windows. You can also leverage Amazon RDS Blue/Green deployments to perform a major or minor version upgrade with minimal downtime. Learn more about upgrading your database instances, including automatic minor version upgrades and RDS Blue/Green deployments, in the Amazon RDS User Guide.\nAmazon RDS for MySQL makes it simple to set up, operate, and scale MySQL deployments in the cloud. Learn more about pricing details and regional availability at Amazon RDS for MySQL. Create or update a fully managed Amazon RDS for MySQL database in the Amazon RDS Management Console.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon RDS for MySQL now supports rds_superuser_role to simplify role-based privilege management, with privileges including CREATE ROLE, CREATE USER, and DROP ROLE for all database objects.",
      "relevance": 0.851820196104732
    },
    {
      "title": "AWS Transfer Family offers predefined security policies for SFTP connectors",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-transfer-family-predefined-security-policies-sftp-connectors/",
      "pubDate": "Wed, 03 Apr 2024 21:58:24 +0000",
      "content": "  AWS Transfer Family offers predefined security policies for SFTP connectors \n Posted On:  Apr 3, 2024 \nAWS Transfer Family’s predefined security policies for SFTP connectors gives you the flexibility to control cryptographic algorithms used for establishing connections with remote SFTP servers, enabling compatibility with a wider range of remote server configurations.\nSFTP connectors provide fully managed low-code capability to copy files at scale between remote SFTP servers and Amazon S3. Predefined security policies for SFTP connectors enable you to select the set of SSH cryptographic algorithms that are used by your connectors when negotiating a connection with remote SFTP servers. By default, your connectors select the security policy that’s restricted to supporting the most secure algorithms. With today’s launch, you also have an option to select an alternate policy that supports a wider set of algorithms for compatibility with servers that do not offer an overlap with algorithms in the default policy. When your connector attempts to connect to a remote server, only the algorithms specified in the selected policy will be used to negotiate the connection. \nPredefined security policies for SFTP connectors are available in all AWS Regions where AWS Transfer Family is available. To learn more about predefined security policies for your connectors, read the documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS Transfer Family now offers predefined security policies for SFTP connectors, allowing users to control cryptographic algorithms used for connecting to remote SFTP servers, improving compatibility with a wider range of configurations.",
      "relevance": 0.846426547381033
    },
    {
      "title": "AWS Lambda adds support for Ruby 3.3",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-lambda-ruby-3-3/",
      "pubDate": "Thu, 04 Apr 2024 19:53:34 +0000",
      "content": "  AWS Lambda adds support for Ruby 3.3 \n Posted On:  Apr 4, 2024 \nAWS Lambda now supports creating serverless applications using Ruby 3.3. Developers can use Ruby 3.3 as both a managed runtime and a container base image, and AWS will automatically apply updates to the managed runtime and base image as they become available.\nThe Lambda Ruby 3.3 runtime is built on the new Amazon Linux 2023 runtime, which is based on the AL2023 minimal container image. This provides a significantly smaller deployment footprint than earlier Amazon Linux 2-based runtimes, updated versions of common libraries such as glibc, and a new package manager. The Ruby 3.3 runtime also provides access to the latest Ruby language features.\nThe Ruby 3.3 runtime is available in all Regions where Lambda is available, except for China and GovCloud Regions.\nYou can use the full range of AWS deployment tools, including the Lambda console, AWS CLI, AWS Serverless Application Model (AWS SAM), CDK, and AWS CloudFormation to deploy and manage serverless applications written in Ruby 3.3. For more information on using Ruby 3.3 in Lambda, see our documentation. For more information about AWS Lambda, visit our product page. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS Lambda now supports Ruby 3.3 as a managed runtime and container base image, providing access to latest Ruby features and a smaller deployment footprint.",
      "relevance": 0.843648106954238
    },
    {
      "title": "AWS Clean Rooms ML is now generally available",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-clean-rooms-ml-generally-available/",
      "pubDate": "Wed, 03 Apr 2024 19:23:20 +0000",
      "content": "  AWS Clean Rooms ML is now generally available \n Posted On:  Apr 3, 2024 \nToday, AWS announces the general availability of AWS Clean Rooms ML, which helps companies apply machine learning (ML) to generate predictive insights in a data collaboration without sharing their raw data with their partners. This capability launches with an ML model that helps companies create lookalike segments. With AWS Clean Rooms ML lookalike modeling, you can train your own custom model using your data and invite your partners to bring a small sample of their records to a collaboration to generate an expanded set of similar records while protecting the underlying data with purpose-built privacy controls. AWS Clean Rooms ML enables collaborative ML use cases including those for healthcare, financial services, and travel and hospitality. \nOrganizations across industries strive to use their data to unlock insights that help acquire customers and improve business processes while protecting consumer privacy and intellectual property. AWS Clean Rooms ML lookalike modeling helps you collaborate with your partners to create ML-powered lookalike segments without having to share or exchange sensitive data. For example, a consumer brand can now collaborate with a media publisher to find new customers that are similar to their existing, best customers, without having to share or upload their sensitive data. Similarly, healthcare customers can recruit participants for clinical trials or medical research using a seed list of participants with the desired characteristics. With AWS Clean Rooms ML, you retain full control and ownership of your trained models, and you can use intuitive controls that help you and your partners tune the model’s predictive results. \nAWS Clean Rooms ML was built and tested across a wide variety of datasets such as ecommerce and streaming video, and it can help customers improve accuracy on lookalike modeling by up to 36%, when compared with representative industry baselines. \nAWS Clean Rooms ML is available as a capability of AWS Clean Rooms in these AWS Regions. To learn more, visit AWS Clean Rooms ML.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS announces the general availability of AWS Clean Rooms ML, which enables companies to apply machine learning to generate predictive insights in data collaborations without sharing raw data with partners.",
      "relevance": 0.8427578739951649
    },
    {
      "title": "Amazon DataZone announces integration with AWS Lake Formation hybrid mode",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-datazone-integration-aws-lake-formation-hybrid-mode/",
      "pubDate": "Wed, 03 Apr 2024 20:09:40 +0000",
      "content": "  Amazon DataZone announces integration with AWS Lake Formation hybrid mode \n Posted On:  Apr 3, 2024 \nAmazon DataZone is used by customers to catalog, discover, analyze, share, and govern data at scale across organizational boundaries with governance and access controls. Today, Amazon DataZone has introduced an integration with AWS Lake Formation hybrid mode. This integration enables customers to easily publish and share their AWS Glue tables through Amazon DataZone, without the need to register them in AWS Lake Formation first. Hybrid mode allows customers to start managing permissions on their AWS Glue tables through AWS Lake Formation, while continuing to maintain any existing IAM permissions on these tables.\nTo get started, administrators enable the data location registration setting under the DefaultDataLake blueprint in the Amazon DataZone console. Then when a data consumer subscribes to an AWS Glue table managed through IAM permissions, Amazon DataZone first registers the Amazon S3 locations of this table in hybrid mode, and then grants access to the data consumer by managing permissions on the table through AWS Lake Formation. This ensures that IAM permissions on the table continue to exist with newly-granted AWS Lake Formation permissions, without disrupting any existing workflows.\nThe integration between Amazon DataZone and AWS Lake Formation hybrid mode is generally available in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Asia Pacific (Seoul), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (Stockholm), Europe (London), and South America (São Paulo). \nYou can read more about these new updates in the user documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon DataZone integrates with AWS Lake Formation hybrid mode, enabling customers to easily publish and share AWS Glue tables through DataZone without registering them in Lake Formation first.",
      "relevance": 0.8383966096030528
    },
    {
      "title": "AWS Application Migration Service now supports migration of UEFI servers",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-application-migration-service-migration-uefi-servers/",
      "pubDate": "Thu, 04 Apr 2024 19:04:47 +0000",
      "content": "  AWS Application Migration Service now supports migration of UEFI servers \n Posted On:  Apr 4, 2024 \nStarting today, you can use AWS Application Migration Service (AWS MGN) to migrate Linux servers with UEFI boot mode.\nYou now have the option to control the boot mode when migrating Linux servers, and choose Legacy BIOS or UEFI according to your needs. By default, the service will match your source boot mode and retain it during the migration, enabling you to swiftly and effortlessly migrate and launch test instances without the need for additional configuration.\nAdditionally, you can now migrate servers running Rocky 9, SUSE Linux Enterprise Server 15 SP4 and those using kernel versions up to 6.5. \nApplication Migration Service minimizes time-intensive, error-prone manual processes by automating the conversion of your source servers to run natively on AWS. It also helps simplify modernization of your migrated applications by allowing you to select preconfigured and custom optimization options during migration.\nThese features are now available in all of the AWS Regions where AWS Application Migration Service is available. Access the AWS Regional Services List for the most up-to-date availability information.\nTo start using Application Migration Service for free, sign in through the AWS Management Console. For more information, visit the Application Migration Service product page or documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS Application Migration Service now supports migration of Linux servers with UEFI boot mode, allowing users to control the boot mode during migration and migrate servers running newer Linux distributions.",
      "relevance": 0.8357328658198583
    },
    {
      "title": "Amazon SageMaker notebooks now support P5, C6i, C7i, M6i, M7i, R6i, and R7i instance types",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-sagemaker-notebooks-p5-c6i-c7i-m6i-m7i-r6i-r7i-instance-types/",
      "pubDate": "Thu, 04 Apr 2024 21:29:07 +0000",
      "content": "  Amazon SageMaker notebooks now support P5, C6i, C7i, M6i, M7i, R6i, and R7i instance types \n Posted On:  Apr 4, 2024 \nWe are pleased to announce general availability of Amazon EC2 P5, C6i, C7i, M6i, M7i, R6i, and R7i instances on SageMaker notebooks.\nAmazon EC2 M7i, R7i, and C7i instances are powered by custom 4th generation Intel Xeon Scalable processors and deliver up to 15% better price performance compared to their previous generation (M6i, R6i, and C6i) instances. M6i, R6i, and C6i instances are powered by 3rd generation Intel Xeon Scalable processors. You can use M, R and C instance types for CPU-based, compute-intensive Machine Learning (ML) workloads.\nP5 instances feature up to 8 of the latest NVIDIA H100 Tensor Core GPUs. P5 instances complement NVIDIA H100 Tensor Core GPUs with 2x higher CPU performance, 2x higher system memory, and 4x higher local storage as compared to previous-generation GPU-based instances. You can use P5 instances for interactive model training for increasingly complex large language models (LLMs) and diffusion models powering the most demanding generative artificial intelligence (AI) applications. These applications include question answering, code generation, video and image generation, and speech recognition.\nVisit developer guides for instructions on setting up and using JupyterLab and CodeEditor applications on SageMaker Studio and SageMaker notebook instances. For pricing and regional availability information on these instances, please visit our pricing page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon SageMaker now supports new EC2 instance types including P5 with NVIDIA H100 GPUs, and M7i, R7i, C7i with improved price-performance for CPU-based ML workloads.",
      "relevance": 0.8354027764659884
    },
    {
      "title": "Amazon SageMaker Studio Code Editor now supports custom images",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-sagemaker-studio-code-editor-custom-images/",
      "pubDate": "Thu, 04 Apr 2024 17:29:37 +0000",
      "content": "  Amazon SageMaker Studio Code Editor now supports custom images \n Posted On:  Apr 4, 2024 \nToday, we are enabling Machine Learning (ML) teams’ using Code Editor, our SageMaker Studio integrated development environment (IDE) based on Code-OSS (VS Code open source), to use custom built IDE images. With this new feature, you can boost your ML development team’s productivity by providing them with customized development environments that provide the frameworks, libraries and IDE extensions they need, thus reducing their time-to-code.\nYou can start by cloning the Amazon SageMaker Distribution image and extending it to include additional Machine Learning frameworks, libraries and IDE extensions based on the needs to your particular use case. You can then build your custom images and make them available to all users sharing a SageMaker Studio domain.\nCode Editor’s support for custom images is now available in all SageMaker Studio domains that have opted in to the new SageMaker Studio. For more information about the AWS Regions where Code Editor is available, see the AWS Regions table.\nTo learn more, visit the Code Editor’s custom image page in the Amazon SageMaker Developer Guide.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon SageMaker Studio Code Editor now supports custom images, allowing ML teams to create customized development environments with frameworks, libraries, and IDE extensions to boost productivity.",
      "relevance": 0.8353334249265363
    },
    {
      "title": "Announcing AWS Transfer Family workshop for building secure file transfer solutions using SFTP",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-transfer-family-workshop-file-transfer-sftp/",
      "pubDate": "Fri, 05 Apr 2024 21:59:45 +0000",
      "content": "  Announcing AWS Transfer Family workshop for building secure file transfer solutions using SFTP \n Posted On:  Apr 5, 2024 \nAWS Transfer Family now provides an interactive workshop for building file transfer solutions using Secure File Transfer Protocol (SFTP). With this workshop in AWS Workshop Studio, you can learn how to build secure and automated business-to-business file transfer workflows in AWS, and integrate data from remote business partners in your applications and data lakes.\nAWS Transfer Family provides fully-managed file transfers to AWS storage services over SFTP, FTPS, FTP, and AS2 protocols. Using the workshop, you can get hands-on experience on commissioning file transfer resources, managing users, and building resilient workflows in a self-paced workshop environment. The newest modules will help you understand how to use SFTP connectors to copy files between remote SFTP sources and Amazon S3, and adds to the existing modules that cover topics such as SFTP endpoints, custom entitlements, user authentication and authorization, and post processing of files. While each module builds upon the knowledge gained from the previous modules, the modules are technically independent so participants can pick their lessons and choose to learn in any order.\nTo get started with the workshop, visit Transfer Family - SFTP Workshop. To learn more about AWS Transfer Family, see the AWS Transfer Family product page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS announces an interactive workshop to build secure file transfer solutions using SFTP on the AWS Transfer Family service, providing hands-on experience with file transfer workflows and integrations.",
      "relevance": 0.8336589863117857
    },
    {
      "title": "AWS Elemental MediaLive now supports CMAF Ingest output group",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-elemental-medialive-cmaf-ingest-output-group/",
      "pubDate": "Mon, 08 Apr 2024 19:21:29 +0000",
      "content": "  AWS Elemental MediaLive now supports CMAF Ingest output group \n Posted On:  Apr 8, 2024 \nYou can now use AWS Elemental MediaLive to deliver a CMAF Ingest (Interface-1) output group from a channel.\nWith CMAF Ingest from MediaLive, you can send synchronized media and metadata to a packaging origin using sources with epoch locked timecode. You can also use CMAF Ingest to deliver a single set of adaptive bitrate segments for use in both DASH and HLS packages for encoding, transmission, and storage efficiency. For more information on how to use this output group, visit the MediaLive documentation.\nAWS Elemental MediaLive is a broadcast-grade live video processing service. It lets you create high-quality live video streams for delivery to broadcast televisions and internet-connected multiscreen devices, like connected TVs, tablets, smartphones, and set-top boxes.\nThe MediaLive service functions independently or as part of AWS Media Services, a family of services that form the foundation of cloud-based workflows and offer you the capabilities you need to transport, create, package, monetize, and deliver video. Visit the AWS region table for a full list of AWS Regions where AWS Elemental MediaLive is available.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS Elemental MediaLive now supports CMAF Ingest output group, allowing users to deliver synchronized media and metadata to a packaging origin using sources with epoch locked timecode.",
      "relevance": 0.8313906960418127
    },
    {
      "title": "AWS AppSync forwards application request headers to AWS Lambda custom authorizer functions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-appsync-application-headers-lambda-authorizer-functions/",
      "pubDate": "Tue, 09 Apr 2024 18:55:31 +0000",
      "content": "  AWS AppSync forwards application request headers to AWS Lambda custom authorizer functions \n Posted On:  Apr 9, 2024 \nAWS AppSync is a fully managed service that enables developers to build digital experiences based on multiple data sources. With AppSync, you create GraphQL APIs that your applications interact with over the internet (public APIs) or inside your VPC (private APIs). A method of authorization is always required to access your AppSync API. Developers can chose from several authorization modes to authorize their requests based on their business requirements, including calling an AWS Lambda function to implement custom authorization. \nToday, AppSync is enabling application request headers to be passed to the AWS Lambda custom authorizer function when authorizing GraphQL requests. Custom authorizers can now make authorization decisions based on the value of the authorization header, and the value of other headers that were sent with the request from the application client. When using custom authorizers, developers can continue to use the AppSync functionality that allows them to cache the response from their Lambda function based on the value of the authorization header. AppSync will use the last cached response until the configured Time To Live (TTL) expires. This reduces the amount of calls that are made to your Lambda function for authorization.\nThis feature is now available in all AWS Regions where AppSync is available. For more details, refer to the AppSync documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS AppSync now passes application request headers to AWS Lambda custom authorizer functions, allowing developers to make authorization decisions based on header values and cache responses to reduce Lambda function calls.",
      "relevance": 0.8275142284430799
    },
    {
      "title": "Knowledge Bases for Amazon Bedrock now supports Claude 3 Haiku",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/knowledge-bases-amazon-bedrock-claude-3-haiku/",
      "pubDate": "Tue, 09 Apr 2024 17:38:54 +0000",
      "content": "  Knowledge Bases for Amazon Bedrock now supports Claude 3 Haiku \n Posted On:  Apr 9, 2024 \nKnowledge Bases for Amazon Bedrock securely connects foundation models (FMs) to internal company data sources for Retrieval Augmented Generation (RAG) to deliver more relevant and accurate responses. Anthropic’s Claude 3 Haiku foundation model is now generally available on Knowledge Bases. We recently also announced support for Claude 3 Sonnet. \nThe Claude 3 family of models is the next generation of state-of-the-art models from Anthropic. Claude 3 Haiku is the fastest and most compact model in the Claude 3 model family and is designed for near-instant responsiveness. Claude 3 Haiku is well-suited for knowledge retrieval use cases and tasks that demand rapid responses. Claude 3 Haiku can be accessed through the Retrieve and RetrieveAndGenerate APIs.\nThe Claude 3 Haiku model for Amazon Bedrock Knowledge Bases is generally available in the US East (N. Virginia) and US West (Oregon) AWS Regions. To learn more, read the AWS News launch blog and Claude on Amazon Bedrock product page. To get started, refer to the Knowledge Bases for Amazon Bedrock documentation and visit the Amazon Bedrock console.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon Bedrock Knowledge Bases now supports Anthropic's Claude 3 Haiku foundation model, a fast and compact model for knowledge retrieval and rapid responses.",
      "relevance": 0.8266013784977242
    },
    {
      "title": "Amazon CloudFront now supports Common Media Client Data (CMCD) fields in real-time logs",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cloudfront-cmcd-fields-real-time-logs/",
      "pubDate": "Tue, 09 Apr 2024 20:41:00 +0000",
      "content": "  Amazon CloudFront now supports Common Media Client Data (CMCD) fields in real-time logs \n Posted On:  Apr 9, 2024 \nStarting today, you can enable Common Media Client Data (CMCD) fields in your CloudFront real-time logs. You can select key client-side performance parameters and CloudFront delivery performance parameters in the same log record. This can help you correlate variations in Quality of Experience (QoE) for your viewers to CloudFront performance at the granularity of single viewer sessions, simplifying the troubleshooting of QoE issues that impact your viewers engagement.\nCMCD is a standardized way for transmitting client-side performance data from your media player. The CMCD specification outlines a set of key-value pairs like bitrate, buffer length, object playback duration, measured throughput, and other key values that provide insight into the media player performance. Your media player can use the CMCD standard and send the performance parameters in the HTTP request headers or query string to CloudFront.\nPreviously, CloudFront logged CMCD parameters as part of the full query string log field, or the HTTP headers log field. Now, you can simply select to include specific CMCD parameters in your real-time logs and save on compute needed to search and extract the CMCD key-value pairs, and reduce the data set for your log analysis.\nTo enable CMCD in your CloudFront real-time logs, follow the developer guide. To learn more about using CMCD in a custom observability dashboard, refer to the Improving video observability with CMCD and CloudFront Blog. The real-time logs are charged based on the number of log lines that CloudFront publishes to your log destination, to learn more, visit the CloudFront pricing page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CloudFront now supports Common Media Client Data (CMCD) fields in real-time logs, allowing correlation of viewer QoE with CloudFront performance for improved troubleshooting.",
      "relevance": 0.8260765200844401
    },
    {
      "title": "Amazon CodeCatalyst now supports adding tasks to issues",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-codecatalyst-tasks-issues/",
      "pubDate": "Fri, 05 Apr 2024 18:11:32 +0000",
      "content": "  Amazon CodeCatalyst now supports adding tasks to issues \n Posted On:  Apr 5, 2024 \nToday, AWS announces that CodeCatalyst Issues now support breaking down issues into smaller units called tasks. CodeCatalyst customers can now add up to 100 tasks within a single issue to further organize and plan out the work involved. Tasks can be added when creating a new issue or later added to existing issues and can be assigned to any of the project members. You can also reorder, mark as complete, or remove tasks on an issue. \nAmazon CodeCatalyst helps teams plan, code, build, test, and deploy applications on AWS. Tasks allow a better break down of CodeCatalyst issues into manageable pieces and to track progress. To learn more about tasks, see Managing tasks for issues.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CodeCatalyst now supports adding up to 100 tasks within a single issue to better organize and plan work, with options to assign, reorder, and mark tasks as complete.",
      "relevance": 0.8172216794877983
    },
    {
      "title": "Amazon IVS Low-Latency Streaming now supports SRT ingest",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-ivs-low-latency-streaming-srt-ingest/",
      "pubDate": "Fri, 05 Apr 2024 17:42:51 +0000",
      "content": "  Amazon IVS Low-Latency Streaming now supports SRT ingest \n Posted On:  Apr 5, 2024 \nStarting today, you can use the Secure Reliable Transport (SRT) protocol to broadcast to your Amazon Interactive Video Service (Amazon IVS) channels. This new protocol, in addition to RTMPS, expands options for live streaming and helps to maintain video quality when sent across varying network conditions.\nSRT is a modern protocol designed to improve streaming over unreliable networks and protect against jitter, packet loss, and network bandwidth fluctuations, to make streams more stable. For viewers, this results in a higher quality viewing experience with less buffering.\nAmazon IVS is a managed live streaming solution that is designed to be quick and easy to set up, and ideal for creating interactive video experiences. Video ingest and delivery are available around the world over a managed network of infrastructure optimized for live video. Visit the AWS region table for a full list of AWS Regions where the Amazon IVS console and APIs for control and creation of video streams are available.\nTo get started, please refer to: Streaming with OBS Studio using SRT.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon IVS now supports SRT ingest, a protocol designed to improve streaming over unreliable networks and provide a higher quality viewing experience for viewers.",
      "relevance": 0.8157787993057385
    },
    {
      "title": "AWS India customers can now use UPI (Unified Payments Interface) to make payments",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-india-customers-upi-make-payments/",
      "pubDate": "Mon, 08 Apr 2024 17:21:56 +0000",
      "content": "  AWS India customers can now use UPI (Unified Payments Interface) to make payments \n Posted On:  Apr 8, 2024 \nAWS India customers can now pay their invoices using UPI (Unified Payments Interface) payment method, in addition to credit cards, debit cards, and netbanking.\nUPI is a popular and convenient payment method in India, which facilitates instant bank to bank transfers between two parties through mobile phones with internet. Customers can make payments through UPI mobile app simply by using a Virtual Payment Address or UPI ID linked to their bank account.\nTo pay with UPI, customers can log-in to the AWS console, and use UPI from the Payments page through the Billing Dashboard. They can then pay for an invoice by choosing UPI from the “Add Payment Method” drop-down. Customers will be required to provide their UPI ID, verify it, and then proceed to make a payment. After confirming their billing address, customers will receive a payment request in the UPI mobile app (such as Amazon Pay, PhonePe, GPay) associated with their UPI ID. Customers can complete the payment in the UPI app by approving the transaction with their UPI PIN. Once the payment is successful, the invoice will be marked as paid in the AWS console.\nTo learn more, See Managing payment methods in India.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS India customers can now use UPI (Unified Payments Interface) to make payments for their AWS invoices, in addition to existing payment methods like credit/debit cards and net banking.",
      "relevance": 0.8153097681961368
    },
    {
      "title": "Amazon VPC CNI now supports automatic subnet discovery",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-vpc-cni-automatic-subnet-discovery/",
      "pubDate": "Fri, 05 Apr 2024 17:05:44 +0000",
      "content": "  Amazon VPC CNI now supports automatic subnet discovery \n Posted On:  Apr 5, 2024 \nYou can now leverage tag-based subnet discovery capability of Amazon VPC CNI to scale Amazon Elastic Kubernetes Service (EKS) clusters in IPv4 address space without adding operational complexity. In this new default mode, Kubernetes Pod IP addresses are allocated from all tagged and available subnets in your Amazon Virtual Private Cloud(VPC). \nModernizing your applications using Amazon EKS, you are likely looking for ways to optimize IPv4 address space consumption and maximize usage of your VPC CIDRs as well as subnets provisioned for the EKS Pods. Now, Amazon VPC CNI based automatic subnet discovery for Pod IP assignment helps you streamline your network configuration by dynamically allocating IP addresses within defined subnets. You can tag subnets and integrate them seamlessly into an existing EKS cluster networking configuration. Once tagged, Amazon VPC CNI will automatically discover the new VPC subnets with available IP address space and use them to allocate IP addresses for Kubernetes Pods in an EKS cluster. \nStarting with Amazon VPC CNI version 1.18.0, support for enhanced subnet discovery is available in all regions where Amazon EKS operates. To learn more, check out the launch blog and to get started, visit the Amazon EKS documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon VPC CNI now supports automatic subnet discovery, allowing EKS clusters to scale IPv4 address space without added complexity by dynamically allocating Pod IPs from tagged subnets.",
      "relevance": 0.8124672926183854
    },
    {
      "title": "Amazon Route 53 adds support for 18 additional Top-Level Domains",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-route-53-additional-top-level-domains/",
      "pubDate": "Tue, 09 Apr 2024 16:59:44 +0000",
      "content": "  Amazon Route 53 adds support for 18 additional Top-Level Domains \n Posted On:  Apr 9, 2024 \nAmazon Route 53 offers domain name registration services and provides easy integration with other AWS services. We are excited to announce the recent addition of 18 additional Top-Level Domains (TLDs) to the existing 351 that we already supported before this launch. You can now register domains with: .beer, .bid, .bio, .christmas, .contact, .design, .fan, .fun, .law, .llc, .ltd, .pk, .shopping, .ski, .software, .stream, .vote and .work. Common use cases for some of these new TLDs include the following:\n.work: This TLD is popular among recruiters and career guidance counselors. Domain names with .work are designed to give employment services, recruiters, or human resources departments a unique, easily identifiable way to attract qualified candidates.\n.fun: This TLD is targeted towards entertainers, event planners, and businesses focusing on an immersive experience. Users can share their hobbies, online games, and event information using this TLD. \n.ltd: This TLD, short for “limited”, conveys to visitors that the business is a “Limited Liability Company”. For organizations that identify themselves as such, the .ltd TLD provides a descriptive and unique way to name their websites.\n.pw: The .pw TLD was originally reserved for the residents of Palau, an island country in the western pacific ocean. However, today it is commonly used to represent “Professional Web” and is available to everyone. \nTo learn more about the TLDs that are offered by Route 53 and their pricing, visit the Route 53 Developer Guide and Route 53 domain price list. You can now register domains with any of these TLDs through the Route 53 service. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon Route 53 adds support for 18 new top-level domains, including .beer, .fun, .ltd, and .pw, providing more options for domain registration and branding.",
      "relevance": 0.8119331493227542
    },
    {
      "title": "AWS B2B Data Interchange is now HIPAA eligible and supports X12 version 5010 HIPAA transactions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-b2b-data-interchange-hipaa-eligible-x12-version-5010-hipaa-transactions/",
      "pubDate": "Thu, 04 Apr 2024 19:03:14 +0000",
      "content": "  AWS B2B Data Interchange is now HIPAA eligible and supports X12 version 5010 HIPAA transactions \n Posted On:  Apr 4, 2024 \nAWS B2B Data Interchange is now a Health Insurance Portability and Accountability Act of 1996 (HIPAA) eligible service and supports X12 version 5010 HIPAA transaction sets, extending the service’s fully automated, event-driven EDI transformation capabilities to healthcare use cases.\nCovered entities such as healthcare insurers, payers, providers, plan administrators, and clearinghouses are now able to parse, validate, and transform EDI used to submit claims, verify eligibility, enroll policyholders, and exchange patient information. These new HIPAA transaction sets add to AWS B2B Data Interchange’s existing support for dozens of other X12 transactions. The American National Standards Institute X12 (ANSI X12) and HIPAA provide data standards that help to promote interoperability and protect patient privacy.\nThe service is HIPAA eligible and supports X12 version 5010 HIPAA transaction sets in all AWS Regions where the AWS B2B Data Interchange service is available. A full list of these transactions, along with their descriptions and categories, can be found in our documentation. To learn more about building and running healthcare EDI workflows with AWS B2B Data Interchange, take the self-paced workshop.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS B2B Data Interchange now supports HIPAA-eligible transactions and X12 version 5010 HIPAA transaction sets, enabling healthcare entities to automate EDI processing for claims, eligibility, enrollment, and patient data exchange.",
      "relevance": 0.8083965804617583
    },
    {
      "title": "Mistral Large foundation model now available on Amazon Bedrock",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/mistral-large-foundation-model-amazon-bedrock/",
      "pubDate": "Wed, 03 Apr 2024 18:37:18 +0000",
      "content": "  Mistral Large foundation model now available on Amazon Bedrock \n Posted On:  Apr 3, 2024 \nMistral Large, Mistral AI’s flagship cutting-edge text generation model is now generally available on Amazon Bedrock. Mistral Large is widely known for its top-tier reasoning capabilities, specific instruction following, and multilingual translation abilities. It excels in coding and mathematical tasks and is natively fluent in English, French, Spanish, German, and Italian, with a nuanced understanding of grammar and cultural context. Mistral Large performs well on retrieval augmented generation (RAG) use cases, its 32K token context window facilitates precise information retrieval from lengthy documents. \nWith the addition of Mistral Large, you’ll now have even more choice of high-performing models available in Amazon Bedrock, a fully managed service that offers a choice of foundation models from leading AI companies like Mistral AI. Amazon Bedrock makes it easy to build and scale generative AI applications via a single API with security, privacy, and responsible AI. \nMistral AI’s Mistral Large foundation model is now available on Amazon Bedrock in the US East (N. Virginia), US West (Oregon), and EU-West-3 (Paris) AWS Regions. To learn more, read the AWS News launch blog, Mistral AI on Amazon Bedrock product page, and documentation. To get started with Mistral Large on Amazon Bedrock, visit the Amazon Bedrock console.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Mistral Large, a cutting-edge text generation model from Mistral AI, is now available on Amazon Bedrock, offering advanced capabilities in reasoning, instruction following, and multilingual translation.",
      "relevance": 0.796903378455911
    }
  ]
}