{
  "items": [
    {
      "title": "Amazon Braket adds experimental capabilities for QuEra device via Braket Direct",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-braket-experimental-capabilities-quera-device-braket-direct/",
      "pubDate": "Thu, 11 Apr 2024 21:22:30 +0000",
      "content": "  Amazon Braket adds experimental capabilities for QuEra device via Braket Direct \n Posted On:  Apr 11, 2024 \nAmazon Braket now provides access to three new experimental capabilities via Braket Direct, offering increased flexibility and control when programming on QuEra’s Aquila device. With today’s launch, you can get access to local detuning, taller geometries, and tighter geometries - opening up new research opportunities, such as advanced combinatorial optimization problems that are relevant for various industry applications.\nBraket Direct is designed to expand how you can explore quantum computing on AWS, offering device reservations, expert advice, and experimental capabilities. Experimental capabilities are emergent new features that enable you to explore the cutting edge of quantum computing and unlock new use cases, as the technology matures. For instance, local detuning allows for more control over the individual qubits. With taller and tighter geometries, you can rearrange atoms in different ways and simulate novel Hamiltonians on Aquila. Some experimental capabilities may operate outside of standard device specifications and need hands-on guidance tailored to your use case. To ensure your workloads are set up for success, access is therefore available by request only via Braket Direct. \nYou can use these new capabilities with both on-demand and dedicated device access in all AWS Regions where Braket is available, at no additional charge. Researchers at accredited institutions can also apply for credits to support experiments on Braket through the AWS Cloud Credits for Research program. To get started, submit an analog program to Aquila using the Braket Developer Guide and explore the ‘maximum weight independent set’ problem and other example notebooks.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon Braket adds experimental capabilities for QuEra's Aquila device, including local detuning, taller geometries, and tighter geometries, enabling new research opportunities in quantum computing on AWS."
    },
    {
      "title": "Introducing workflow monitor for AWS Media Services",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/workflow-monitor-aws-media-services/",
      "pubDate": "Thu, 11 Apr 2024 19:31:29 +0000",
      "content": "  Introducing workflow monitor for AWS Media Services \n Posted On:  Apr 11, 2024 \nToday, AWS announces the release of workflow monitor for live video, a media-centric tool to simplify and elevate the monitoring of your video workloads. Accessible via the AWS Elemental MediaLive console and API, workflow monitor discovers and visualizes resources. It creates signal maps showing video across AWS Elemental MediaConnect, MediaLive, and MediaPackage along with Amazon S3 and Amazon CloudFront to provide end-to-end visibility. With the workflow monitor, you can create your own alarm templates or start from a set of recommended alarms, and build custom templates for alarm notifications.\nPreviously, monitoring live video workloads and applying best practices required consulting multiple user guides and manually configuring Amazon CloudWatch alarms and Amazon EventBridge rules. No single overview existed in the AWS Management Console where customers could view alarms, metrics, resource alerts, and the health across an entire media workflow. Now with the workflow monitor, you can discover and visualize all the resources associated with your live video workflow in just a few clicks. Alarm configurations and notifications are managed and adjusted from one location and programmatically deployed by workflow monitor using Amazon CloudFormation in a repeatable fashion.\nThe workflow monitor is available in all regions where AWS Elemental MediaLive is currently deployed. CloudFormation support for workflow monitor resource types is coming soon. To get started, please read the getting started blog post or consult the workflow monitor documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS introduces workflow monitor for live video, a tool to simplify and elevate monitoring of video workloads across AWS Elemental MediaLive, MediaConnect, MediaPackage, S3, and CloudFront, providing end-to-end visibility and alarm management."
    },
    {
      "title": "AWS HealthImaging adds search parameters and extended search API responses",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-healthimaging-search-parameters-api-responses/",
      "pubDate": "Thu, 11 Apr 2024 16:59:35 +0000",
      "content": "  AWS HealthImaging adds search parameters and extended search API responses \n Posted On:  Apr 11, 2024 \nAWS HealthImaging has upgraded its search functionality so that customers can more easily find and access their medical imaging data in the cloud. These enhancements simplify finding any patient exam, for use as a clinical prior, to inform a clinical workflow, or for processing by medical imaging AI/ML models. \nToday, HealthImaging made it possible to search on the DICOM SeriesInstanceUID attribute, and to search on the UpdatedAt attribute to find data updated within a specific time frame. Further, search queries now return DICOM Series-level metadata in responses, extending the responses from twelve (12) to sixteen (16) fields.\nAWS HealthImaging is a HIPAA-eligible service that empowers healthcare providers and their software partners to store, analyze, and share medical images at petabyte scale. With AWS HealthImaging, you can run your medical imaging applications at scale from a single, authoritative copy of each medical image in the cloud, while reducing infrastructure costs. \nAWS HealthImaging is generally available in the following AWS Regions: US East (N. Virginia), US West (Oregon), Asia Pacific (Sydney), and Europe (Ireland).\nTo learn more, visit AWS HealthImaging.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS HealthImaging adds new search parameters and extended API responses to simplify finding and accessing medical imaging data in the cloud."
    },
    {
      "title": "AWS Neuron introduces speculative decoding",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-neuron-speculative-decoding/",
      "pubDate": "Wed, 10 Apr 2024 21:12:58 +0000",
      "content": "404\nSorry, the page you tried cannot be found.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n",
      "summary": "The article discusses a new DynamoDB feature that provides a copy of the item during failed conditional writes, simplifying error handling without extra read operations."
    },
    {
      "title": "AWS Lambda functions now scale up to 12X faster in the AWS GovCloud (US) Regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-lambda-functions-12x-faster-govcloud-us-regions/",
      "pubDate": "Thu, 11 Apr 2024 17:53:16 +0000",
      "content": "  AWS Lambda functions now scale up to 12X faster in the AWS GovCloud (US) Regions \n Posted On:  Apr 11, 2024 \nAWS Lambda functions can now scale up to 12x faster than before in response to unpredictable traffic in the AWS GovCloud (US) Regions. With this improvement each function can scale up to a rate of 1,000 concurrent executions every 10 seconds, up to your account concurrency limit. \nWorkloads such as SLA-bound data processing or web applications with request-response patterns require high scalability and are prone to frequent changes in traffic. Previously, Lambda’s scaling was at the account level, enabling customers to scale by up to 3000 concurrent executions in the first minute, followed by 500 concurrent executions every minute afterwards. Today’s launch enables more rapid, granular scaling of individual Lambda functions, benefiting workloads that need to absorb traffic fluctuations, all without affecting the scaling rate of any other functions in your account.\nThe new scaling experience is enabled by default for all functions that are invoked synchronously, at no additional cost.\nYou can set a limit on your function’s scalability by configuring Reserved Concurrency on your function. To learn more about AWS Lambda’s new function scaling capabilities, visit the Lambda scaling behavior documentation page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS Lambda functions in the GovCloud (US) Regions can now scale up to 12x faster, enabling rapid scaling of individual functions to handle traffic fluctuations."
    },
    {
      "title": "Amazon CloudFront now supports Origin Access Control (OAC) for AWS Elemental MediaPackage Origin",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cloudfront-oac-aws-elemental-mediapackage-origin/",
      "pubDate": "Thu, 11 Apr 2024 22:02:26 +0000",
      "content": "  Amazon CloudFront now supports Origin Access Control (OAC) for AWS Elemental MediaPackage Origin \n Posted On:  Apr 11, 2024 \nStarting today, customers can protect their AWS Elemental MediaPackage origins by using CloudFront Origin Access Control (OAC) to only allow access from designated CloudFront distributions. \nCustomers use AWS Elemental MediaPackage and CloudFront to deliver live event streaming and 24/7 programming channels at scale. Previously, customers could restrict access to MediaPackage origins to requests from CloudFront IP addresses. Now with OAC, customers have more granular access control to permit origin access only from the customers’ designated CloudFront distributions. Using AWS Signature Version 4 (SigV4), OAC provides robust cryptographic authentication to protect the origin and prevent request tampering. \nCloudFront OAC now supports Elemental MediaPackage origins worldwide, except in the CloudFront China region. To get started, use the CloudFront Console, SDK, CLI, or CloudFormation to enable OAC when configuring your MediaPackage v2 endpoint with CloudFront. For more information, refer to the CloudFront Developer Guide. There are no additional fees associated with this feature. To learn more about CloudFront, visit the CloudFront Getting Started page. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CloudFront now supports Origin Access Control (OAC) for AWS Elemental MediaPackage origins, allowing customers to restrict access to their origins to only designated CloudFront distributions."
    },
    {
      "title": "Amazon EMR on EKS now supports Amazon EKS simplified access management controls",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-emr-eks-simplified-access-management-controls/",
      "pubDate": "Thu, 11 Apr 2024 17:03:47 +0000",
      "content": "  Amazon EMR on EKS now supports Amazon EKS simplified access management controls \n Posted On:  Apr 11, 2024 \nWe are excited to announce that Amazon EMR on EKS simplified the authentication and authorization user experience by integrating with Amazon EKS's improved cluster access management controls. With this launch, Amazon EMR on EKS will use EKS access management controls to automatically obtain the necessary permissions to run Amazon EMR applications on the EKS cluster.\nAmazon EMR on EKS already supports IAM authentication and authorization to EKS clusters. Before, customers had to configure aws-auth and RBAC (Role-Based Access Control) settings to grant EMR on EKS access to the EKS cluster. Now, by granting the EKS cluster access permissions to the EMR’s IAM role, EMR on EKS will automatically get access to the EKS cluster without any manual RBAC or aws-auth configuation.\nTo learn more, please visit our documentation. Simplified user experience for authentication and authorization of Amazon EMR on EKS clusters is available in regions where Amazon EMR on EKS is currently available.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon EMR on EKS now integrates with Amazon EKS's improved cluster access management controls, simplifying authentication and authorization for running EMR applications on EKS clusters."
    },
    {
      "title": "AWS IAM Identity Center now offers a streamlined AWS access portal and shortcut links",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-iam-identity-center-shortcut-links-aws-access-portal/",
      "pubDate": "Thu, 11 Apr 2024 18:41:35 +0000",
      "content": "  AWS IAM Identity Center now offers a streamlined AWS access portal and shortcut links \n Posted On:  Apr 11, 2024 \nUsers of AWS IAM Identity Center can now take advantage of a streamlined AWS access portal and time-saving shortcut links to navigate directly to destinations in the AWS Management Console in accordance with their permissions. \nThe enhanced AWS access portal offers improved usability and discoverability of applications, accounts, and permission sets. Shortcut links take an authenticated user to a desired AWS Management Console destination, such as an S3 bucket details page, in a specific account, and with a specific permission set already assigned to the user. They enable the user to land directly at the destination, without the need for page-to-page navigation. Users can save shortcut links as browser bookmarks or on a team wiki page, embed them in operational tickets, or share them with others.\nThe streamlined AWS access portal and the shortcut links are available in all AWS Regions where IAM Identity Center is available, except the China Regions.\nIAM Identity Center helps you connect or create your workforce identities, and manage their access to multiple AWS applications and AWS accounts. IAM Identity Center is available to you at no additional cost. To learn more about IAM Identity Center, visit the product detail page. To get started with using the shortcut links, please refer to the user guide.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS IAM Identity Center now offers a streamlined access portal and shortcut links to directly access AWS resources based on user permissions, improving usability and productivity."
    },
    {
      "title": "Amazon CloudFront now supports Origin Access Control (OAC) for Lambda function URL origins",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cloudfront-oac-lambda-function-url-origins/",
      "pubDate": "Thu, 11 Apr 2024 22:07:31 +0000",
      "content": "  Amazon CloudFront now supports Origin Access Control (OAC) for Lambda function URL origins \n Posted On:  Apr 11, 2024 \nStarting today, customers can protect their AWS Lambda URL origins by using CloudFront Origin Access Control (OAC) to only allow access from designated CloudFront distributions. \nLambda function URLs allow customers to implement single-function services like form validators, mobile payment processing, machine learning inference, and more. Many customers front their Lambda function URLs with CloudFront to accelerate content delivery. By doing so, they receive DDoS protection from AWS Shield Standard for free and can apply AWS Web Application Firewall (WAF) rules to protect their Lambda applications from malicious bots and common web exploits.\nWith this launch, customers can now use CloudFront OAC to authenticate access to Lambda function URLs from their designated CF distributions. OAC uses AWS Signature Version 4 (SigV4), allowing customers to block unintended users from directly accessing the function URLs. This improves the security posture because the potential threat surface of the URL endpoint is reduced. It ensures AWS Shield and WAF protection for all requests, as they must go through CloudFront where the security services are applied. Requiring authentication through CloudFront OAC also ensures every request benefits from consistent content delivery acceleration with CloudFront's global scale.\nCloudFront OAC support for AWS Lambda function URL origins is now available worldwide except for CloudFront China region. You can enable OAC using the CloudFront Console, SDK, CLI, or CloudFormation. There are no additional fees associated with this feature. For more information, please refer to the CloudFront Developer Guide. To learn more about CloudFront, visit the CloudFront Getting Started page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CloudFront now supports Origin Access Control (OAC) for Lambda function URL origins, allowing customers to authenticate access and improve security for their Lambda applications."
    },
    {
      "title": "Amazon CloudWatch Container Insights announces observability for Windows containers on Amazon EKS",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cloudwatch-container-insights-windows-containers-eks/",
      "pubDate": "Thu, 11 Apr 2024 17:05:45 +0000",
      "content": "  Amazon CloudWatch Container Insights announces observability for Windows containers on Amazon EKS \n Posted On:  Apr 11, 2024 \nAmazon CloudWatch Container Insights now offers observability for Windows containers running on Amazon Elastic Kubernetes Service (EKS), and helps customers collect, aggregate, and summarize metrics and logs from their Windows container infrastructure. With this support, customers can monitor utilization of resources such as CPU, memory, disk, and network, as well as get enhanced observability such as container-level EKS performance metrics, Kube-state metrics and EKS control plane metrics for Windows containers. CloudWatch also provides diagnostic information, such as container restart failures, for faster problem isolation and troubleshooting for Windows containers running on EKS.\nCustomers can get started with Container Insights by installing the CloudWatch observability add-on in their clusters after they are created using the add-ons tab in the cluster info view. Once installed, customers can visually drill up and down across various container layers and easily spot issues like memory leaks in their Windows containers, reducing mean time to resolution. Container Insights for Windows containers is supported on EKS versions 1.24 and later. For more details on getting started with Container Insights for your Windows clusters on EKS, see this blog. For pricing for Container Insights with and without enhanced observability for EKS, see pricing page for details.\nContainer Insights is available in all commercial AWS Regions, including the AWS GovCloud (US) Regions. For further information, visit the Container Insights documentation. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CloudWatch Container Insights now supports observability for Windows containers on Amazon EKS, providing metrics, logs, and diagnostic information for faster troubleshooting."
    },
    {
      "title": "Amazon Verified Permissions is available in four additional regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-verified-permissions-additional-regions/",
      "pubDate": "Wed, 10 Apr 2024 17:00:55 +0000",
      "content": "  Amazon Verified Permissions is available in four additional regions \n Posted On:  Apr 10, 2024 \nAmazon Verified Permissions is now available in the AWS GovCloud (US-East) and (US-West) Regions, AWS Israel (Tel Aviv) and Canada West (Calgary). The service provides fine-grained authorization for the applications that you build, allowing you to implement permissions as policies rather than application code. Your application calls Verified Permissions to authorize access to APIs and resources managed by the application.\nBy moving authorization logic out of the application code into policy stores, managed by Verified Permissions, organizations can improve their security posture and simplify audits. Development teams can improve application security and build faster. The service manages centralized policy stores, with reusable policy templates, policy testing, and audit logging. It provides a scalable, highly available policy evaluation service that can be called continually by your application for authorization decisions. You can use Verified Permissions with your existing identity provider. \nWith this Region expansion, Verified Permissions is now available in 21 regions globally, including US East (Ohio), US East (N. Virginia), US West (N. California), US West (Oregon), AWS GovCloud (US-East), AWS GovCloud (US-West), Canada (Central), Canada West (Calgary), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Paris), Europe (Stockholm), Asia Pacific (Mumbai), Asia Pacific (Singapore), Asia Pacific (Seoul), Asia Pacific (Sydney), Asia Pacific (Tokyo), Asia Pacific (Osaka), AWS Israel (Tel Aviv) and South America (São Paulo). For more information visit the Verified Permissions.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon Verified Permissions is now available in four additional AWS regions, providing fine-grained authorization for applications and improving security and auditing capabilities."
    },
    {
      "title": "AWS Clean Rooms Differential Privacy is now generally available",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-clean-rooms-differential-privacy-generally-available/",
      "pubDate": "Wed, 10 Apr 2024 21:20:10 +0000",
      "content": "  AWS Clean Rooms Differential Privacy is now generally available \n Posted On:  Apr 10, 2024 \nToday, AWS announces the general availability of AWS Clean Rooms Differential Privacy, a new capability that helps you protect the privacy of your users with mathematically-backed and intuitive controls in just a few steps. As a fully managed capability, no prior differential privacy experience is needed to help you protect the privacy of your users.\nAWS Clean Rooms Differential Privacy allows you to generate aggregated insights in a data collaboration while obfuscating the contribution of any individual’s data within those insights. This capability helps you apply sophisticated data privacy protections in data collaboration use cases such as advertising campaigns, investment decisions, clinical research, and more. AWS Clean Rooms Differential Privacy provides highly flexible and configurable controls and support for a broad range of SQL queries, making it easier for you to apply differential privacy in your data collaborations.\nAWS Clean Rooms helps companies and their partners to more easily analyze and collaborate on their collective datasets—without revealing or copying one another’s underlying data. Companies can deploy their own clean rooms without having to build, manage, or maintain their own solutions and without moving data outside of their AWS environment.\nAWS Clean Rooms Differential Privacy is available in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Paciﬁc (Seoul), Asia Paciﬁc (Singapore), Asia Paciﬁc (Sydney), Asia Paciﬁc (Tokyo), Europe (Frankfurt), Europe (Ireland), Europe (London), and Europe (Stockholm).\nTo learn more, visit our AWS Clean Rooms Differential Privacy webpage and documentation, as well as our AWS Clean Rooms site.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS announces the general availability of AWS Clean Rooms Differential Privacy, a new capability that helps protect user privacy with mathematically-backed controls in data collaboration use cases."
    },
    {
      "title": "Amazon Location Service releases Tracking SDK for iOS and Android",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-location-service-tracking-sdk-ios-android/",
      "pubDate": "Tue, 09 Apr 2024 17:53:54 +0000",
      "content": "  Amazon Location Service releases Tracking SDK for iOS and Android \n Posted On:  Apr 9, 2024 \nAmazon Location Service has released the Tracking SDK for iOS and Android platforms. Developers can now easily add location tracking capabilities into their mobile applications to support customer engagement, geo-targeting, and delivery use cases.\nAmazon Location Trackers enable customers to store and retrieve the current and historical location of tracked devices. Now with iOS and Android tracking SDK, developers can easily authenticate, capture device positions, and send position updates to Amazon Location Trackers. The SDK supports local filtering of location updates with configurable update intervals. This helps reduce data cost and optimize for intermittent connectivity. With the Amazon Location Tracking SDK, developers can speed up their integration of Amazon Location Service and support use cases such as sending targeted promotion when a customer approaches the store, or notifying receiving department when truck gets close to the facility.\nAmazon Location Service is a fully managed service that helps developers easily and securely add maps, points of interest, geocoding, routing, tracking, and geofencing to their applications without compromising on data quality, user privacy, or cost.\nAmazon Location Service is available in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Mumbai), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Stockholm), South America (São Paulo), and AWS GovCloud (US-West).\nTo learn more, please visit Amazon Location Service Developer Guide - Amazon Location SDK and libraries.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon Location Service releases Tracking SDK for iOS and Android, enabling developers to easily add location tracking capabilities to mobile apps for customer engagement, geo-targeting, and delivery use cases."
    },
    {
      "title": "Amazon Route 53 adds support for 18 additional Top-Level Domains",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-route-53-additional-top-level-domains/",
      "pubDate": "Tue, 09 Apr 2024 16:59:44 +0000",
      "content": "  Amazon Route 53 adds support for 18 additional Top-Level Domains \n Posted On:  Apr 9, 2024 \nAmazon Route 53 offers domain name registration services and provides easy integration with other AWS services. We are excited to announce the recent addition of 18 additional Top-Level Domains (TLDs) to the existing 351 that we already supported before this launch. You can now register domains with: .beer, .bid, .bio, .christmas, .contact, .design, .fan, .fun, .law, .llc, .ltd, .pw, .shopping, .ski, .software, .stream, .vote and .work. Common use cases for some of these new TLDs include the following:\n.work: This TLD is popular among recruiters and career guidance counselors. Domain names with .work are designed to give employment services, recruiters, or human resources departments a unique, easily identifiable way to attract qualified candidates.\n.fun: This TLD is targeted towards entertainers, event planners, and businesses focusing on an immersive experience. Users can share their hobbies, online games, and event information using this TLD. \n.ltd: This TLD, short for “limited”, conveys to visitors that the business is a “Limited Liability Company”. For organizations that identify themselves as such, the .ltd TLD provides a descriptive and unique way to name their websites.\n.pw: The .pw TLD was originally reserved for the residents of Palau, an island country in the western pacific ocean. However, today it is commonly used to represent “Professional Web” and is available to everyone. \nTo learn more about the TLDs that are offered by Route 53 and their pricing, visit the Route 53 Developer Guide and Route 53 domain price list. You can now register domains with any of these TLDs through the Route 53 service. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon Route 53 adds support for 18 new Top-Level Domains, including .beer, .fun, .ltd, and .pw, providing more options for domain registration and branding."
    },
    {
      "title": "Amazon RDS for MySQL supports rds_superuser_role for easier implementation of role based privileges",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-rds-mysql-rds-superuser-role/",
      "pubDate": "Tue, 09 Apr 2024 17:02:07 +0000",
      "content": "  Amazon RDS for MySQL supports rds_superuser_role for easier implementation of role based privileges \n Posted On:  Apr 9, 2024 \nAmazon Relational Database Service (Amazon RDS) for MySQL now supports rds_superuser_role to simplify implementation of role-based privileges on MySQL 8.0. The rds_superuser_role is granted by default to the primary administrative user, and has privileges including, CREATE ROLE, CREATE USER, and DROP ROLE, for all database objects. For a complete list of rds_superuser_role privileges, refer to the Amazon RDS User Guide.\nThe rds_superuser_role is supported on RDS for MySQL versions 8.0.36 and higher. If you are running a minor version lower than MySQL 8.0.36, you can leverage automatic minor version upgrades to automatically upgrade your databases to more recent minor versions during scheduled maintenance windows. You can also leverage Amazon RDS Blue/Green deployments to perform a major or minor version upgrade with minimal downtime. Learn more about upgrading your database instances, including automatic minor version upgrades and RDS Blue/Green deployments, in the Amazon RDS User Guide.\nAmazon RDS for MySQL makes it simple to set up, operate, and scale MySQL deployments in the cloud. Learn more about pricing details and regional availability at Amazon RDS for MySQL. Create or update a fully managed Amazon RDS for MySQL database in the Amazon RDS Management Console.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon RDS for MySQL now supports rds_superuser_role to simplify role-based privilege management, with the role granted by default to the primary admin user."
    },
    {
      "title": "Amazon CloudFront now supports Common Media Client Data (CMCD) fields in real-time logs",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cloudfront-cmcd-fields-real-time-logs/",
      "pubDate": "Tue, 09 Apr 2024 20:41:00 +0000",
      "content": "  Amazon CloudFront now supports Common Media Client Data (CMCD) fields in real-time logs \n Posted On:  Apr 9, 2024 \nStarting today, you can enable Common Media Client Data (CMCD) fields in your CloudFront real-time logs. You can select key client-side performance parameters and CloudFront delivery performance parameters in the same log record. This can help you correlate variations in Quality of Experience (QoE) for your viewers to CloudFront performance at the granularity of single viewer sessions, simplifying the troubleshooting of QoE issues that impact your viewers engagement.\nCMCD is a standardized way for transmitting client-side performance data from your media player. The CMCD specification outlines a set of key-value pairs like bitrate, buffer length, object playback duration, measured throughput, and other key values that provide insight into the media player performance. Your media player can use the CMCD standard and send the performance parameters in the HTTP request headers or query string to CloudFront.\nPreviously, CloudFront logged CMCD parameters as part of the full query string log field, or the HTTP headers log field. Now, you can simply select to include specific CMCD parameters in your real-time logs and save on compute needed to search and extract the CMCD key-value pairs, and reduce the data set for your log analysis.\nTo enable CMCD in your CloudFront real-time logs, follow the developer guide. To learn more about using CMCD in a custom observability dashboard, refer to the Improving video observability with CMCD and CloudFront Blog. The real-time logs are charged based on the number of log lines that CloudFront publishes to your log destination, to learn more, visit the CloudFront pricing page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CloudFront now supports Common Media Client Data (CMCD) fields in real-time logs, allowing correlation of viewer QoE with CloudFront performance for improved troubleshooting."
    },
    {
      "title": "AWS Elemental MediaTailor now available in the Hyderabad and UAE regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-elemental-mediatailor-hyderabad-uae-regions/",
      "pubDate": "Tue, 09 Apr 2024 17:00:30 +0000",
      "content": "  AWS Elemental MediaTailor now available in the Hyderabad and UAE regions \n Posted On:  Apr 9, 2024 \nYou can now configure and operate AWS Elemental MediaTailor through the AWS Management Console or API endpoints in the Asia Pacific (Hyderabad) and Middle East (UAE) AWS Regions. \nAWS Elemental MediaTailor is a channel assembly and personalized ad-insertion service for creating linear over-the-top (OTT) channels using existing video content. You can monetize your channels or other live streams with personalized advertising across a broad range of devices creating a seamless viewer experience. MediaTailor functions independently or as part of AWS Media Services, a family of services that form the foundation of cloud-based media workflows.\nVisit the AWS region table for a full list of AWS Regions where AWS Elemental MediaTailor is available.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS Elemental MediaTailor, a channel assembly and personalized ad-insertion service, is now available in the Asia Pacific (Hyderabad) and Middle East (UAE) AWS Regions, expanding its global reach."
    },
    {
      "title": "AWS AppSync forwards application request headers to AWS Lambda custom authorizer functions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-appsync-application-headers-lambda-authorizer-functions/",
      "pubDate": "Tue, 09 Apr 2024 18:55:31 +0000",
      "content": "  AWS AppSync forwards application request headers to AWS Lambda custom authorizer functions \n Posted On:  Apr 9, 2024 \nAWS AppSync is a fully managed service that enables developers to build digital experiences based on multiple data sources. With AppSync, you create GraphQL APIs that your applications interact with over the internet (public APIs) or inside your VPC (private APIs). A method of authorization is always required to access your AppSync API. Developers can chose from several authorization modes to authorize their requests based on their business requirements, including calling an AWS Lambda function to implement custom authorization. \nToday, AppSync is enabling application request headers to be passed to the AWS Lambda custom authorizer function when authorizing GraphQL requests. Custom authorizers can now make authorization decisions based on the value of the authorization header, and the value of other headers that were sent with the request from the application client. When using custom authorizers, developers can continue to use the AppSync functionality that allows them to cache the response from their Lambda function based on the value of the authorization header. AppSync will use the last cached response until the configured Time To Live (TTL) expires. This reduces the amount of calls that are made to your Lambda function for authorization.\nThis feature is now available in all AWS Regions where AppSync is available. For more details, refer to the AppSync documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS AppSync now passes application request headers to AWS Lambda custom authorizer functions, allowing developers to make authorization decisions based on header values and cache authorizer responses."
    },
    {
      "title": "Knowledge Bases for Amazon Bedrock now supports Claude 3 Haiku",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/knowledge-bases-amazon-bedrock-claude-3-haiku/",
      "pubDate": "Tue, 09 Apr 2024 17:38:54 +0000",
      "content": "  Knowledge Bases for Amazon Bedrock now supports Claude 3 Haiku \n Posted On:  Apr 9, 2024 \nKnowledge Bases for Amazon Bedrock securely connects foundation models (FMs) to internal company data sources for Retrieval Augmented Generation (RAG) to deliver more relevant and accurate responses. Anthropic’s Claude 3 Haiku foundation model is now generally available on Knowledge Bases. We recently also announced support for Claude 3 Sonnet. \nThe Claude 3 family of models is the next generation of state-of-the-art models from Anthropic. Claude 3 Haiku is the fastest and most compact model in the Claude 3 model family and is designed for near-instant responsiveness. Claude 3 Haiku is well-suited for knowledge retrieval use cases and tasks that demand rapid responses. Claude 3 Haiku can be accessed through the Retrieve and RetrieveAndGenerate APIs.\nThe Claude 3 Haiku model for Amazon Bedrock Knowledge Bases is generally available in the US East (N. Virginia) and US West (Oregon) AWS Regions. To learn more, read the AWS News launch blog and Claude on Amazon Bedrock product page. To get started, refer to the Knowledge Bases for Amazon Bedrock documentation and visit the Amazon Bedrock console.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon Bedrock Knowledge Bases now supports Anthropic's Claude 3 Haiku foundation model, the fastest and most compact in the Claude 3 family, for rapid knowledge retrieval and response."
    },
    {
      "title": "Announcing availability of AWS Outposts in the Kingdom of Saudi Arabia",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/availability-aws-outposts-kingdom-saudi-arabia/",
      "pubDate": "Mon, 08 Apr 2024 20:34:36 +0000",
      "content": "  Announcing availability of AWS Outposts in the Kingdom of Saudi Arabia \n Posted On:  Apr 8, 2024 \nAWS Outposts can be shipped and installed at customer datacenters and on-premises locations in the Kingdom of Saudi Arabia.\nAWS Outposts is a family of fully managed solutions that extends AWS infrastructure, AWS services, APIs, and tools to virtually any on-premises or edge location for a truly consistent hybrid experience. Outposts is ideal for workloads that require low latency access to on-premises systems, local data processing, and migration of applications with local system interdependencies. Outposts can also help meet data residency requirements. Outposts is available in a variety of form factors, from 1U and 2U Outposts servers to 42U Outposts racks, and multiple rack deployments. \nWith the availability of Outposts in the Kingdom of Saudi Arabia, you can use AWS services to run your workloads and data in country in your on-premises facilities and connect to your nearest AWS Region for management and operations. \nAs of this date, customers deploying in the Kingdom of Saudi Arabia may require additional authorization. Contact your AWS Sales Representative to learn more. To get started or learn more about Outposts, read the product overview and user guide. For the most updated list of countries and territories where Outposts is supported, check out the Outposts rack FAQs page and the Outposts servers FAQs page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS Outposts now available in Saudi Arabia, allowing customers to run AWS services and workloads on-premises while connecting to the nearest AWS Region."
    },
    {
      "title": "AWS Elemental MediaLive now supports CMAF Ingest output group",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-elemental-medialive-cmaf-ingest-output-group/",
      "pubDate": "Mon, 08 Apr 2024 19:21:29 +0000",
      "content": "  AWS Elemental MediaLive now supports CMAF Ingest output group \n Posted On:  Apr 8, 2024 \nYou can now use AWS Elemental MediaLive to deliver a CMAF Ingest (Interface-1) output group from a channel.\nWith CMAF Ingest from MediaLive, you can send synchronized media and metadata to a packaging origin using sources with epoch locked timecode. You can also use CMAF Ingest to deliver a single set of adaptive bitrate segments for use in both DASH and HLS packages for encoding, transmission, and storage efficiency. For more information on how to use this output group, visit the MediaLive documentation.\nAWS Elemental MediaLive is a broadcast-grade live video processing service. It lets you create high-quality live video streams for delivery to broadcast televisions and internet-connected multiscreen devices, like connected TVs, tablets, smartphones, and set-top boxes.\nThe MediaLive service functions independently or as part of AWS Media Services, a family of services that form the foundation of cloud-based workflows and offer you the capabilities you need to transport, create, package, monetize, and deliver video. Visit the AWS region table for a full list of AWS Regions where AWS Elemental MediaLive is available.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS Elemental MediaLive now supports CMAF Ingest output group, allowing users to send synchronized media and metadata to a packaging origin using sources with epoch locked timecode."
    },
    {
      "title": "AWS Transfer Family introduces a new workshop for SFTP",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-transfer-family-workshop-sftp/",
      "pubDate": "Mon, 08 Apr 2024 20:39:07 +0000",
      "content": "  AWS Transfer Family introduces a new workshop for SFTP \n Posted On:  Apr 8, 2024 \nYou can now learn how to use AWS Transfer Family to set up your SFTP endpoint, manage your line-of-business users, and enable secure access to your data with a new workshop called Basic principles for securing access using AWS Transfer Family. This workshop will help you gain hands on experience so you can build a scalable and secure file transfer architecture on AWS without needing to modify existing applications or manage server infrastructure. \nAWS Transfer Family offers fully managed file transfers to AWS storage over SFTP, FTPS, FTP, and AS2 protocols. The Basic principles for securing access using AWS Transfer Family workshop in AWS Workshop Studio will guide you through how to host your SFTP endpoint inside a virtual private cloud (VPC) so you can control your network settings, including how to use an allow list to control who can access your Transfer Family server. Additionally, you will learn how to create and administer users and map these users to user-friendly virtual directory structures that they will navigate when they connect to your Amazon S3 buckets or EFS file systems. The interactive workshop modules will help you understand how to set up a secure SFTP server endpoint, support thousands of concurrent users with fine grained access controls, and quickly scale your business-to-business file transfers for each user. \nTo get started, take the Basic principles for securing access using AWS Transfer Family workshop or visit our documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS introduces a new workshop to help users set up secure SFTP endpoints, manage users, and enable access to data using AWS Transfer Family, a fully managed file transfer service."
    },
    {
      "title": "AWS India customers can now use UPI (Unified Payments Interface) to make payments",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-india-customers-upi-make-payments/",
      "pubDate": "Mon, 08 Apr 2024 17:21:56 +0000",
      "content": "  AWS India customers can now use UPI (Unified Payments Interface) to make payments \n Posted On:  Apr 8, 2024 \nAWS India customers can now pay their invoices using UPI (Unified Payments Interface) payment method, in addition to credit cards, debit cards, and netbanking.\nUPI is a popular and convenient payment method in India, which facilitates instant bank to bank transfers between two parties through mobile phones with internet. Customers can make payments through UPI mobile app simply by using a Virtual Payment Address or UPI ID linked to their bank account.\nTo pay with UPI, customers can log-in to the AWS console, and use UPI from the Payments page through the Billing Dashboard. They can then pay for an invoice by choosing UPI from the “Add Payment Method” drop-down. Customers will be required to provide their UPI ID, verify it, and then proceed to make a payment. After confirming their billing address, customers will receive a payment request in the UPI mobile app (such as Amazon Pay, PhonePe, GPay) associated with their UPI ID. Customers can complete the payment in the UPI app by approving the transaction with their UPI PIN. Once the payment is successful, the invoice will be marked as paid in the AWS console.\nTo learn more, See Managing payment methods in India.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS India customers can now use UPI (Unified Payments Interface) to make payments for their AWS invoices, in addition to existing payment methods like credit/debit cards and netbanking."
    },
    {
      "title": "Amazon CloudWatch RUM is generally available in 11 additional AWS Regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cloudwatch-rum-additional-aws-regions/",
      "pubDate": "Mon, 08 Apr 2024 17:18:52 +0000",
      "content": "  Amazon CloudWatch RUM is generally available in 11 additional AWS Regions \n Posted On:  Apr 8, 2024 \nAmazon CloudWatch RUM, which enables customers to monitor their web applications by collecting client side performance and error data in real time, is generally available in the following 11 AWS Regions starting today: Africa (Cape Town), Asia Pacific (Jakarta), Asia Pacific (Mumbai), Asia Pacific (Osaka), Asia Pacific (Seoul), Canada (Central), Europe (Milan), Europe (Paris), Middle East (Bahrain), South America (Sao Paulo), and US West (N. California).\nCloudWatch RUM provides curated dashboards for application performance experienced by real end users of your application including anomalies in page load steps, core web vitals, and JavaScript and Http errors across different geolocations, browsers, and devices. Custom events and metrics to CloudWatch RUM can be easily configured to monitor specific parts of the application for real user interactions, troubleshoot issues, and get alerted for anomalies. CloudWatch RUM comes integrated with the new application performance monitoring (APM) capability, CloudWatch Application Signals (in Preview). As a result, client-side data from your application can easily be correlated with performance metrics such as errors, faults, and latency observed in your APIs (service operations) and dependencies to corroborate root cause.\nTo get started, see the RUM User Guide. CloudWatch RUM usage is charged on the number of RUM events collected, where each data item collected using the RUM web client is considered an event, as detailed here. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CloudWatch RUM is now generally available in 11 additional AWS Regions, enabling real-time monitoring of web application performance and errors experienced by end users."
    },
    {
      "title": "Amazon OpenSearch Service now lets you update node count without blue/green",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-opensearch-service-update-node-count-without-blue-green/",
      "pubDate": "Mon, 08 Apr 2024 17:20:00 +0000",
      "content": "  Amazon OpenSearch Service now lets you update node count without blue/green \n Posted On:  Apr 8, 2024 \nAmazon OpenSearch Service is now extending the ability to update the number of data nodes without requiring a blue/green deployment for clusters without dedicated cluster manager (master) nodes. This change will allow you to make node count changes faster. Clusters with dedicated cluster manager nodes already supported updating the data node count without a blue/green deployment.\nPreviously, when you updated the data nodes instance count on your domain without dedicated cluster manager, OpenSearch Service used a blue/green deployment mechanism to make the change. While blue/green deployments are meant to avoid any disruption to your clusters, as the deployment utilizes additional resources on the domain, it is recommended that you perform them during low traffic periods. Now, you can update number of data nodes without requiring a blue/green deployment, ensuring that these updates can complete faster, while avoiding any potential disruption to your cluster operations. In cases wherein you modify both data node instance type and count, OpenSearch Service will still use a blue/green deployment. You can use the dry-run option to check whether your change requires a blue/green deployment.\nThe improved experience is available for domains running any OpenSearch version, and Elasticsearch versions 7.1 and above supported on the service. The new feature is available in all AWS Regions where Amazon OpenSearch Service is available. Please refer to the AWS Region Table for more information about Amazon OpenSearch Service availability.\nFor more information regarding making configuration changes in Amazon OpenSearch Service, please see the documentation. To learn more about Amazon OpenSearch Service, please visit the product page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon OpenSearch Service now allows updating data node count without blue/green deployment for clusters without dedicated cluster manager nodes, enabling faster node count changes."
    },
    {
      "title": "AWS Lambda supports Kafka event sources in four new regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-lambda-kafka-event-sources-four-new-regions/",
      "pubDate": "Mon, 08 Apr 2024 17:00:53 +0000",
      "content": "  AWS Lambda supports Kafka event sources in four new regions \n Posted On:  Apr 8, 2024 \nAWS Lambda now supports Amazon Managed Streaming for Apache Kafka (MSK) and self-managed Apache Kafka as event sources in the Asia Pacific (Hyderabad), Asia Pacific (Melbourne), Europe (Spain), Europe (Zurich) Regions, enabling customers to build serverless applications that process streaming data from Kafka event sources.\nLambda launched support for Amazon MSK and self-managed Apache Kafka in 2020. This feature lets you build serverless applications triggered by Apache Kafka topics using Amazon MSK or using Apache Kafka clusters that you manage. Messages are processed in batches of up to 10,000 records, which may contain messages from one or more partitions. Messages within a partition are always processed in order. Lambda is invoked when the batch size or batch window is reached, or the payload size reaches 6MB. \nThis feature incurs no additional charge. You pay for the Lambda function invocations triggered by the event source mapping connected to Kafka. To learn more, see the Lambda developer Guide for Amazon MSK and self-managed Apache Kafka.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS Lambda now supports Amazon MSK and self-managed Apache Kafka as event sources in 4 new regions, enabling serverless apps to process streaming data from Kafka."
    },
    {
      "title": "Launch Amazon CloudWatch Internet Monitor from Amazon CloudFront console",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cloudwatch-internet-monitor-cloudfront-console/",
      "pubDate": "Mon, 08 Apr 2024 19:43:38 +0000",
      "content": "  Launch Amazon CloudWatch Internet Monitor from Amazon CloudFront console \n Posted On:  Apr 8, 2024 \nYou can now create or associate a monitor for a distribution directly from the Amazon CloudFront console. By adding your distribution to a monitor, you can gain improved visibility into your application's internet performance and availability using Amazon CloudWatch Internet Monitor. You can create a monitor for the distribution, or add the distribution to an existing monitor, directly from the distribution metrics dashboard on the CloudFront console. \nWith a monitor, you can get detailed metrics about your application's internet traffic that goes through the distribution, with the ability to drill down into specific locations and internet service providers (ISPs). You also get health event alerts for internet issues that affect your application customers, and can review specific recommendations for improving the internet performance and availability for your application. After you create a monitor, you can customize it at any time by visiting the Internet Monitor console in Amazon CloudWatch.\nTo learn more about how you can use and customize a monitor, see the Internet Monitor user guide documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CloudFront now allows creating or associating a monitor for a distribution directly from the console, providing improved visibility into application's internet performance and availability using Amazon CloudWatch Internet Monitor."
    },
    {
      "title": "Knowledge Bases for Amazon Bedrock offers support for CloudFormation and Service Quotas",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/knowledge-bases-amazon-bedrock-formation-quotas/",
      "pubDate": "Mon, 08 Apr 2024 17:07:40 +0000",
      "content": "  Knowledge Bases for Amazon Bedrock offers support for CloudFormation and Service Quotas \n Posted On:  Apr 8, 2024 \nKnowledge Bases for Amazon Bedrock is a fully managed Retrieval-Augmented Generation (RAG) capability that allows you to connect foundation models (FMs) to internal company data sources to deliver relevant and accurate responses. We are excited to add new capabilities for building enterprise-ready RAG. Knowledge Bases now supports AWS CloudFormation and Service Quotas.\nUsing CloudFormation, you can model and provision resources such as the knowledge base itself and the underlying data source. Easily create, update, and delete resources for Knowledge Bases and reduce your dependency on manual IT orchestration, and standardize operational processes. With this launch, Knowledge Bases also extends support for Service Quotas (SQ). This feature provides a single pane of glass to view applied AWS quota values and usage. For example, you now have quick access to information such as the allowed number of RetrieveAndGenerate API requests per second, which you can modify to moderate traffic.\nThese capabilities are currently available in the US East (N. Virginia) and US West (Oregon) AWS Regions. To learn more about these features and how to get started, refer to the Knowledge Bases for Amazon Bedrock documentation and visit the Amazon Bedrock console.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Knowledge Bases for Amazon Bedrock now supports AWS CloudFormation and Service Quotas, enabling easier resource management and visibility into API usage limits."
    },
    {
      "title": "Amazon Cognito customers can secure access to APIs using Amazon Verified Permissions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cognito-customers-access-apis-verified-permissions/",
      "pubDate": "Fri, 05 Apr 2024 17:02:54 +0000",
      "content": "  Amazon Cognito customers can secure access to APIs using Amazon Verified Permissions \n Posted On:  Apr 5, 2024 \nAWS has launched a feature for Amazon Cognito customers to reduce the time spent securing Amazon API Gateway APIs with fine-grained access control, from weeks to days. The feature leverages Amazon Verified Permissions to manage and evaluate granular security policies that reference user attributes and groups. With a few clicks, you can enforce that only users in authorized Amazon Cognito groups have access to the application’s APIs. For example, say you are building a loan processing application, you can secure your application by restricting access to the “approve_loan” API to users in the “loan_officers” group. You can implement more fine-grained authorization, without making any code changes, by updating the underlying Cedar policy, so that only “loan_officers” above “Director” level can approve loans.\nAmazon Verified Permissions is a scalable permissions management and fine-grained authorization service for the applications that you build. Today, we launched a feature that streamlines implementing fine-grained authorization by combining Amazon Cognito, Amazon Verified Permissions, and Amazon API Gateway. It automatically generates an authorization model based on your APIs and policies that allows only authorized Amazon Cognito groups access to your APIs. Additionally, it deploys an AWS Lambda authorizer which you attach to the APIs you want to secure. Once the authorizer is attached, all API requests are authorized by Verified Permissions. \nTo get started, visit the Verified Permissions console, and create a policy store by selecting “Setup with API Gateway and Cognito”. Learn more by watching a quick overview and demo video. For more information visit Verified Permissions product page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon Cognito customers can now secure access to APIs using Amazon Verified Permissions, reducing the time spent on fine-grained access control from weeks to days."
    },
    {
      "title": "Amazon VPC CNI now supports automatic subnet discovery",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-vpc-cni-automatic-subnet-discovery/",
      "pubDate": "Fri, 05 Apr 2024 17:05:44 +0000",
      "content": "  Amazon VPC CNI now supports automatic subnet discovery \n Posted On:  Apr 5, 2024 \nYou can now leverage tag-based subnet discovery capability of Amazon VPC CNI to scale Amazon Elastic Kubernetes Service (EKS) clusters in IPv4 address space without adding operational complexity. In this new default mode, Kubernetes Pod IP addresses are allocated from all tagged and available subnets in your Amazon Virtual Private Cloud(VPC). \nModernizing your applications using Amazon EKS, you are likely looking for ways to optimize IPv4 address space consumption and maximize usage of your VPC CIDRs as well as subnets provisioned for the EKS Pods. Now, Amazon VPC CNI based automatic subnet discovery for Pod IP assignment helps you streamline your network configuration by dynamically allocating IP addresses within defined subnets. You can tag subnets and integrate them seamlessly into an existing EKS cluster networking configuration. Once tagged, Amazon VPC CNI will automatically discover the new VPC subnets with available IP address space and use them to allocate IP addresses for Kubernetes Pods in an EKS cluster. \nStarting with Amazon VPC CNI version 1.18.0, support for enhanced subnet discovery is available in all regions where Amazon EKS operates. To learn more, check out the launch blog and to get started, visit the Amazon EKS documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon VPC CNI now supports automatic subnet discovery, allowing EKS clusters to scale IPv4 address space without added complexity by dynamically allocating Pod IPs from tagged subnets."
    },
    {
      "title": "Research and Engineering Studio on AWS Version 2024.04 now available",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/research-engineering-studio-aws-version-2024-04-available/",
      "pubDate": "Fri, 05 Apr 2024 17:38:35 +0000",
      "content": "  Research and Engineering Studio on AWS Version 2024.04 now available \n Posted On:  Apr 5, 2024 \nToday we’re excited to announce the release of Research and Engineering Studio (RES) on AWS Version 2024.04. This latest release brings new customization options for RES virtual desktops along with new options for shared storage and virtual desktop infrastructure (VDI) streaming. \nRES on AWS Version 2024.04 gives users the ability to launch VDIs with custom Amazon Machine Images (AMIs). Pre-baking dependencies into a custom AMI not only reduces VDI instance boot times, but also allows customers to now launch RES VDIs in isolated private subnets without needing access to the public internet. Customers can further customize their VDIs by specifying custom launch parameters such as instance profiles, security groups, and launch scripts. \nThe launch also includes improvements such as added support for Amazon FSx for Lustre to provide RES users another option for shared storage, Quick UDP Internet Connections (QUIC) protocol for improved streaming in higher latency environments, and the ability to add custom Permissions Boundaries to all AWS IAM roles created by RES. 2024.04 also extends RES support to the Israel (Tel Aviv) region. \nRES 2024.04 is available in US East (Ohio), US East (N. Virginia), US West (N. California), US West (Oregon), Canada (Central), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Asia Pacific (Seoul), Asia Pacific (Mumbai), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Paris), Europe (Milan), Israel (Tel Aviv) and the AWS GovCloud (US-West) Regions.  \nCheck out the release notes on Github to get started and deploy RES 2024.04 today.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS releases Research and Engineering Studio (RES) Version 2024.04 with new customization options for virtual desktops, shared storage, and VDI streaming improvements."
    },
    {
      "title": "Amazon CodeCatalyst now supports adding tasks to issues",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-codecatalyst-tasks-issues/",
      "pubDate": "Fri, 05 Apr 2024 18:11:32 +0000",
      "content": "  Amazon CodeCatalyst now supports adding tasks to issues \n Posted On:  Apr 5, 2024 \nToday, AWS announces that CodeCatalyst Issues now support breaking down issues into smaller units called tasks. CodeCatalyst customers can now add up to 100 tasks within a single issue to further organize and plan out the work involved. Tasks can be added when creating a new issue or later added to existing issues and can be assigned to any of the project members. You can also reorder, mark as complete, or remove tasks on an issue. \nAmazon CodeCatalyst helps teams plan, code, build, test, and deploy applications on AWS. Tasks allow a better break down of CodeCatalyst issues into manageable pieces and to track progress. To learn more about tasks, see Managing tasks for issues.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CodeCatalyst now supports adding up to 100 tasks within a single issue to better organize and plan work, with options to assign, reorder, and mark tasks as complete."
    },
    {
      "title": "Amazon IVS Low-Latency Streaming now supports SRT ingest",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-ivs-low-latency-streaming-srt-ingest/",
      "pubDate": "Fri, 05 Apr 2024 17:42:51 +0000",
      "content": "  Amazon IVS Low-Latency Streaming now supports SRT ingest \n Posted On:  Apr 5, 2024 \nStarting today, you can use the Secure Reliable Transport (SRT) protocol to broadcast to your Amazon Interactive Video Service (Amazon IVS) channels. This new protocol, in addition to RTMPS, expands options for live streaming and helps to maintain video quality when sent across varying network conditions.\nSRT is a modern protocol designed to improve streaming over unreliable networks and protect against jitter, packet loss, and network bandwidth fluctuations, to make streams more stable. For viewers, this results in a higher quality viewing experience with less buffering.\nAmazon IVS is a managed live streaming solution that is designed to be quick and easy to set up, and ideal for creating interactive video experiences. Video ingest and delivery are available around the world over a managed network of infrastructure optimized for live video. Visit the AWS region table for a full list of AWS Regions where the Amazon IVS console and APIs for control and creation of video streams are available.\nTo get started, please refer to: Streaming with OBS Studio using SRT.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon IVS now supports SRT ingest, a protocol designed to improve streaming over unreliable networks and provide a higher quality viewing experience."
    },
    {
      "title": "Announcing AWS Transfer Family workshop for building secure file transfer solutions using SFTP",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-transfer-family-workshop-file-transfer-sftp/",
      "pubDate": "Fri, 05 Apr 2024 21:59:45 +0000",
      "content": "  Announcing AWS Transfer Family workshop for building secure file transfer solutions using SFTP \n Posted On:  Apr 5, 2024 \nAWS Transfer Family now provides an interactive workshop for building file transfer solutions using Secure File Transfer Protocol (SFTP). With this workshop in AWS Workshop Studio, you can learn how to build secure and automated business-to-business file transfer workflows in AWS, and integrate data from remote business partners in your applications and data lakes.\nAWS Transfer Family provides fully-managed file transfers to AWS storage services over SFTP, FTPS, FTP, and AS2 protocols. Using the workshop, you can get hands-on experience on commissioning file transfer resources, managing users, and building resilient workflows in a self-paced workshop environment. The newest modules will help you understand how to use SFTP connectors to copy files between remote SFTP sources and Amazon S3, and adds to the existing modules that cover topics such as SFTP endpoints, custom entitlements, user authentication and authorization, and post processing of files. While each module builds upon the knowledge gained from the previous modules, the modules are technically independent so participants can pick their lessons and choose to learn in any order.\nTo get started with the workshop, visit Transfer Family - SFTP Workshop. To learn more about AWS Transfer Family, see the AWS Transfer Family product page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "AWS announces an interactive workshop for building secure file transfer solutions using SFTP on the AWS Transfer Family service, providing hands-on experience in managing file transfers and workflows."
    },
    {
      "title": "Amazon CloudWatch now supports tagging alarms with AWS CloudFormation",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cloudwatch-tagging-alarms-cloudformation/",
      "pubDate": "Fri, 05 Apr 2024 18:21:35 +0000",
      "content": "  Amazon CloudWatch now supports tagging alarms with AWS CloudFormation \n Posted On:  Apr 5, 2024 \nAmazon CloudWatch now supports using AWS CloudFormation to manage tags when you create, update, or delete alarms.\nCustomers tag their CloudWatch alarms to categorize their resources and convey additional contextual information, such as purpose, priority, or contact team. CloudWatch alarm tags can be viewed on the alarm details page or retrieved programmatically for use in automated remediation processes and ticketing systems. Customers can already tag their alarms using the API and command line interface, and with this new feature, they can now leverage CloudFormation as well for that purpose.\nAmazon CloudWatch support for tagging alarms with CloudFormation is now available in all AWS Regions including the AWS GovCloud (US) Regions.\nFor more information, visit the AWS CloudFormation documentation page for the Alarm resource type.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "summary": "Amazon CloudWatch now supports tagging alarms using AWS CloudFormation, allowing customers to manage alarm tags through infrastructure as code."
    }
  ]
}