{
  "items": [
    {
      "title": "Amazon GuardDuty EC2 Runtime Monitoring is now generally available",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/03/amazon-guardduty-ec2-runtime-monitoring-available/",
      "pubDate": "Fri, 29 Mar 2024 20:29:59 +0000",
      "category": "Security",
      "content": "  Amazon GuardDuty EC2 Runtime Monitoring is now generally available \n Posted On:  Mar 29, 2024 \nToday, AWS announces the general availability of Amazon GuardDuty EC2 Runtime Monitoring. This feature deepens threat detection coverage for Amazon Elastic Compute Cloud (Amazon EC2). It gives you visibility into on-host, operating system–level activities and provides container-level context of detected threats. It complements runtime coverage already available for Amazon Elastic Kubernetes Service (Amazon EKS) and Amazon Elastic Container Service (Amazon ECS) on AWS Fargate, giving you comprehensive runtime visibility and detection across popular AWS compute services. \nGuardDuty Runtime Monitoring helps you identify and respond to potential threats, including instances or self-managed containers in your AWS environment that are querying IP addresses associated with cryptocurrency-related activity or making connections to a Tor network as a Tor relay. Threats to compute workloads often involve remote code execution that leads to the download and execution of malware. GuardDuty Runtime Monitoring provides visibility into suspicious commands that involve malicious file downloads and execution across each step, providing earlier discovery of threats during initial compromise—before they become business-impacting events. \nTens of thousands of customers across many industries and geographies use GuardDuty. You can enable GuardDuty EC2 Runtime Monitoring in a few steps in the GuardDuty console. GuardDuty will immediately begin collecting and analyzing runtime event activity for potential threats. Using AWS Organizations, you can centrally enable runtime threat detection—including automated agent management—for accounts and workloads across the organization to simplify your security coverage. \nThis feature is generally available in all AWS Regions where GuardDuty is available, excluding AWS GovCloud (US) Regions and AWS China Regions.\nTo learn more and get started, try GuardDuty EC2 Runtime Monitoring for 30 days at no cost on the AWS Free Tier. You can also subscribe to feature updates with the Amazon GuardDuty SNS topic.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 88.46153846153845
    },
    {
      "title": "ElastiCache Serverless is now available in the AWS Canada West (Calgary) region",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/elasticache-serverless-aws-canada-west-calgary-region/",
      "pubDate": "Thu, 04 Apr 2024 17:27:32 +0000",
      "category": "Databases",
      "content": "  ElastiCache Serverless is now available in the AWS Canada West (Calgary) region \n Posted On:  Apr 4, 2024 \nToday, AWS announces the availability of Amazon ElastiCache Serverless in the AWS Canada West (Calgary) region. ElastiCache Serverless simplifies cache management and scales to support the most demanding applications. With ElastiCache Serverless, you can create a highly available and scalable cache in less than a minute, eliminating the need to plan for, provision, and manage cache cluster capacity. ElastiCache Serverless automatically stores data redundantly across multiple Availability Zones (AZs) and provides a 99.99% availability Service Level Agreement (SLA). With ElastiCache Serverless, you pay for data stored and compute consumed by your workload, with no upfront commitments or additional costs.\nHundreds of thousands of customers use ElastiCache to build highly responsive applications. With ElastiCache Serverless, you can now accelerate application performance without needing to manage infrastructure and capacity. ElastiCache Serverless continually monitors the memory, compute, and network utilization of the cache and scales to accommodate application traffic. ElastiCache Serverless offers a single endpoint experience that simplifies the overall client configuration since clients do not need to handle changes to cluster topology during maintenance or scaling events.\nElastiCache Serverless supports Redis version 7.1 and Memcached version 1.6.22 and above and is now available in the AWS Canada West (Calgary) region, in addition to all AWS commercial regions and the AWS GovCloud (US) regions. To get started, create an ElastiCache Serverless cache using the AWS Management Console, ElastiCache Software Development Kit (SDK), or AWS Command Line Interface (AWS CLI). To learn more, visit Amazon ElastiCache, AWS News blog and the ElastiCache user guides.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 38.46153846153847
    },
    {
      "title": "Amazon RDS now supports M6gd database instances in six additional AWS regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-rds-m6gd-database-instances-additional-aws-regions/",
      "pubDate": "Thu, 04 Apr 2024 17:01:30 +0000",
      "category": "Databases",
      "content": "  Amazon RDS now supports M6gd database instances in six additional AWS regions \n Posted On:  Apr 4, 2024 \nAmazon Relational Database Service (Amazon RDS) for PostgreSQL, MySQL, and MariaDB now supports AWS Graviton2-based M6gd database instances in Asia Pacific (Hong Kong, Melbourne, Seoul), Canada (Central), Europe (Milan), and Middle East (Bahrain) regions.\nWith this regional expansion, M6gd instances are now available for Amazon RDS for PostgreSQL, MySQL, and MariaDB in 21 regions: US East (Ohio, N. Virginia), US West (Oregon), Asia Pacific (Hong Kong, Jakarta, Melbourne, Mumbai, Osaka, Seoul, Singapore, Sydney, Tokyo), Canada (Calgary, Central), Europe (Frankfurt, Ireland, London, Milan, Paris, Stockholm), and Middle East (Bahrain) regions. For complete information on pricing and regional availability, please refer to the Amazon RDS pricing page.\nM6gd database instances are available on Amazon RDS for PostgreSQL version 16.1 and higher, 15.2 and higher, 14.5 and higher, and 13.4 and higher. M6gd and R6gd database instances are available on Amazon RDS for MySQL version 8.0.28 and higher, and Amazon RDS for MariaDB version 10.11.4 and higher, 10.6.7 and higher, 10.5.16 and higher, and 10.4.25 and higher. Get started by creating a fully managed M6gd database instance using the Amazon RDS Management Console. For more details, refer to the Amazon RDS User Guide.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 38.46153846153847
    },
    {
      "title": "Amazon DocumentDB is now available in the Middle East (UAE) region",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-documentdb-middle-east-uae-region/",
      "pubDate": "Wed, 03 Apr 2024 21:47:03 +0000",
      "category": "Databases",
      "content": "  Amazon DocumentDB is now available in the Middle East (UAE) region \n Posted On:  Apr 3, 2024 \nAmazon DocumentDB (with MongoDB compatibility) is now available in the Middle East (UAE) region adding to the list of available regions where you can use Amazon DocumentDB.\nAmazon DocumentDB is a database service that is purpose-built for JSON data management at scale, fully managed and integrated with AWS, and enterprise-ready with high durability. Amazon DocumentDB is designed to give you the scalability and durability you need when operating mission-critical MongoDB workloads. Storage scales automatically up to 128TiB without any impact to your application. It supports millions of requests per second with up to 15 low latency read replicas in minutes, without any application downtime.\nTo learn more about Amazon DocumentDB, please see our product page and documentation. Have questions or feature requests? Email us at: documentdb-feature-request@amazon.com.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 38.46153846153847
    },
    {
      "title": "ElastiCache Serverless is now available in the AWS GovCloud (US) Regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/elasticache-serverless-aws-govcloud-us-regions/",
      "pubDate": "Tue, 02 Apr 2024 17:05:08 +0000",
      "category": "Databases",
      "content": "  ElastiCache Serverless is now available in the AWS GovCloud (US) Regions \n Posted On:  Apr 2, 2024 \nToday, AWS announces the availability of Amazon ElastiCache Serverless in the AWS GovCloud (US) Regions. ElastiCache Serverless simplifies cache management and scales to support the most demanding applications. With ElastiCache Serverless, you can create a highly available and scalable cache in less than a minute, eliminating the need to plan for, provision, and manage cache cluster capacity. ElastiCache Serverless automatically stores data redundantly across multiple Availability Zones (AZs) and provides a 99.99% availability Service Level Agreement (SLA). With ElastiCache Serverless, you pay for data stored and compute consumed by your workload, with no upfront commitments or additional costs.\nHundreds of thousands of customers use ElastiCache to build highly responsive applications. With ElastiCache Serverless, you can now accelerate application performance without needing to manage infrastructure and capacity. ElastiCache Serverless continually monitors the memory, compute, and network utilization of the cache and scales to accommodate application traffic. ElastiCache Serverless offers a single endpoint experience that simplifies the overall client configuration since clients do not need to handle changes to cluster topology during maintenance or scaling events.\nElastiCache Serverless supports Redis version 7.1 and Memcached version 1.6.22 and above and is now available in the AWS GovCloud (US) Regions, in addition to all AWS commercial regions. To get started, create an ElastiCache Serverless cache using the AWS Management Console, ElastiCache Software Development Kit (SDK), or AWS Command Line Interface (AWS CLI). To learn more, visit Amazon ElastiCache, AWS News blog and the ElastiCache user guides.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 38.46153846153847
    },
    {
      "title": "Amazon Aurora zero-ETL integration with Amazon Redshift now in additional regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-aurora-zero-etl-integration-redshift-regions/",
      "pubDate": "Tue, 02 Apr 2024 17:04:41 +0000",
      "category": "Databases",
      "content": "  Amazon Aurora zero-ETL integration with Amazon Redshift now in additional regions \n Posted On:  Apr 2, 2024 \nAmazon Aurora MySQL zero-ETL integration with Amazon Redshift is now supported in 11 additional regions, enabling near real-time analytics and machine learning (ML) using Amazon Redshift. Based on your analytics needs, you can include or exclude specific databases and tables from an existing or a new zero-ETL integration and selectively bring data into Amazon Redshift.\nZero-ETL integration helps you derive holistic insights across many applications and break data silos in your organization, making it simpler to analyze data from Aurora database clusters. Additionally, you can use data filtering to select the databases and tables to be replicated from Aurora to Amazon Redshift. Multiple filters can be applied to the zero-ETL integration, allowing you to tailor the replication to your specific needs and leverage Amazon Redshift's powerful analytical functionalities. \nAmazon Aurora MySQL zero-ETL integration with Amazon Redshift is available for Aurora MySQL version 3.05+ (compatible with MySQL 8.0.32) and higher in the US West (N. California), US West (Oregon), US East (Ohio), US East (N. Virginia), Asia Pacific (Mumbai), Asia Pacific (Seoul), Asia Pacific (Hong Kong), Asia Pacific (Osaka), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (London), Europe (Paris), Europe (Milan), Europe (Frankfurt), Europe (Ireland), Europe (Stockholm), Middle East (Bahrain), Africa (Cape Town), and South America (Sao Paulo) Regions.\nTo learn more and get started with zero-ETL integration, visit Amazon Aurora zero-ETL integration with Amazon Redshift and the getting started guides for Aurora and Amazon Redshift. To learn more and get started with data filtering, visit this post. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 38.46153846153847
    },
    {
      "title": "Amazon RDS for SQL Server supports Single-AZ Read Replica",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-rds-sql-server-single-az-read-replica/",
      "pubDate": "Mon, 01 Apr 2024 19:04:56 +0000",
      "category": "Databases",
      "content": "  Amazon RDS for SQL Server supports Single-AZ Read Replica \n Posted On:  Apr 1, 2024 \nAmazon RDS for SQL Server now supports Single-AZ Read-Replicas using Always On Availability Groups (AOAG) for Enterprise Edition. This provides customer the option to create up to 15 number of read replicas from a Single-AZ Enterprise Edition source instance in the same region, or cross regions. \nCustomers can now use read replicas with a Single-AZ database instance, whereas previously database instances were required to be in the Multi-AZ configuration. Read replicas asynchronously replicate the database between the source database instance and the replica. This enhances availability and durability without compromising performance when Multi-AZ is not needed.\nSingle-AZ Read-Replicas on Enterprise Edition is now generally available in all AWS regions where Amazon RDS for SQL Server is currently available. To learn more about Cross-Region support for Single-AZ read replicas with RDS for SQL Server, visit the documentation page. \nAmazon RDS makes it simple to set up, operate, and scale SQL Server deployments in the cloud. See Amazon RDS for SQL Server Pricing for up-to-date pricing of instances, storage, data transfer and regional availability.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 38.46153846153847
    },
    {
      "title": "Amazon SageMaker Studio Code Editor now supports custom images",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-sagemaker-studio-code-editor-custom-images/",
      "pubDate": "Thu, 04 Apr 2024 17:29:37 +0000",
      "category": "Machine Learning",
      "content": "  Amazon SageMaker Studio Code Editor now supports custom images \n Posted On:  Apr 4, 2024 \nToday, we are enabling Machine Learning (ML) teams’ using Code Editor, our SageMaker Studio integrated development environment (IDE) based on Code-OSS (VS Code open source), to use custom built IDE images. With this new feature, you can boost your ML development team’s productivity by providing them with customized development environments that provide the frameworks, libraries and IDE extensions they need, thus reducing their time-to-code.\nYou can start by cloning the Amazon SageMaker Distribution image and extending it to include additional Machine Learning frameworks, libraries and IDE extensions based on the needs to your particular use case. You can then build your custom images and make them available to all users sharing a SageMaker Studio domain.\nCode Editor’s support for custom images is now available in all SageMaker Studio domains that have opted in to the new SageMaker Studio. For more information about the AWS Regions where Code Editor is available, see the AWS Regions table.\nTo learn more, visit the Code Editor’s custom image page in the Amazon SageMaker Developer Guide.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 34.61538461538461
    },
    {
      "title": "Amazon SageMaker notebooks now support P5, C6i, C7i, M6i, M7i, R6i, and R7i instance types",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-sagemaker-notebooks-p5-c6i-c7i-m6i-m7i-r6i-r7i-instance-types/",
      "pubDate": "Thu, 04 Apr 2024 21:29:07 +0000",
      "category": "Machine Learning",
      "content": "  Amazon SageMaker notebooks now support P5, C6i, C7i, M6i, M7i, R6i, and R7i instance types \n Posted On:  Apr 4, 2024 \nWe are pleased to announce general availability of Amazon EC2 P5, C6i, C7i, M6i, M7i, R6i, and R7i instances on SageMaker notebooks.\nAmazon EC2 M7i, R7i, and C7i instances are powered by custom 4th generation Intel Xeon Scalable processors and deliver up to 15% better price performance compared to their previous generation (M6i, R6i, and C6i) instances. M6i, R6i, and C6i instances are powered by 3rd generation Intel Xeon Scalable processors. You can use M, R and C instance types for CPU-based, compute-intensive Machine Learning (ML) workloads.\nP5 instances feature up to 8 of the latest NVIDIA H100 Tensor Core GPUs. P5 instances complement NVIDIA H100 Tensor Core GPUs with 2x higher CPU performance, 2x higher system memory, and 4x higher local storage as compared to previous-generation GPU-based instances. You can use P5 instances for interactive model training for increasingly complex large language models (LLMs) and diffusion models powering the most demanding generative artificial intelligence (AI) applications. These applications include question answering, code generation, video and image generation, and speech recognition.\nVisit developer guides for instructions on setting up and using JupyterLab and CodeEditor applications on SageMaker Studio and SageMaker notebook instances. For pricing and regional availability information on these instances, please visit our pricing page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 34.61538461538461
    },
    {
      "title": "Amazon OpenSearch Ingestion now supports enrichment of streaming data with geographical location",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-opensearch-ingestion-streaming-data-geographical-location/",
      "pubDate": "Thu, 04 Apr 2024 19:24:45 +0000",
      "category": "Data Analytics",
      "content": "  Amazon OpenSearch Ingestion now supports enrichment of streaming data with geographical location \n Posted On:  Apr 4, 2024 \nAmazon OpenSearch Ingestion now enables you to enrich events with geographical location data from an IP address, allowing you to add additional context to your observability and security data in realtime. Additionally, you can configure mapping templates in Amazon OpenSearch clusters to automatically display these enriched events on a geographical map using OpenSearch Dashboards.\nAmazon OpenSearch Ingestion automatically keeps the mapping of IP addresses to geographical locations up-to- date, allowing you to confidently draw valuable insights for use cases like customer analytics and network access patterns across geographies. Also as part of this launch, Amazon OpenSearch Ingestion now supports Data Prepper 2.7.0 which introduces new features like XML and Amazon Ion data format processors, decompress gzip-compressed fields, truncate processor, codec support for the file source, split_event processor for splitting events and select_entries processor for filtering fields from an event. You can check out the complete list of features in this blog post.\nThese features are available in all the AWS commercial regions where Amazon OpenSearch Ingestion is currently available. \nTo learn more, see the Amazon OpenSearch Ingestion webpage and the Amazon OpenSearch Service Developer Guide.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 34.61538461538461
    },
    {
      "title": "AWS Clean Rooms ML is now generally available",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-clean-rooms-ml-generally-available/",
      "pubDate": "Wed, 03 Apr 2024 19:23:20 +0000",
      "category": "Machine Learning",
      "content": "  AWS Clean Rooms ML is now generally available \n Posted On:  Apr 3, 2024 \nToday, AWS announces the general availability of AWS Clean Rooms ML, which helps companies apply machine learning (ML) to generate predictive insights in a data collaboration without sharing their raw data with their partners. This capability launches with an ML model that helps companies create lookalike segments. With AWS Clean Rooms ML lookalike modeling, you can train your own custom model using your data and invite your partners to bring a small sample of their records to a collaboration to generate an expanded set of similar records while protecting the underlying data with purpose-built privacy controls. AWS Clean Rooms ML enables collaborative ML use cases including those for healthcare, financial services, and travel and hospitality. \nOrganizations across industries strive to use their data to unlock insights that help acquire customers and improve business processes while protecting consumer privacy and intellectual property. AWS Clean Rooms ML lookalike modeling helps you collaborate with your partners to create ML-powered lookalike segments without having to share or exchange sensitive data. For example, a consumer brand can now collaborate with a media publisher to find new customers that are similar to their existing, best customers, without having to share or upload their sensitive data. Similarly, healthcare customers can recruit participants for clinical trials or medical research using a seed list of participants with the desired characteristics. With AWS Clean Rooms ML, you retain full control and ownership of your trained models, and you can use intuitive controls that help you and your partners tune the model’s predictive results. \nAWS Clean Rooms ML was built and tested across a wide variety of datasets such as ecommerce and streaming video, and it can help customers improve accuracy on lookalike modeling by up to 36%, when compared with representative industry baselines. \nAWS Clean Rooms ML is available as a capability of AWS Clean Rooms in these AWS Regions. To learn more, visit AWS Clean Rooms ML.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 34.61538461538461
    },
    {
      "title": "Mistral Large foundation model now available on Amazon Bedrock",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/mistral-large-foundation-model-amazon-bedrock/",
      "pubDate": "Wed, 03 Apr 2024 18:37:18 +0000",
      "category": "Machine Learning",
      "content": "  Mistral Large foundation model now available on Amazon Bedrock \n Posted On:  Apr 3, 2024 \nMistral Large, Mistral AI’s flagship cutting-edge text generation model is now generally available on Amazon Bedrock. Mistral Large is widely known for its top-tier reasoning capabilities, specific instruction following, and multilingual translation abilities. It excels in coding and mathematical tasks and is natively fluent in English, French, Spanish, German, and Italian, with a nuanced understanding of grammar and cultural context. Mistral Large performs well on retrieval augmented generation (RAG) use cases, its 32K token context window facilitates precise information retrieval from lengthy documents. \nWith the addition of Mistral Large, you’ll now have even more choice of high-performing models available in Amazon Bedrock, a fully managed service that offers a choice of foundation models from leading AI companies like Mistral AI. Amazon Bedrock makes it easy to build and scale generative AI applications via a single API with security, privacy, and responsible AI. \nMistral AI’s Mistral Large foundation model is now available on Amazon Bedrock in the US East (N. Virginia), US West (Oregon), and EU-West-3 (Paris) AWS Regions. To learn more, read the AWS News launch blog, Mistral AI on Amazon Bedrock product page, and documentation. To get started with Mistral Large on Amazon Bedrock, visit the Amazon Bedrock console.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 34.61538461538461
    },
    {
      "title": "Knowledge Bases for Amazon Bedrock now supports private network policies for OpenSearch Serverless",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/knowledge-bases-amazon-bedrock-private-network-policies-opensearch-serverless/",
      "pubDate": "Mon, 01 Apr 2024 20:53:55 +0000",
      "category": "Machine Learning",
      "content": "  Knowledge Bases for Amazon Bedrock now supports private network policies for OpenSearch Serverless \n Posted On:  Apr 1, 2024 \nKnowledge Bases for Amazon Bedrock is a fully managed Retrieval-Augmented Generation (RAG) capability that allows you to connect foundation models (FMs) to internal company data sources to deliver more relevant, context-specific, and accurate responses. We are excited to announce that Knowledge Bases now supports private network policies for Amazon OpenSearch Serverless (OSS). \nYou can use Amazon OpenSearch Serverless as a vector store within Knowledge Bases, to store embeddings. Until now, all OpenSearch Serverless (OSS) collections required a public network policy to be accessed from Knowledge Bases. This would prevent Knowledge Bases from accessing any OSS collections that have a private network policy. With this launch, Knowledge Bases can now access OSS collections that have a private network policy.\nThis new capability is currently available in the US East (N. Virginia) and US West (Oregon) AWS Regions. To learn more about this feature and how to get started, refer to the Knowledge Bases for Amazon Bedrock documentation and visit the Amazon Bedrock console.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 34.61538461538461
    },
    {
      "title": "Amazon Transcribe launches Spanish language support for PII identification and redaction",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-transcribe-spanish-language-pii-identification-redaction/",
      "pubDate": "Mon, 01 Apr 2024 18:55:19 +0000",
      "category": "Machine Learning",
      "content": "  Amazon Transcribe launches Spanish language support for PII identification and redaction \n Posted On:  Apr 1, 2024 \nToday, we are excited to announce Amazon Transcribe’s support for Personally Identifiable Information (PII) identification and redaction for Spanish (US) audio transcription, in addition to the existing support for English audio. Amazon Transcribe uses state-of-the-art machine learning technology to help identify sensitive information such as Social Security number, credit card/bank account information, and contact information (i.e. name, email address, phone number and mailing address).\nWith this expanded language support, contact centers can review and share transcripts in Spanish to improve the customer service experience, coach agents, and discover new business opportunities while maintaining their privacy and security standards for handling PII. \nAutomatic PII redaction for Spanish (US) is available in Transcribe and Transcribe Call Analytics APIs in the existing supported regions. The following PII types are supported: BANK_ACCOUNT_NUMBER, BANK_ROUTING, CREDIT_DEBIT_NUMBER, CREDIT_DEBIT_CVV, CREDIT_DEBIT_EXPIRY, PIN, EMAIL, ADDRESS, NAME, PHONE, SSN. For Transcribe APIs, you will incur additional charges as described in automatic content redaction pricing. To learn more, see the Amazon Transcribe documentation page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 34.61538461538461
    },
    {
      "title": "Knowledge Bases for Amazon Bedrock now lets you customize prompts and number of retrieval results",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/03/knowledge-bases-amazon-bedrock-customize-prompts-number-retrieval-results/",
      "pubDate": "Fri, 29 Mar 2024 20:01:49 +0000",
      "category": "Machine Learning",
      "content": "  Knowledge Bases for Amazon Bedrock now lets you customize prompts and number of retrieval results \n Posted On:  Mar 29, 2024 \nWe are excited to announce that Knowledge Bases for Amazon Bedrock now lets you create custom prompts to have greater control over personalizing the responses generated by the Foundation Model (FM). Additionally, you can configure the number of retrieved passages, which improves accuracy by providing added context to the FM. \nPrompts significantly impact how FMs process information and generate responses. With custom prompts, you can tailor the prompt instructions by adding context, user input, or output indicator(s), for the model to generate responses that more closely match your use case needs. For example you can define the output language and format (e.g., “Generate the answer in Spanish”), and save the effort of setting up separate post-processing and orchestration steps. Custom prompts is an optional parameter, without which the default system prompt is used.\nAdditionally, users can now control the amount of information needed to generate a final response by adjusting the number of retrieved passages. The process of breaking down long input texts into smaller segments, or passages, is called chunking. Previously, when querying a knowledge base, the Retrieve API returned up to five chunks. Knowledge Bases now supports up to a hundred retrieved chunks enabling more relevant and comprehensive information retrieval.\nThese two capabilities are now available in US East (N. Virginia) and US West (Oregon) AWS Regions. To learn more, refer to Knowledge Bases for Amazon Bedrock documentation. To get started, visit the Amazon Bedrock console or utilize the RetrieveAndGenerate API and Retrieve API.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 34.61538461538461
    },
    {
      "title": "Amazon SageMaker Canvas announces new pricing for training tabular models",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/03/amazon-sagemaker-canvas-pricing-tabular-models/",
      "pubDate": "Fri, 29 Mar 2024 19:49:47 +0000",
      "category": "Machine Learning",
      "content": "  Amazon SageMaker Canvas announces new pricing for training tabular models \n Posted On:  Mar 29, 2024 \nWe are excited to announce new pricing for training custom tabular models in Amazon SageMaker Canvas, a no-code tool that enables customers to easily create highly accurate ML models without writing code. SageMaker Canvas supports numeric prediction (regression), 2 category prediction (binary classification), 3+ category prediction (multi-class classification), and time-series forecasting for tabular models. Previously, model training charges were based on the number of cells in the dataset used to train the model. Now, the charges are based on SageMaker training and processing hours used to train the model. \nThe new pricing is cost-effective, enables quick iteration, and provides consistent pricing to train custom models across different modalities in SageMaker Canvas. Previously, model training in Canvas incurred a minimum of $30, and the cost increased with higher cell count. Now, the training charges for tabular models are based solely on SageMaker instance hours used, thereby significantly lowering the overall training cost. For example: A quick build model with 16 MB of data with about 3 million cells can now be as low as under $2, and a standard build model, which runs a comprehensive AutoML experiment may use 2 ml.c5.18xlarge instance hours and still cost you only $7.30. \nThe updated pricing is now available in all AWS regions where SageMaker Canvas is supported. You will see SageMaker training and processing charges for various instance types, including ml.m5.12xlarge, ml.c5.18xlarge, and ml.m5.4xlarge, that Canvas automatically selects based on performance and availability. The pricing for these instances can be found at Amazon SageMaker pricing. To learn more, refer to SageMaker Canvas Pricing.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 34.61538461538461
    },
    {
      "title": "AWS B2B Data Interchange is now HIPAA eligible and supports X12 version 5010 HIPAA transactions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-b2b-data-interchange-hipaa-eligible-x12-version-5010-hipaa-transactions/",
      "pubDate": "Thu, 04 Apr 2024 19:03:14 +0000",
      "category": "Data Integration",
      "content": "  AWS B2B Data Interchange is now HIPAA eligible and supports X12 version 5010 HIPAA transactions \n Posted On:  Apr 4, 2024 \nAWS B2B Data Interchange is now a Health Insurance Portability and Accountability Act of 1996 (HIPAA) eligible service and supports X12 version 5010 HIPAA transaction sets, extending the service’s fully automated, event-driven EDI transformation capabilities to healthcare use cases.\nCovered entities such as healthcare insurers, payers, providers, plan administrators, and clearinghouses are now able to parse, validate, and transform EDI used to submit claims, verify eligibility, enroll policyholders, and exchange patient information. These new HIPAA transaction sets add to AWS B2B Data Interchange’s existing support for dozens of other X12 transactions. The American National Standards Institute X12 (ANSI X12) and HIPAA provide data standards that help to promote interoperability and protect patient privacy.\nThe service is HIPAA eligible and supports X12 version 5010 HIPAA transaction sets in all AWS Regions where the AWS B2B Data Interchange service is available. A full list of these transactions, along with their descriptions and categories, can be found in our documentation. To learn more about building and running healthcare EDI workflows with AWS B2B Data Interchange, take the self-paced workshop.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 19.230769230769234
    },
    {
      "title": "Amazon CloudWatch now supports cross-account anomaly detection",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-cloudwatch-cross-account-anomaly-detection/",
      "pubDate": "Wed, 03 Apr 2024 17:35:18 +0000",
      "category": "Monitoring",
      "content": "  Amazon CloudWatch now supports cross-account anomaly detection \n Posted On:  Apr 3, 2024 \nAmazon CloudWatch now supports Anomaly Detection on metrics shared across your accounts. CloudWatch Anomaly Detection now lets you track unexpected changes in metric behavior across multiple accounts from a single monitoring account through CloudWatch cross-account observability.\nCloudWatch Anomaly Detection continuously tracks system or application metrics, determines a normal baseline, and automatically surfaces anomalies based off historical behavior. CloudWatch cross-account enables customers to share their metrics across multiple source accounts with a central monitoring account. With cross-account anomaly detection, service owners who deploy applications across multiple accounts can now track resource performance and alarm on anomalous behavior all from a single location within their unified monitoring account.\nAnomaly Detection on cross-account metrics is available in all commercial AWS Regions.\nTo get started, log in to a monitoring account with CloudWatch Cross-Account observability configured, and navigate to your metric or alarm list. You can now choose to apply anomaly detection on a cross-account metric when you graph it or create an alarm on it. Standard anomaly detection alarming pricing applies to Anomaly Detection on cross-account metrics. Please refer to the CloudWatch Anomaly Detection documentation and pricing page for more details. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 15.384615384615385
    },
    {
      "title": "AWS adds Managed Policies to VSS to help ensure valid application consistent backups",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/03/aws-managed-policies-vss-ensure-valid-application-consistent-backups/",
      "pubDate": "Fri, 29 Mar 2024 20:46:17 +0000",
      "category": "Storage",
      "content": "  AWS adds Managed Policies to VSS to help ensure valid application consistent backups \n Posted On:  Mar 29, 2024 \nAWS now provides customers with a new AWS managed policy for Microsoft Windows Volume Snapshot Copy Service (VSS) in Amazon Elastic Compute Cloud(EC2) . With this policy, customers no longer have to configure individual permissions or create their own policies to manage VSS. Customers can simply use this new policy to ensure the necessary permissions are in place for creating application-consistent snapshots using the AWS VSS solution.  \nVolume Shadow Copy Service or VSS is a Microsoft technology that allows application data to be backed up via a snapshot of the data while applications are still running, by coordinating between user applications that update data on disk and those that back up applications. The new managed policy ensures that the right policies are in place so that the VSS snapshot remains application consistent. Customers can configure the managed policy in the AWS Identity and Access Management (IAM) console for AWS VSS solution version 2.3.1 or higher.  \nThis new feature will be available at no additional cost in all AWS commercial, AWS China, and AWS GovCloud (US) Regions. For more information, see AWSEC2VssSnapshotPolicy Managed Policy Doc Update in IAM permissions. To use AWS VSS application-consistent backups through AWS Systems Manager Run Command review Create a VSS application-consistent snapshot and VssInstallAndSnapshot for simplified onboarding. To learn more about using AWS VSS application-consistent backups through AWS Backup review Creating Windows VSS backups. To automate the creation, retention, and deletion of VSS-enabled EBS Snapshots review Creating application-consistent snapshots using Amazon Data Lifecycle Manager.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 15.384615384615385
    },
    {
      "title": "Amazon Connect forecasting, capacity planning, and scheduling are now generally available in four additional AWS regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/03/amazon-connect-forecasting-capacity-planning-scheduling-additional-aws-regions/",
      "pubDate": "Fri, 29 Mar 2024 21:59:48 +0000",
      "category": "Contact Center",
      "content": "  Amazon Connect forecasting, capacity planning, and scheduling are now generally available in four additional AWS regions \n Posted On:  Mar 29, 2024 \nAmazon Connect forecasting, capacity planning, and scheduling are now generally available in Europe (Frankfurt), Asia Pacific (Singapore), Asia Pacific (Tokyo), and Asia Pacific (Seoul) AWS regions. These capabilities help you predict, allocate, and verify that the right number of agents are scheduled at the right time to meet your operational goals. Machine learning (ML)–powered capabilities allow you to predict contact volume and arrival rates, convert these forecasts into projected staffing needs, and generate shifts for agents. With forecasting, capacity planning, and scheduling, you can optimize your contact center operations, meet service goals, and improve agent and customer satisfaction.\nAmazon Connect forecasting, capacity planning, and scheduling are generally available in US East (N. Virginia), US West (Oregon), Canada (Central), Europe (Frankfurt), Europe (London), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), and Asia Pacific (Tokyo) AWS regions. For information on pricing, see our pricing page. \nTo learn more and get started, click here.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 11.538461538461538
    },
    {
      "title": "Amazon OpenSearch Service doubles storage for OR1 and expands to four more regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-opensearch-service-doubles-storage-or1-four-regions/",
      "pubDate": "Thu, 04 Apr 2024 17:21:36 +0000",
      "category": "Analytics",
      "content": "  Amazon OpenSearch Service doubles storage for OR1 and expands to four more regions \n Posted On:  Apr 4, 2024 \nOR1, the OpenSearch Optimized Instance family, now doubles the max allowed storage per instance. OR1 also expands availability to four additional regions- Canada Central, EU (London), and Asia Pacific (Hyderabad, Seoul). OR1 delivers up to 30% price-performance improvement over existing instances (based on internal benchmarks), and uses Amazon S3 to provide 11 9s of durability. The new OR1 instances are best suited for indexing-heavy workloads, and offers better indexing performance compared to the existing memory optimized instances available on OpenSearch Service. \nOR1 enables customers to economically and reliably scale their OpenSearch deployments without compromising the interactive analytics experience they expect. Each OR1 instance is provisioned with compute, local instance storage for caching, and remote Amazon S3-based managed storage. OR1 offers pay-as-you-go pricing and reserved instances, with a simple hourly rate for the instance, local instance storage, as well as managed storage provisioned. OR1 instances come in sizes ‘medium’ through ‘16xlarge’, and offer compute, memory, and storage flexibility. OR1 instances support OpenSearch versions 2.11 and above. Please refer to the Amazon OpenSearch Service pricing page for pricing details. Information on new max allowed storage limits can be found in documentation.\nOR1 instance family is now available on Amazon OpenSearch Service across 4 more regions: Canada Central, Europe (London), and Asia Pacific (Hyderabad, Seoul). Please refer to the AWS Region Table for more information about Amazon OpenSearch Service availability. To get started with OR1 instances, visit our documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 7.6923076923076925
    },
    {
      "title": "Amazon Bedrock is now available in the AWS Europe (Paris) Region",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-bedrock-europe-paris-region/",
      "pubDate": "Wed, 03 Apr 2024 13:04:02 +0000",
      "category": "Artificial Intelligence",
      "content": "  Amazon Bedrock is now available in the AWS Europe (Paris) Region \n Posted On:  Apr 3, 2024 \nStarting today, customers can use Amazon Bedrock in the AWS Europe (Paris) Region to easily build and scale AI applications using a variety of foundation models and generative AI tools.  \nAmazon Bedrock is a fully managed service that offers a choice of high-performing foundation models (FMs) from leading AI companies like AI21 Labs, Anthropic, Cohere, Meta, Mistral AI, Stability AI, and Amazon via a single API. Bedrock also provides a broad set of capabilities you need to build generative AI applications with security, privacy, and responsible AI. These capabilities help you build tailored applications for multiple use cases across different industries, helping organizations unlock sustainable growth while maintaining privacy and security.  \nWith this launch, Amazon Bedrock is now available in 6 AWS Regions: US East (N. Virginia), US West (Oregon), Asia Pacific (Tokyo), Europe (Frankfurt), Europe (Paris), and the AWS GovCloud (US-West) Region. At launch, customers will have access to some of the latest models from Cohere, Mistral, Amazon, and very soon Anthropic - expanding your options to support various use cases across multiple industries.  \n To get started, visit the Amazon Bedrock page and see the Amazon Bedrock documentation for more details.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 7.6923076923076925
    },
    {
      "title": "Amazon EMR on EC2 now gracefully replaces unhealthy core nodes",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-emr-ec2-gracefully-replaces-unhealthy-core-nodes/",
      "pubDate": "Mon, 01 Apr 2024 21:10:13 +0000",
      "category": "Analytics",
      "content": "  Amazon EMR on EC2 now gracefully replaces unhealthy core nodes \n Posted On:  Apr 1, 2024 \nWe are excited to introduce a new Amazon EMR on EC2 feature that enables automatic graceful replacement of unhealthy core nodes to ensure continued optimal cluster operations and prevent data loss. Additionally, EMR on EC2 will publish CloudWatch events to provide visibility into node health and recovery actions. These improvements are available for all Amazon EMR releases.\nWith EMR on EC2, you can easily provision and scale your data processing clusters without having to manage compute infrastructure or open-source application setup. However, there can be circumstances when an EMR node turns unhealthy due to underlying hardware or memory over-utilization issue. Previously, for termination protected clusters, unhealthy core nodes would remain idle and continue to count towards cluster capacity. For other clusters, the core node replacement process was not graceful. With today’s launch, Amazon EMR minimizes job interruption and prevents data loss by gracefully decommissioning and replacing unhealthy core nodes regardless of your cluster’s termination protection setting. Amazon EMR will also publish unhealthy node replacement events that will be available in the EMR console and Amazon EventBridge.\nGraceful unhealthy core node replacement is generally available in all AWS Regions where Amazon EMR on EC2 is available.\nTo ensure this launch doesn’t affect your existing workflows, we will by default turn off unhealthy node replacement for clusters running EMR 7.0.0 and lower releases that have termination protection enabled. For all other clusters, we will turn on this feature by default. To learn more, see replacing unhealthy nodes.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 7.6923076923076925
    },
    {
      "title": "Amazon EKS extended support for Kubernetes versions now generally available",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-eks-support-kubernetes-versions/",
      "pubDate": "Mon, 01 Apr 2024 21:47:21 +0000",
      "category": "Containers",
      "content": "  Amazon EKS extended support for Kubernetes versions now generally available \n Posted On:  Apr 1, 2024 \nToday, Amazon EKS announces general availability of extended support for Kubernetes versions. You can run EKS clusters using any Kubernetes version for up to 26 months from the time the version becomes available on EKS. Extended support for Kubernetes versions is available for Kubernetes versions 1.21 and higher. For a full list of versions and support dates, see here.\nStandard support begins when a Kubernetes minor version becomes available in EKS, and continues for 14 months - the same as the Kubernetes project support window for minor versions. Past this point, the Kubernetes project stops releasing security patches for a minor version. Extended support in Amazon EKS begins immediately at the end of standard support and continues for 12 months. EKS clusters in extended support will continue to get security patches for the Kubernetes control plane as well as critical patches for the Amazon VPC CNI, kube-proxy, and CoreDNS add-ons, AWS-published EKS-Optimized AMIs, and EKS Fargate nodes.\nExtended Support for Kubernetes versions is available in all AWS regions. EKS clusters running Kubernetes versions 1.23 and higher in the extended support window will be charged $0.60 per cluster per hour, starting April 1st 2024. EKS clusters running Kubernetes versions 1.21 and 1.22 will be charged $0.60 per cluster per hour, starting May 1st 2024. Pricing for clusters running Kubernetes versions in standard support is unchanged — you will continue to pay $0.10 per cluster per hour.\nFor information about pricing, see the blog. For version support lifecycle dates and FAQs, see documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 7.6923076923076925
    },
    {
      "title": "Amazon Managed Service for Prometheus collector now supports CloudFormation",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/03/amazon-managed-service-prometheus-collector-cloudformation/",
      "pubDate": "Fri, 29 Mar 2024 17:59:25 +0000",
      "category": "Containers",
      "content": "  Amazon Managed Service for Prometheus collector now supports CloudFormation \n Posted On:  Mar 29, 2024 \nAmazon Managed Service for Prometheus collector, a fully-managed agentless collector for Prometheus metrics from Amazon EKS workloads, now supports AWS CloudFormation. Starting today, you can easily create, configure, and manage Amazon Managed Service for Prometheus collectors using CloudFormation templates. With AWS CloudFormation, you can use a programming language or simple text file to automatically configure collectors for Prometheus metrics from Amazon EKS infrastructure and applications. You can also continue utilizing the Amazon Managed Service for Prometheus collector using the AWS Management Console, Command Line Interface (CLI) or API.\nAmazon Managed Service for Prometheus collector is available in all regions where Amazon Managed Service for Prometheus is available. To learn more about Amazon Managed Service for Prometheus collector, visit the user guide or product page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 7.6923076923076925
    },
    {
      "title": "Cross-account observability enabled for CloudWatch Internet Monitor",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/cross-account-observability-cloudwatch-internet-monitor/",
      "pubDate": "Thu, 04 Apr 2024 21:56:48 +0000",
      "category": "Cloud Monitoring",
      "content": "  Cross-account observability enabled for CloudWatch Internet Monitor \n Posted On:  Apr 4, 2024 \nYou can now set up cross-account observability for Amazon CloudWatch Internet Monitor, so that you can get read-only access to monitors from multiple accounts within an AWS Region. Deploying applications by using resources in separate accounts is a good practice, to establish security and billing boundaries between teams and reduce the impact of operational events. For example, when you set up cross-account observability for Internet Monitor, you can access and view performance and availability measurements generated by monitors in different AWS accounts. \nTo get started with cross-account monitoring in Internet Monitor, you use Amazon CloudWatch Observability Access Manager (OAM) to set up one or more of your AWS accounts as a monitoring account. The monitoring account then has the ability to view data in source accounts that you configure.  \nTo learn more, visit the Internet Monitor user guide documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 3.8461538461538463
    },
    {
      "title": "Amazon Timestream for LiveAnalytics achieves FedRAMP High Authorization in AWS GovCloud West Region",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-timestream-liveanalytics-fedramp-high-authorization-aws-govcloud-west-region/",
      "pubDate": "Tue, 02 Apr 2024 20:56:01 +0000",
      "category": "Database",
      "content": "  Amazon Timestream for LiveAnalytics achieves FedRAMP High Authorization in AWS GovCloud West Region \n Posted On:  Apr 2, 2024 \nStarting today, you can now use Amazon Timestream for LiveAnalytics with workloads that require the FedRAMP High categorization level in the AWS GovCloud (US-West) Region.\nAmazon Timestream for LiveAnalytics is a fast, scalable, and serverless time-series database built for large scale workloads. With Timestream for LiveAnalytics, you process trillions of time series events per day with minimal DevOps overhead with up to 99.99% availability. The purpose-built query engine lets you access and analyze recent and historical data across storage tiers. Additionally, visualizing your data is simple with integration and connector support through Amazon Quicksight, Grafana, and JDBC.  \nAmazon Timestream for LiveAnalytics is HIPAA eligible, ISO certified, FedRAMP (High) compliant, PCI DSS compliant, and in scope for AWS’s SOC reports SOC 1, SOC 2, and SOC 3. To get started with Timestream, visit the product page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 3.8461538461538463
    },
    {
      "title": "Introducing AWS CodeConnections, formerly known as AWS CodeStar Connections",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/03/aws-codeconnections-formerly-codestar-connections/",
      "pubDate": "Fri, 29 Mar 2024 21:54:25 +0000",
      "category": "Developer Tools",
      "content": "  Introducing AWS CodeConnections, formerly known as AWS CodeStar Connections \n Posted On:  Mar 29, 2024 \nAWS is renaming AWS CodeStar Connections to AWS CodeConnections. The name change is effective in the APIs, CLI, SDK, and documentation. The AWS Management Console will create connection resources referencing CodeStar Connections till May 1, 2024, and after that it will generate connection resources referencing CodeConnections, to give you time to make changes in your IAM policies to use the new resource names. Your existing connections that reference AWS CodeStar Connections will still to continue to work as they did previously. The new APIs, CLI and Console will accept both the old and new connection resource identifiers, and the old APIs, CLI and SDK referencing CodeStar Connections will not be available after April 2025.  \nAWS CodeConnections integrates with third party Git-based source providers such as GitHub, GitLab, and Bitbucket, and enables AWS services such as AWS CodePipeline, Amazon CodeWhisperer, and AWS CloudFormation to get notified on repository events, and download the source code to build, test and deploy code.\nTo learn more about the details of this change, visit our rename summary page. For more information about AWS CodeConnections, visit our product page. AWS CodeConnections is available in all regions where AWS CodePipeline is supported except in the Asia Pacific (Hong Kong), Africa (Cape Town), Middle East (Bahrain), Europe (Zurich), Asia Pacific (Jakarta), Asia Pacific (Hyderabad), Asia Pacific (Osaka), Asia Pacific (Melbourne), Israel (Tel Aviv), Europe (Spain), and Middle East (UAE), and the AWS GovCloud (US-West) Regions.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 3.8461538461538463
    },
    {
      "title": "AWS Lambda adds support for Ruby 3.3",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-lambda-ruby-3-3/",
      "pubDate": "Thu, 04 Apr 2024 19:53:34 +0000",
      "category": "Serverless Computing",
      "content": "  AWS Lambda adds support for Ruby 3.3 \n Posted On:  Apr 4, 2024 \nAWS Lambda now supports creating serverless applications using Ruby 3.3. Developers can use Ruby 3.3 as both a managed runtime and a container base image, and AWS will automatically apply updates to the managed runtime and base image as they become available.\nThe Lambda Ruby 3.3 runtime is built on the new Amazon Linux 2023 runtime, which is based on the AL2023 minimal container image. This provides a significantly smaller deployment footprint than earlier Amazon Linux 2-based runtimes, updated versions of common libraries such as glibc, and a new package manager. The Ruby 3.3 runtime also provides access to the latest Ruby language features.\nThe Ruby 3.3 runtime is available in all Regions where Lambda is available, except for China and GovCloud Regions.\nYou can use the full range of AWS deployment tools, including the Lambda console, AWS CLI, AWS Serverless Application Model (AWS SAM), CDK, and AWS CloudFormation to deploy and manage serverless applications written in Ruby 3.3. For more information on using Ruby 3.3 in Lambda, see our documentation. For more information about AWS Lambda, visit our product page. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "AWS IAM Identity Center is now available in the  Europe (Spain) AWS Region and Asia Pacific (Hyderabad) AWS Regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-iam-identity-center-europe-spain-asia-pacific-hyderabad-aws-region/",
      "pubDate": "Thu, 04 Apr 2024 21:25:39 +0000",
      "category": "Identity and Access Management",
      "content": "  AWS IAM Identity Center is now available in the Europe (Spain) AWS Region and Asia Pacific (Hyderabad) AWS Regions \n Posted On:  Apr 4, 2024 \nYou can now deploy AWS IAM Identity Center in the Europe (Spain) and Asia Pacific (Hyderabad) AWS Regions. With the addition of these AWS Regions, IAM Identity Center is now available in 32 AWS Regions globally. \nIAM Identity Center is the recommended service for managing workforce access to AWS applications and multiple AWS accounts. Use IAM Identity Center with your existing identity source or create a new directory, and manage workforce access to part or all of your AWS environment. With IAM Identity Center, you can manage and audit user access more easily and consistently, your workforce has single sign-on access and unified experience across AWS services, and your data owners can authorize and log data access by user. IAM Identity Center is available to you at no additional cost. \nFor more information about the AWS Regions where IAM Identity Center is available, see the AWS Region table.\nTo learn more about IAM Identity Center, visit the product detail page. To get started, see the IAM Identity Center user guide.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "Announcing general availability of Amazon EC2 G6 instances",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/general-availability-amazon-ec2-g6-instances/",
      "pubDate": "Thu, 04 Apr 2024 21:50:56 +0000",
      "category": "Compute",
      "content": "  Announcing general availability of Amazon EC2 G6 instances \n Posted On:  Apr 4, 2024 \nToday we are announcing the general availability of Amazon EC2 G6 instances powered by NVIDIA L4 Tensor Core GPUs. G6 instances can be used for a wide range of graphics-intensive and machine learning use cases. G6 instances deliver up to 2x higher performance for deep learning inference and graphics workloads compared to Amazon EC2 G4dn instances. \nCustomers can use G6 instances for deploying ML models for natural language processing, language translation, video and image analysis, speech recognition, and personalization as well as graphics workloads, such as creating and rendering real-time, cinematic-quality graphics and game streaming. G6 instances feature up to 8 NVIDIA L4 Tensor Core GPUs with 24 GB of memory per GPU and third generation AMD EPYC processors. They also support up to 192 vCPUs, up to 100 Gbps of network bandwidth, and up to 7.52 TB of local NVMe SSD storage.\nAmazon EC2 G6 instances are available today in the AWS US East (N. Virginia and Ohio) and US West (Oregon) regions. Customers can purchase G6 instances as On-Demand Instances, Reserved Instances, Spot Instances, or as part of Savings Plans. \nTo get started, visit the AWS Management Console, AWS Command Line Interface (CLI), and AWS SDKs. To learn more, visit the G6 instance page.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "AWS Application Migration Service now supports migration of UEFI servers",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-application-migration-service-migration-uefi-servers/",
      "pubDate": "Thu, 04 Apr 2024 19:04:47 +0000",
      "category": "Migration & Transfer",
      "content": "  AWS Application Migration Service now supports migration of UEFI servers \n Posted On:  Apr 4, 2024 \nStarting today, you can use AWS Application Migration Service (AWS MGN) to migrate Linux servers with UEFI boot mode.\nYou now have the option to control the boot mode when migrating Linux servers, and choose Legacy BIOS or UEFI according to your needs. By default, the service will match your source boot mode and retain it during the migration, enabling you to swiftly and effortlessly migrate and launch test instances without the need for additional configuration.\nAdditionally, you can now migrate servers running Rocky 9, SUSE Linux Enterprise Server 15 SP4 and those using kernel versions up to 6.5. \nApplication Migration Service minimizes time-intensive, error-prone manual processes by automating the conversion of your source servers to run natively on AWS. It also helps simplify modernization of your migrated applications by allowing you to select preconfigured and custom optimization options during migration.\nThese features are now available in all of the AWS Regions where AWS Application Migration Service is available. Access the AWS Regional Services List for the most up-to-date availability information.\nTo start using Application Migration Service for free, sign in through the AWS Management Console. For more information, visit the Application Migration Service product page or documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "AWS Transfer Family offers predefined security policies for SFTP connectors",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-transfer-family-predefined-security-policies-sftp-connectors/",
      "pubDate": "Wed, 03 Apr 2024 21:58:24 +0000",
      "category": "Data Transfer",
      "content": "  AWS Transfer Family offers predefined security policies for SFTP connectors \n Posted On:  Apr 3, 2024 \nAWS Transfer Family’s predefined security policies for SFTP connectors gives you the flexibility to control cryptographic algorithms used for establishing connections with remote SFTP servers, enabling compatibility with a wider range of remote server configurations.\nSFTP connectors provide fully managed low-code capability to copy files at scale between remote SFTP servers and Amazon S3. Predefined security policies for SFTP connectors enable you to select the set of SSH cryptographic algorithms that are used by your connectors when negotiating a connection with remote SFTP servers. By default, your connectors select the security policy that’s restricted to supporting the most secure algorithms. With today’s launch, you also have an option to select an alternate policy that supports a wider set of algorithms for compatibility with servers that do not offer an overlap with algorithms in the default policy. When your connector attempts to connect to a remote server, only the algorithms specified in the selected policy will be used to negotiate the connection. \nPredefined security policies for SFTP connectors are available in all AWS Regions where AWS Transfer Family is available. To learn more about predefined security policies for your connectors, read the documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "Amazon DataZone announces integration with AWS Lake Formation hybrid mode",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-datazone-integration-aws-lake-formation-hybrid-mode/",
      "pubDate": "Wed, 03 Apr 2024 20:09:40 +0000",
      "category": "Data Governance",
      "content": "  Amazon DataZone announces integration with AWS Lake Formation hybrid mode \n Posted On:  Apr 3, 2024 \nAmazon DataZone is used by customers to catalog, discover, analyze, share, and govern data at scale across organizational boundaries with governance and access controls. Today, Amazon DataZone has introduced an integration with AWS Lake Formation hybrid mode. This integration enables customers to easily publish and share their AWS Glue tables through Amazon DataZone, without the need to register them in AWS Lake Formation first. Hybrid mode allows customers to start managing permissions on their AWS Glue tables through AWS Lake Formation, while continuing to maintain any existing IAM permissions on these tables.\nTo get started, administrators enable the data location registration setting under the DefaultDataLake blueprint in the Amazon DataZone console. Then when a data consumer subscribes to an AWS Glue table managed through IAM permissions, Amazon DataZone first registers the Amazon S3 locations of this table in hybrid mode, and then grants access to the data consumer by managing permissions on the table through AWS Lake Formation. This ensures that IAM permissions on the table continue to exist with newly-granted AWS Lake Formation permissions, without disrupting any existing workflows.\nThe integration between Amazon DataZone and AWS Lake Formation hybrid mode is generally available in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Asia Pacific (Seoul), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (Stockholm), Europe (London), and South America (São Paulo). \nYou can read more about these new updates in the user documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "Amazon DataZone launches integration with AWS Glue Data Quality",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-datazone-integration-glue-data-quality/",
      "pubDate": "Wed, 03 Apr 2024 20:48:45 +0000",
      "category": "Data Governance",
      "content": "  Amazon DataZone launches integration with AWS Glue Data Quality \n Posted On:  Apr 3, 2024 \nAmazon DataZone is used by customers to catalog, discover, analyze, share, and govern data at scale across organizational boundaries with governance and access controls. Today, Amazon DataZone launches integration with AWS Glue Data Quality and offers APIs to integrate data quality metrics from third party data quality solutions. This integration helps Amazon DataZone customers gain trust in their data and make confident business decisions.\nThe new integration enables customers to auto-publish AWS Glue Data Quality scores into the Amazon DataZone business data catalog with just a few clicks. Amazon DataZone APIs can be used to ingest quality metrics from third party sources. Once published, data consumers can easily search for data assets, view granular quality metrics, and identify failed checks and rules - empowering business decisions. Now, disparate quality scores can be unified into intuitive dashboards for data analysts.\nAmazon DataZone is available in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Asia Pacific (Seoul), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (Stockholm), Europe (London), and South America (São Paulo).\nYou can learn more on how to get started in our blog, user documentation and about AWS Glue data Quality in the product page. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "AWS Marketplace now supports demo and private offer requests for products",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-marketplace-demo-private-offer-requests-products/",
      "pubDate": "Tue, 02 Apr 2024 17:03:59 +0000",
      "category": "AWS Marketplace",
      "content": "  AWS Marketplace now supports demo and private offer requests for products \n Posted On:  Apr 2, 2024 \nAWS Marketplace now gives customers the ability to request product demos and private offers directly from sellers' product listing pages. This helps customers accelerate product evaluations and further reduce their procurement cycle times. \nWhile evaluating product listings, customers can easily request outreach from an AWS representative by simply filling out a form on the listing page of a participating seller. The AWS representative will work with the buyers to understand their needs and then share their request with the respective sellers, who will then deliver demos or initiate private offer discussions. By simplifying these tasks, customers quickly connect with the right seller-side contacts, streamlining product assessments and optimizing time-to-value for software purchases. \nTo learn more about submitting product demo or private offer requests, visit the AWS Marketplace Buyer Guide (demos and private offers). For sellers interested in learning about enabling this feature on their listing page, visit the AWS Marketplace Seller Guide (demos and private offers). \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "AWS AppSync increases existing service quota and adds subscription service quotas",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-appsync-increases-service-quota-adds-subscription/",
      "pubDate": "Tue, 02 Apr 2024 17:07:33 +0000",
      "category": "Application Integration",
      "content": "  AWS AppSync increases existing service quota and adds subscription service quotas \n Posted On:  Apr 2, 2024 \nAWS AppSync is a fully managed service that allows customers to connect applications to data and enable real-time experiences with GraphQL APIs.\nAppSync now supports a higher default value for the rate of request tokens service quota. The default value is increased from 2,000 to 5,000 in all AWS Regions that AppSync supports, except for the following Regions where the default value is increased to 10,000: Asia Pacific (Tokyo, Seoul, Mumbai, Singapore, Sydney), Europe (Frankfurt, Ireland, London), US East (N. Virginia, Ohio), and US West (Oregon).\nAppSync also introduces three new adjustable service quotas in all Regions that AppSync supports that control the behavior of AppSync’s real-time capabilities.\nYou can request increases to these service quotas and view your applied values in the Service Quotas console. You can learn more about inbound and outbound messages in the AppSync documentation. To learn more about AppSync’s service quotas, please refer to this documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "Announcing AWS Deadline Cloud",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/announcing-aws-deadline-cloud/",
      "pubDate": "Tue, 02 Apr 2024 17:50:13 +0000",
      "category": "Visual Effects and Rendering",
      "content": "  Announcing AWS Deadline Cloud \n Posted On:  Apr 2, 2024 \nToday, AWS announces AWS Deadline Cloud, a fully managed service that simplifies render management for teams creating 2D and 3D visual assets for films, TV shows, commercials, games, and industrial design. Deadline Cloud makes it easy to build a cloud-based render farm in minutes that scales from zero to thousands of compute instances, without needing to manage infrastructure. Deadline Cloud includes built-in integrations, including Autodesk Arnold, Autodesk Maya, Foundry Nuke, Luxion KeyShot, and SideFX Houdini, and a broad set of customization tools, so you can reduce the time required to build integrations with the team’s preferred software and tailor your render pipeline to your own needs.\nTo address the growing demand for high-resolution content, creative studios, industrial design firms, and game developers producing cinematics want to more quickly build render farms that combine the power of hundreds or thousands of computing nodes to process their rendering jobs. With Deadline Cloud, you can build a render farm using a simplified setup that reduces deployment from months to minutes. Creative teams also want to improve cost planning, visibility, and control over rendering resources and projects. The Deadline Cloud cost management capabilities provide the ability to manage rendering costs and keep budgets on track with pay-as-you-go pricing, which helps ensure you pay only for the compute you need for rendering. Creative teams can accelerate production timelines by running more projects in parallel without worrying about capacity limits.\nDeadline Cloud is generally available in the following AWS Regions: US East (N. Virginia), US East (Ohio), US West (Oregon), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Europe (Frankfurt), and Europe (Ireland).\nTo learn more, visit AWS Deadline Cloud.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "VPC Traffic Mirroring is now available in seven additional regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/vpc-traffic-mirroring-seven-additional-regions/",
      "pubDate": "Tue, 02 Apr 2024 19:55:13 +0000",
      "category": "Networking & Content Delivery",
      "content": "  VPC Traffic Mirroring is now available in seven additional regions \n Posted On:  Apr 2, 2024 \nStarting today, Amazon Virtual Private Cloud (Amazon VPC) Traffic Mirroring is available in seven new regions, including AWS Asia Pacific (Jakarta), AWS Asia Pacific (Melbourne), AWS Middle East (UAE), AWS Canada West (Calgary), AWS Europe (Spain), AWS Israel (Tel Aviv), and AWS Europe (Zurich).\nAmazon VPC Traffic Mirroring allows customers to replicate the network traffic from an EC2 instance within their VPC and forward that traffic to security and monitoring appliances for use cases such as content inspection, threat monitoring, and troubleshooting.\nWith this launch, Amazon VPC Traffic Mirroring is now available in 33 AWS regions: US East (Ohio, N. Virginia), US West (N. California, Oregon), Europe (Frankfurt, Ireland, London, Milan, Paris, Stockholm, Spain, Zurich), Asia Pacific (Hyderabad, Mumbai, Seoul, Singapore, Sydney, Hong Kong, Osaka, Tokyo, Jakarta, Melbourne), Africa (Cape Town), Canada (Central), Canada West (Calgary), South America (São Paulo), Middle East (Bahrain, UAE), Israel (Tel Aviv), China (Beijing), operated by Sinnet, China (Ningxia) operated by NWCD, and AWS GovCloud Regions (US). You can learn more about this feature by reading our documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "AWS Console Mobile Application adds support for CloudWatch custom dashboards",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-cloudwatch-custom-dashboards-console-mobile-app/",
      "pubDate": "Tue, 02 Apr 2024 17:10:10 +0000",
      "category": "Mobile Applications",
      "content": "  AWS Console Mobile Application adds support for CloudWatch custom dashboards \n Posted On:  Apr 2, 2024 \nAWS customers can now view real-time and historical data visualizations of their critical resource and application metrics in a mobile-friendly format using CloudWatch custom dashboards in the AWS Console Mobile App. Now AWS customers have convenient access to customized views of their resource and application's health and performance metrics while on-the-go.\nAWS customers can now access the same CloudWatch custom dashboards that they have in the AWS Management Console in the AWS Console Mobile App for a complete view of their AWS resource health and performance across AWS regions and accounts in a mobile friendly format while on the go. AWS customers can quickly browse or search through a list of their CloudWatch custom dashboards. They can view all of their critical resource and application metrics in real-time or for a selected timespan. AWS customers no longer need to switch to a desktop device to monitor their AWS resource and application health and performance.\nThe AWS Console Mobile App lets AWS customers view and manage a select set of resources and receive push notifications to stay informed and connected with their AWS resources while on-the-go. The sign in process supports biometrics authentication, making access to AWS resources simple, secure, and quick.\nVisit the product page for more information about the AWS Console Mobile App.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "Run Chef 11-18 recipes on Windows using AWS Systems Manager",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/chef-11-18-recipes-windows-aws-systems-manager/",
      "pubDate": "Tue, 02 Apr 2024 17:48:25 +0000",
      "category": "Management & Governance",
      "content": "  Run Chef 11-18 recipes on Windows using AWS Systems Manager \n Posted On:  Apr 2, 2024 \nToday, AWS Systems Manager introduces the ability to run Chef 11-18 recipes on Windows Amazon Elastic Compute Cloud (Amazon EC2) and on-premises instances. These capabilities, previously available only to Linux instances, enable customers to combine the power of Chef recipes with the control and safety benefits from AWS Systems Manager, regardless of whether their instances are running on Linux or Windows operating systems.\nChef is a popular configuration management tool used to configure Amazon Elastic Compute Cloud (Amazon EC2) and on-premises instances. On March 2020, we launched AWS-ApplyChefRecipes in order to enable customers to apply Chef recipes on Linux instances. With today's release, we are extending this capability to enable customers to run Chef 11-18 recipes on Windows instances using AWS-ApplyChefRecipes.\nThis release also adds support for HTTP and private git repositories, which means Systems Manager can now run Chef recipes stored in GitHub, Amazon Simple Storage Service (S3), private Git repositories, or even HTTP locations. Additionally, customers can pass custom JSON attributes to the run process.\nThis feature is now available in these AWS regions: Europe (Stockholm), Europe (Paris), Europe (Ireland), Europe (Frankfurt), Europe (London), Europe (Milan), Middle East (Bahrain), US East (Ohio), Africa (Cape Town), South America (Sao Paulo), US East (N. Virginia), US West (Oregon), US West (N. California), Asia Pacific (Seoul), Asia Pacific (Osaka), Asia Pacific (Tokyo), Asia Pacific (Hong Kong), Asia Pacific (Singapore), Asia Pacific (Mumbai), Asia Pacific (Sydney), Canada (Central). For more information, please visit the AWS Systems Manager product page and user guide documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "Amazon AppStream 2.0 can now launch IdP-initiated sessions using the Windows client",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-appstream-2-0-idp-initiated-sessions-windows-client/",
      "pubDate": "Mon, 01 Apr 2024 20:22:35 +0000",
      "category": "Desktop & App Streaming",
      "content": "  Amazon AppStream 2.0 can now launch IdP-initiated sessions using the Windows client \n Posted On:  Apr 1, 2024 \nAmazon AppStream 2.0 now supports launching the client application for Windows from an Identity Provider (IdP)-initiated SAML 2.0 sign-in flow. This feature allows your end-users to sign in to SAML 2.0 IdPs using their system's default web browser before transitioning into the streaming session in the Windows client.\nBy allowing users to sign in to the client application using their browser, they no longer need to re-authenticate as long as the SAML 2.0 session in the browser remains valid, greatly simplifying their overall experience. In addition, using the browser for authentication also enables you to enforce additional access policies such as conditional access provided by your IdPs before your users start streaming in the client. \nThe feature is now available in all the regions where AppStream 2.0 is offered. To use the feature, make sure that your AppStream 2.0 client application for Windows is version 1.1.1300 or later. You also need to use the new regional relay state endpoints to configure your SAML 2.0 federation. To learn more about the feature and the configurations, review Setting Up SAML in the AppStream 2.0 Administration Guide.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "Partner Analytics is now Analytics and Insights",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/partner-analytics-now-analytics-insights/",
      "pubDate": "Mon, 01 Apr 2024 17:05:28 +0000",
      "category": "AWS Partner Network (APN)",
      "content": "  Partner Analytics is now Analytics and Insights \n Posted On:  Apr 1, 2024 \nThe AWS Partner Analytics Dashboard is now known as Analytics and Insights, covering more insights for your AWS Marketplace and APN businesses than ever. We’ve streamlined the interface and added several new features to help you better understand how to grow with AWS:\nApproved users of a partner organization at either the Validated or Differentiated stage can access Analytics and Insights via the Analytics tab in AWS Partner Central. To learn more, check out the Analytics and Insights User Guide.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "AWS Resilience Hub expands support for FSx for Windows and Trust Advisor",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/aws-resilience-hub-fsx-windows-trust-advisor/",
      "pubDate": "Mon, 01 Apr 2024 17:04:05 +0000",
      "category": "Management & Governance",
      "content": "  AWS Resilience Hub expands support for FSx for Windows and Trust Advisor \n Posted On:  Apr 1, 2024 \nAWS Resilience Hub has expanded support for AWS Trusted Advisor, adding an additional check for unrecoverable application components. In addition, Resilience Hub has expanded support to assess applications that include Amazon FSx for Windows File Server. Resilience Hub provides a single place to define, validate, and track the resilience of your applications so that you can avoid unnecessary downtime caused by software, infrastructure, or operational disruptions.\nAs many variables can impact the resilience of your applications, preparing and protecting them from disruption should be continuous. When you use Trusted Advisor with Resilience Hub, you can now receive a notification if an application component currently unrecoverable. The notification will also recommend changes to your application components that will enable you to recover from disruption events and meet your resiliency policy target.\nFor applications using Amazon FSx for Windows File Server, Resilience Hub now provides a new set of resilience recommendations, covering Availability Zone (AZ) and Multi-AZ deployments, snapshots and backup plans, as well as data replication. Resilience Hub also provides a set of alarms and standard operation procedures (SOPs) to allow customers better control of their resilience posture. To access the new alarms, you may need to update the AWS Identity and Access Management (IAM) policy of the role you are using.\nThe new capabilities are available in all of the AWS Regions where Resilience Hub is supported. See the AWS Regional Services List for the most up-to-date availability information.\nTo learn more about Resilience Hub, visit the product page or technical documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "Private Access to the AWS Management Console is now available in all commercial AWS Regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/private-access-aws-management-console-commercial-regions/",
      "pubDate": "Mon, 01 Apr 2024 20:24:34 +0000",
      "category": "Management Tools",
      "content": "  Private Access to the AWS Management Console is now available in all commercial AWS Regions \n Posted On:  Apr 1, 2024 \nStarting today, you can now deploy AWS Management Console Private Access in US West (N. California), Africa (Cape Town), Asia Pacific (Hong Kong), Asia Pacific (Jakarta), Asia Pacific (Melbourne), Asia Pacific (Osaka), Canada (West), Europe (Frankfurt), Europe (Stockholm), Europe (Paris), Europe (Spain), Europe (Milan), Europe (Zurich), Middle East (Bahrain), Middle East (UAE), and South America (São Paulo). With this launch, AWS Management Console Private Access is now available in all commercial AWS Regions.\nAWS Management Console Private Access is an advanced security feature that allows you to define a set of trusted AWS accounts and organizations that can access the AWS Management Console from within their network. For example, with AWS Management Console Private Access, you can restrict access to personal AWS accounts from the company network. AWS Management Console Private Access is built on VPC Endpoints, which uses AWS PrivateLink to establish a connection between a customer VPC and the AWS Management Console. You can designate which accounts and AWS Organizations are allowed to access the AWS Management Console from their network. It denies attempts to access the AWS Management Console from within their network using any other AWS accounts.\nVisit Private Access documentation for the full list of supported service consoles and Regions.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "Amazon EventBridge announces an improved Learn page and other console enhancements",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/amazon-eventbridge-console-enhancements/",
      "pubDate": "Mon, 01 Apr 2024 17:16:05 +0000",
      "category": "Application Integration",
      "content": "  Amazon EventBridge announces an improved Learn page and other console enhancements \n Posted On:  Apr 1, 2024 \nAmazon EventBridge announces improvements to the Learn page in the console that make it easier for you to learn and get started with event-driven architectures. With this new page, you can now learn the basics of event-driven architectures, explore EventBridge capabilities, and understand how best to use Event Buses, Pipes, and Scheduler in your applications.\nAmazon EventBridge is comprised of Event Bus, Pipes, and Scheduler. Event Bus is a serverless event router that enables you to create scalable event-driven applications. Pipes provides a simple, consistent, and cost-effective way to create point-to-point integrations between event producers and consumers. Scheduler is a serverless scheduler that enables you to schedule tasks and events at scale.\nAdditional enhancements to the console include:\nThese new enhancements are available in: US East (Ohio and N. Virginia), US West (Oregon and N. California), Canada (Central), Europe (Paris, Stockholm, Ireland, Frankfurt, London, and Milan), Asia Pacific (Mumbai, Tokyo, Seoul, Singapore, Hong Kong, Osaka, Sydney and Jakarta), Middle East (Bahrain and UAE), Africa (Cape Town) and South America (São Paulo).\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "Announcing per-second billing for EC2 Red Hat Enterprise Linux (RHEL)-based instances",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/04/per-second-billing-ec2-rhel-based-instances/",
      "pubDate": "Mon, 01 Apr 2024 18:22:18 +0000",
      "category": "Compute",
      "content": "  Announcing per-second billing for EC2 Red Hat Enterprise Linux (RHEL)-based instances \n Posted On:  Apr 1, 2024 \nEffective April 1, 2024, AWS has extended per-second billing to Red Hat Enterprise Linux (RHEL)-based instances running on Amazon EC2. Customers will pay for RHEL-based instances that are launched in On-Demand, Reserved, and Spot form in one second increments, with a minimum of one minute.\nCustomers with use cases that require large number of instances running for irregular periods of time, such as dev/test, data processing, analytics, batch processing, image rendering, and gaming applications have benefited from per-second billing for other operating systems including Amazon Linux, Ubuntu/ Ubuntu Pro, Windows Server, and SQL Server. We have now extended per-second billing to RHEL instances so that customers can focus on improving their applications instead of maximizing usage to the hour.\nThe per-second billing automatically applies to existing and new RHEL-based instances, which include RHEL, RHEL HA, RHEL SQL, and RHEL HA SQL. This change is effective in all AWS Regions. The list prices and Spot Market prices remain on per-hour basis, but the customer bills are calculated down to the second. To learn more about running RHEL Workloads on AWS, please visit the Red Hat Solutions on AWS webpage.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "AWS Wickr is now available in additional AWS Asia Pacific Regions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/03/aws-wickr-additional-asia-pacific-regions/",
      "pubDate": "Fri, 29 Mar 2024 16:59:43 +0000",
      "category": "Communication & Collaboration",
      "content": "  AWS Wickr is now available in additional AWS Asia Pacific Regions \n Posted On:  Mar 29, 2024 \nAWS Wickr now allows you to establish a network in the Asia Pacific (Tokyo) and Asia Pacific (Singapore) Regions to help you meet data residency requirements, and other obligations.\nAWS Wickr is a security-first messaging and collaboration service with features designed to help keep your internal and external communications secure, private, and compliant. Wickr protects one-to-one and group messaging, voice and video calling, file sharing, screen sharing, and location sharing with end-to-end encryption. Customers have full administrative control over data, which includes addressing information governance polices, configuring ephemeral messaging options, and deleting credentials for lost or stolen devices. You can log both internal and external conversations in a Wickr network to a private data store that you manage, for data retention and auditing purposes.\nAWS Wickr is available in the AWS US East (Northern Virginia), AWS GovCloud (US-West), AWS Canada (Central), AWS Europe (London, Frankfurt, and Stockholm), and now in AWS Asia Pacific (Singapore, Sydney, and Tokyo) Regions.\nTo learn more and get started, see the following resources:\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "Tax dashboard now generally available for AWS Marketplace Sellers",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/03/tax-dashboard-generally-available-aws-marketplace-sellers/",
      "pubDate": "Fri, 29 Mar 2024 17:00:33 +0000",
      "category": "AWS Marketplace",
      "content": "  Tax dashboard now generally available for AWS Marketplace Sellers \n Posted On:  Mar 29, 2024 \nToday, AWS Marketplace announces the general availability of the tax dashboard for AWS Marketplace Sellers. The tax dashboard can be accessed in the AWS Marketplace Management Portal (AMMP) under the Insights > Finance operations tab. Previously, AWS Marketplace Sellers could only access taxation data through the legacy customer subscriber CSV report, or programmatically by Commerce Analytics Service (CAS). \nThis launch is important for AWS Marketplace Sellers who need a visualized reporting experience to track taxes across their transactions. With data visualization becoming an increasingly important part of business intelligence, this dashboard contains pre-built metrics and charts that help enable analysis of tax trends. The dashboard allows for dynamic searchability across filters, and custom date range filters. AWS Marketplace Sellers can download granular data directly from the dashboard in CSV or Excel formats.\nTo learn more about the tax dashboard and how to get started, review the AWS Marketplace Seller Guide. \n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "AWS Amplify Hosting is generally available in the Asia Pacific (Osaka) region",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/03/aws-amplify-hosting-asia-pacific-osaka-region/",
      "pubDate": "Fri, 29 Mar 2024 19:52:39 +0000",
      "category": "Web Application Hosting",
      "content": "  AWS Amplify Hosting is generally available in the Asia Pacific (Osaka) region \n Posted On:  Mar 29, 2024 \nAWS Amplify offers a fully managed web hosting service that accelerates your application release cycle by providing a CI/CD workflow for building and deploying web applications. Simply connect your application's code repository in the console, and changes to your frontend and backend are deployed in a single workflow on every code commit.\nWith today’s launch, Amplify Hosting is now available in 20 AWS Regions: US East (Ohio), US East (N. Virginia), US West (N. California), US West (Oregon), Asia Pacific (Hong Kong), Asia Pacific (Tokyo), Asia Pacific, Osaka, Asia Pacific (Seoul), Asia Pacific (Mumbai), Asia Pacific (Singapore), Asia Pacific (Sydney), Canada (Central), Europe (Frankfurt), Europe (Stockholm), Europe (Milan), Europe (Ireland), Europe (London), Europe (Paris), Middle East (Bahrain) and South America (São Paulo).\nAdditionally, Amplify Studio is also generally available today in Asia Pacific (Osaka). Amplify Studio is available in 19 total regions — all the above except for Asia Pacific (Hong Kong). \nGet started with AWS Amplify today.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "AWS B2B Data Interchange supports additional finance, transportation, supply chain X12 transactions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/03/aws-b2b-data-interchange-finance-transportation-supply-x12/",
      "pubDate": "Fri, 29 Mar 2024 17:22:12 +0000",
      "category": "Application Integration",
      "content": "  AWS B2B Data Interchange supports additional finance, transportation, supply chain X12 transactions \n Posted On:  Mar 29, 2024 \nAWS B2B Data Interchange now supports an expanded set of X12 transaction sets for finance, transportation, and supply chain use cases. These transaction sets add to the service’s existing support for dozens of other X12 transactions and extend the benefits of B2B Data Interchange’s fully automated, event-driven EDI transformation capabilities to new industry use cases.\nCustomers across industries such as manufacturing, e-commerce, logistics, and financial services can now use B2B Data Interchange to validate, parse, and transform a greater variety of X12 transactions received from their trading partners. Among the new transaction sets supported are those used to submit invoices, update purchase orders, share order statuses, provide shipping confirmations, and verify the price of goods and services. In addition, industry-specific transactions for mortgage insurance and rail transport use cases have also been added.\nThese additional X12 transaction sets are available in all AWS Regions where the AWS B2B Data Interchange service is available. A full list of these transactions, along with their descriptions and categories, can be found in our documentation. To learn more about building and running your EDI workflows with AWS B2B Data Interchange, take the self-paced workshop.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    },
    {
      "title": "AWS IoT Core for LoRaWAN adds metrics monitoring capability",
      "link": "https://aws.amazon.com/about-aws/whats-new/2024/03/aws-iot-core-lorawan-metrics-monitoring-capability/",
      "pubDate": "Fri, 29 Mar 2024 20:32:08 +0000",
      "category": "Internet of Things",
      "content": "  AWS IoT Core for LoRaWAN adds metrics monitoring capability \n Posted On:  Mar 29, 2024 \nToday, AWS IoT Core for LoRaWAN announces a new fleet monitoring application that enables developers capture and visualize critical operational and health parameters related to the functioning of LoRaWAN-based gateways and devices. AWS IoT Core for LoRaWAN is a fully managed LoRaWAN Network Server that supports cloud connectivity for LoRaWAN-based wireless devices. Using the new metrics feature, developers can now quickly capture system health data, such as connection signal strength, data rate, and gateway latency and analyze their fleet’s performance.\nThe metrics feature collects, aggregates, computes, and stores key historical device operational data for LoRaWAN-based devices and gateways. Developers can use these data sets to build software dashboard applications that can help fleet operators get a holistic view on their fleet’s performance and help streamline their fleet monitoring routine. Using the metrics feature, developers can quickly identify and address potential operational problems, reduce disruptions caused from device or gateway malfunction, and lower costs associated with system troubleshooting and field maintenance workflows. To access the metrics feature, developers can use the AWS IoT Core for LoRaWAN console and opt into the feature. They can also use APIs to integrate these metrics into their own software applications.\nThis new feature is available in all regions where AWS IoT Core for LoRaWAN is available. For detailed information on accessing and utilizing these metrics, visit the AWS developer guide and API documentation.\n Learn About AWS\n Resources for AWS\n Developers on AWS\n Help\n Ending Support for Internet Explorer\n",
      "relevance": 0
    }
  ]
}